[
  {
    "question": "What languages are spoken where \"Shutter\" takes place?",
    "question_entity": "{'m.0cs4yp': 'Shutter'}",
    "question_entity_name": "",
    "answer_entities": [
      "Akha Language"
    ],
    "answer_entity_names": [
      "Akha Language"
    ],
    "hop": 2,
    "qid": "WebQTrn-2748_510ee63721c43d65b08c99d91f4f4efc",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0cs4yp . \n?c ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What do Catholics call their God and has said \" It is written again, Thou shalt not tempt the Lord thy God\"?",
    "question_entity": "{'m.0c8wxp': 'Catholicism', 'm.094t_hr': 'It is written again, Thou shalt not tempt the Lord thy God.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Jesus Christ"
    ],
    "answer_entity_names": [
      "Jesus Christ"
    ],
    "hop": 2,
    "qid": "WebQTrn-372_941e1abcd5c7b97906d8e2bf25fbdbaf",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.deities ?x .\n?x ns:people.person.quotations ns:m.094t_hr . \n}",
    "dataset": "cwq",
    "compositionality_type": "conjunction"
  },
  {
    "question": "Where did the subject of the film \"Black\" pass away?",
    "question_entity": "{'m.05xdl0': 'Black'}",
    "question_entity_name": "",
    "answer_entities": [
      "Easton"
    ],
    "answer_entity_names": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_c344028c2ef7fb59dec539cb908d3214",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.05xdl0 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where is the topic of the image \"Whistler Skilift 040\" found?",
    "question_entity": "{'m.03ttk28': 'Whistler Skilift 040'}",
    "question_entity_name": "",
    "answer_entities": [
      "Coast Mountains"
    ],
    "answer_entity_names": [
      "Coast Mountains"
    ],
    "hop": 2,
    "qid": "WebQTrn-261_7bc18657d5150879fc643779b6ad5e48",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.03ttk28 . \n?c ns:location.location.containedby ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What currency is use din the country where the movie \"Motorcycle Diaries\" takes place?",
    "question_entity": "{'m.03q8xj': 'The Motorcycle Diaries'}",
    "question_entity_name": "",
    "answer_entities": [
      "Argentine peso"
    ],
    "answer_entity_names": [
      "Argentine peso"
    ],
    "hop": 2,
    "qid": "WebQTrn-1023_3f52b9fe00f821ebd9b7bd11ae80fd09",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.03q8xj . \n?c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who composed the song \"Thinkin About-U!\"?",
    "question_entity": "{'m.0zlc1qy': 'Thinkin About-U!'}",
    "question_entity_name": "",
    "answer_entities": [
      "Musician"
    ],
    "answer_entity_names": [
      "Musician"
    ],
    "hop": 2,
    "qid": "WebQTrn-2428_7f8dba203353c3b7569b073ccb09dae6",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0zlc1qy . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the artist of \"Hot Rod Heart\" born and raised?",
    "question_entity": "{'m.0v_yzky': 'Hot Rod Heart'}",
    "question_entity_name": "",
    "answer_entities": [
      "Glen Dale"
    ],
    "answer_entity_names": [
      "Glen Dale"
    ],
    "hop": 2,
    "qid": "WebQTrn-2215_38e836442d3d4535942bf8f0cbbbe65a",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0v_yzky . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who inspired the person who wrote the lyrics for \"Street Scene: Act I. No. 6b Quartet\" to write poetry?",
    "question_entity": "{'m.0_74_pw': 'Street Scene: Act I. No. 6b Quartet'}",
    "question_entity_name": "",
    "answer_entities": [
      "Walt Whitman"
    ],
    "answer_entity_names": [
      "Walt Whitman"
    ],
    "hop": 2,
    "qid": "WebQTrn-303_770773a5150d1cdd3cfadfc25022720b",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0_74_pw . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where is the location of the film \"Madly in Love\"?",
    "question_entity": "{'m.0bgdthp': 'Madly in Love'}",
    "question_entity_name": "",
    "answer_entities": [
      "Italy"
    ],
    "answer_entity_names": [
      "Italy"
    ],
    "hop": 2,
    "qid": "WebQTrn-14_36f43a04afe0083042ec753a2981ab21",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0bgdthp . \n?c ns:location.location.containedby ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the person that stated \"The devil is God's ape!\", occupation?",
    "question_entity": "{'m.048g2gr': \"The devil is God's ape!\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Professor"
    ],
    "answer_entity_names": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_ab26b7d4883184a9fa73a088819de4c9",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048g2gr . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What's the topic of the picture \"Flag of Calabria Italy\"?",
    "question_entity": "{'m.04r6z74': 'Flag of Calabria'}",
    "question_entity_name": "",
    "answer_entities": [
      "Italian region"
    ],
    "answer_entity_names": [
      "Italian region"
    ],
    "hop": 2,
    "qid": "WebQTrn-724_d133cd1308f3fd8e12b6e2eb7acbc859",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.04r6z74 . \n?c ns:common.topic.notable_types ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the writer of the lyrics \"Unwanted\" born?",
    "question_entity": "{'m.0wfw_hx': 'Unwanted'}",
    "question_entity_name": "",
    "answer_entities": [
      "Belleville"
    ],
    "answer_entity_names": [
      "Belleville"
    ],
    "hop": 2,
    "qid": "WebQTrn-846_e852443b88aebb56535c3fb8390109ca",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0wfw_hx . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What currency is used in the country where \"La hora de la siesta\" is set?",
    "question_entity": "{'m.0qsdlx5': 'La hora de la siesta'}",
    "question_entity_name": "",
    "answer_entities": [
      "Argentine peso"
    ],
    "answer_entity_names": [
      "Argentine peso"
    ],
    "hop": 2,
    "qid": "WebQTrn-1023_5bf6906c26a34660ad81a9e0506d36fc",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0qsdlx5 . \n?c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where did the recording artist for \"Suit & Tie\" grow up?",
    "question_entity": "{'m.0sgzv9r': 'Suit & Tie'}",
    "question_entity_name": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "answer_entity_names": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_8349bb144acf1f6bb43d68bfa35e97c1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0sgzv9r . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where is the birthplace of the subject of the film \"We Fight to be Free\"?",
    "question_entity": "{'m.0n_v7g3': 'We Fight to Be Free'}",
    "question_entity_name": "",
    "answer_entities": [
      "Westmoreland County"
    ],
    "answer_entity_names": [
      "Westmoreland County"
    ],
    "hop": 2,
    "qid": "WebQTrn-2218_7fde645929322023cada4f38c263bdcb",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0n_v7g3 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Whereabouts was the writer of \"Poor Richard's Almanac of 1735\" brought up?",
    "question_entity": "{'m.040v_ty': \"Poor Richard's Almanac of 1735\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Boston"
    ],
    "answer_entity_names": [
      "Boston"
    ],
    "hop": 2,
    "qid": "WebQTrn-3038_75053cb108f036148b2e5631983f76a3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.040v_ty . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the place of death for the subject of the movie \"The Miracle Worker?\"?",
    "question_entity": "{'m.02r7rth': 'The Miracle Worker'}",
    "question_entity_name": "",
    "answer_entities": [
      "Easton"
    ],
    "answer_entity_names": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_73c5cf3f70ecb7e35617a190ddff860b",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.02r7rth . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "The person who said, \"In this Revolution no plans have been written for retreat,\" where was he shot?",
    "question_entity": "{'m.048j69x': 'In this Revolution no plans have been written for retreat.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Memphis"
    ],
    "answer_entity_names": [
      "Memphis"
    ],
    "hop": 2,
    "qid": "WebQTrn-125_2fd33d22c32307ac6536d5c5644a1bde",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048j69x . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What city did the primary focus of the image \"John Muir Cane\" die in?",
    "question_entity": "{'m.02c6jj0': 'John Muir Cane'}",
    "question_entity_name": "",
    "answer_entities": [
      "Los Angeles"
    ],
    "answer_entity_names": [
      "Los Angeles"
    ],
    "hop": 2,
    "qid": "WebQTrn-706_6032efd4798dd7c25582a0bc6cc5b4ea",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.02c6jj0 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the name of the U.S. time zone in which the film \"Capitalism: A Love Story\" took place?",
    "question_entity": "{'m.065zzr_': 'Capitalism: A Love Story'}",
    "question_entity_name": "",
    "answer_entities": [
      "UTC−05:00"
    ],
    "answer_entity_names": [
      "UTC−05:00"
    ],
    "hop": 2,
    "qid": "WebQTrn-1283_c14b4adc328f5f45ba766e95d00b57a3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.065zzr_ . \n?c ns:location.location.time_zones ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "On which continent was the location of the movie \"Holiday in the Sun?\"?",
    "question_entity": "{'m.0839rh': 'Holiday in the Sun'}",
    "question_entity_name": "",
    "answer_entities": [
      "North America"
    ],
    "answer_entity_names": [
      "North America"
    ],
    "hop": 2,
    "qid": "WebQTrn-1722_2daa95eca863a55e944d56891e48b332",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0839rh . \n?c ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the birthplace and childhood home of the person who wrote the lyrics to \"Ticks\"?",
    "question_entity": "{'m.02vy9j7': 'Ticks'}",
    "question_entity_name": "",
    "answer_entities": [
      "Glen Dale"
    ],
    "answer_entity_names": [
      "Glen Dale"
    ],
    "hop": 2,
    "qid": "WebQTrn-2215_b6e5a37f53b9952902db798f613a2978",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.02vy9j7 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  }
]