[
  {
    "question": "What is the name of the daughter of the artist who had the \"The Mrs. Carter Show World Tour\"?",
    "question_entity": "{'m.0qftnyr': 'The Mrs. Carter Show World Tour'}",
    "question_entity_name": "",
    "answer_entities": [
      "Blue Ivy"
    ],
    "answer_entity_names": [
      "Blue Ivy"
    ],
    "hop": 2,
    "qid": "WebQTrn-1770_76c2e83b07b9da336705f1d623faf5a4",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.artist.concert_tours ns:m.0qftnyr . \n?c ns:people.person.children ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the author of \"Profiles in Courage\" raised?",
    "question_entity": "{'m.04v21dt': 'Profiles in courage'}",
    "question_entity_name": "",
    "answer_entities": [
      "Brookline"
    ],
    "answer_entity_names": [
      "Brookline"
    ],
    "hop": 2,
    "qid": "WebQTrn-2815_4d2f11c63fa0611b0e29bc00f41bf7a9",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04v21dt . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who were influences on the subject of \"Pollock's Work?\"?",
    "question_entity": "{'m.01716t': 'Pollock'}",
    "question_entity_name": "",
    "answer_entities": [
      "Pablo Picasso"
    ],
    "answer_entity_names": [
      "Pablo Picasso"
    ],
    "hop": 2,
    "qid": "WebQTrn-2316_47b067b98845fdb2ebaf2442f5ad1298",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.01716t . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the person who recorded \"I'm Gonna Get Drunk and Play Hank Williams\" born?",
    "question_entity": "{'m.0k1q72c': \"I'm Gonna Get Drunk and Play Hank Williams\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Glen Dale"
    ],
    "answer_entity_names": [
      "Glen Dale"
    ],
    "hop": 2,
    "qid": "WebQTrn-2215_2fa90adc92b5095b8e1fd27754180250",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0k1q72c . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who is the daughter of the composer for the work \"dangerously in Love 2\"?",
    "question_entity": "{'m.094t6x': 'Dangerously in Love 2'}",
    "question_entity_name": "",
    "answer_entities": [
      "Blue Ivy"
    ],
    "answer_entity_names": [
      "Blue Ivy"
    ],
    "hop": 2,
    "qid": "WebQTrn-1770_6a7c160ace84e7908302f805739ad06d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.094t6x . \n?c ns:people.person.children ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "In what nation would you find the topic of the image \"The Montelbaanstoren (1512) on the Oude Schans\"?",
    "question_entity": "{'m.03tmx8l': 'The Montelbaanstoren (1512) on the Oude Schans'}",
    "question_entity_name": "",
    "answer_entities": [
      "Netherlands"
    ],
    "answer_entity_names": [
      "Netherlands"
    ],
    "hop": 2,
    "qid": "WebQTrn-497_a36d1c20b53f39947d462b263c6e1203",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.03tmx8l . \n?c ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What did the person who said \"God's first creature, which was light\" do?",
    "question_entity": "{'m.048h1y5': \"God's first creature, which was light.\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Scientist"
    ],
    "answer_entity_names": [
      "Scientist"
    ],
    "hop": 2,
    "qid": "WebQTrn-2859_1d0f95cbca773971acb85244d72bed62",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048h1y5 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the hometown of the subject of the movie \"George Washington's First War: The Battles for Fort Duquesne\"?",
    "question_entity": "{'m.0crsj9s': \"George Washington's First War: The Battles for Fort Duquesne\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Westmoreland County"
    ],
    "answer_entity_names": [
      "Westmoreland County"
    ],
    "hop": 2,
    "qid": "WebQTrn-2218_05b93d057f56c7f623f0bed078a219b3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0crsj9s . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What was the profession of the person who said \"Mysteries are due to secrecy.\"?",
    "question_entity": "{'m.048c4m_': 'Mysteries are due to secrecy.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Scientist"
    ],
    "answer_entity_names": [
      "Scientist"
    ],
    "hop": 2,
    "qid": "WebQTrn-2859_aa42f50ae2e11ff4be5d8dbb6c65e099",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048c4m_ . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "On which continent, is the location where the movie, \"Speed 2: Cruise Control\" , occur?",
    "question_entity": "{'m.0419kt': 'Speed 2: Cruise Control'}",
    "question_entity_name": "",
    "answer_entities": [
      "North America"
    ],
    "answer_entity_names": [
      "North America"
    ],
    "hop": 2,
    "qid": "WebQTrn-1722_d50834f94faf4fc329933bfc896be576",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0419kt . \n?c ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What was the profession on the songwrite who wrote \"Aus tiefer Not schrei ich zu dir\"?",
    "question_entity": "{'m.010ylg25': 'Aus tiefer Not schrei ich zu dir'}",
    "question_entity_name": "",
    "answer_entities": [
      "Professor"
    ],
    "answer_entity_names": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_d33dcb8918f3336a4ee93cfc8bcc332d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.010ylg25 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the name of the location, where the film, \"The Loved Ones\" occur?",
    "question_entity": "{'m.07l4_nv': 'The Loved Ones'}",
    "question_entity_name": "",
    "answer_entities": [
      "William Lamb, 2nd Viscount Melbourne"
    ],
    "answer_entity_names": [
      "William Lamb, 2nd Viscount Melbourne"
    ],
    "hop": 2,
    "qid": "WebQTrn-3379_1555b448547cae902ba0ac654a097948",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.07l4_nv . \n?c ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who inspired the person who said, \"Her voice is full of money\"?",
    "question_entity": "{'m.048jrqw': 'Her voice is full of money.'}",
    "question_entity_name": "",
    "answer_entities": [
      "T. S. Eliot"
    ],
    "answer_entity_names": [
      "T. S. Eliot"
    ],
    "hop": 2,
    "qid": "WebQTrn-894_e8816f41e30cc619312fa050ff173448",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048jrqw . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What are the official languages of the setting of the movie \"Three Stories of Galicia\"?",
    "question_entity": "{'m.0wq0vzw': 'Three Stories of Galicia'}",
    "question_entity_name": "",
    "answer_entities": [
      "Moldovan language"
    ],
    "answer_entity_names": [
      "Moldovan language"
    ],
    "hop": 2,
    "qid": "WebQTrn-2319_90b940cb467238cc91ecfd5f2fd89fb1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0wq0vzw . \n?c ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where is the childhood home of the person who said \"Who is rich? He that rejoices in his portion.\"?",
    "question_entity": "{'m.048k067': 'Who is rich? He that rejoices in his portion.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Boston"
    ],
    "answer_entity_names": [
      "Boston"
    ],
    "hop": 2,
    "qid": "WebQTrn-3038_15cace8f716a3aed245757a5874e1bb0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048k067 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What work did the person do who said, \"Forgiveness is God's command\"?",
    "question_entity": "{'m.048g5hc': \"Forgiveness is God's command.\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Professor"
    ],
    "answer_entity_names": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_290076b4968a6b1f5f7b5425d3a5e9f0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048g5hc . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the movie \"Shoot 'Em Up\" filmed?",
    "question_entity": "{'m.0dz9by': \"Shoot 'Em Up\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Ontario"
    ],
    "answer_entity_names": [
      "Ontario"
    ],
    "hop": 2,
    "qid": "WebQTrn-3033_9bff9b3325534dae4908b820d4364101",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0dz9by . \n?c ns:base.biblioness.bibs_location.state ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who was the inspiration for the person that said \"There are no second acts in American lives\"?",
    "question_entity": "{'m.048d7sw': 'There are no second acts in American lives.'}",
    "question_entity_name": "",
    "answer_entities": [
      "T. S. Eliot"
    ],
    "answer_entity_names": [
      "T. S. Eliot"
    ],
    "hop": 2,
    "qid": "WebQTrn-894_b751ce0f39b884d02f214d615fe3cb57",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048d7sw . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Who served as Vice President under the subject of the film \"Reagan\"?",
    "question_entity": "{'m.0g8n81t': 'Reagan'}",
    "question_entity_name": "",
    "answer_entities": [
      "George H. W. Bush"
    ],
    "answer_entity_names": [
      "George H. W. Bush"
    ],
    "hop": 2,
    "qid": "WebQTrn-2258_a37f457dd3fdc936b7b86a218e415de7",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0g8n81t . \n?c ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the person born that said \"Eat to please thyself, but dress to please others.\"?",
    "question_entity": "{'m.048gglz': 'Eat to please thyself, but dress to please others.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Boston"
    ],
    "answer_entity_names": [
      "Boston"
    ],
    "hop": 2,
    "qid": "WebQTrn-3098_530c9b007d2e31175fa177ade7ae14ab",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048gglz . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where is the artist who recorded \"Out of Your Mind\" from?",
    "question_entity": "{'m.0nrtqq': 'Out of Your Mind (radio edit)'}",
    "question_entity_name": "",
    "answer_entities": [
      "Harlow"
    ],
    "answer_entity_names": [
      "Harlow"
    ],
    "hop": 2,
    "qid": "WebQTrn-3412_305f49b65a760af0e6ce8d06f43aa22a",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0nrtqq . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where did the author of the lyrics for \"Excuse Me Miss\" grow up?",
    "question_entity": "{'m.0d1yq4': 'Excuse Me Miss'}",
    "question_entity_name": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "answer_entity_names": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_babe81e436454a7d4877c4ae80975c85",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0d1yq4 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the current government of the place where \"The Alchemist of Happiness\" takes place?",
    "question_entity": "{'m.0c2_wc': 'The Alchemist of Happiness'}",
    "question_entity_name": "",
    "answer_entities": [
      "Presidential system"
    ],
    "answer_entity_names": [
      "Presidential system"
    ],
    "hop": 2,
    "qid": "WebQTrn-1758_477d7040a0ed5bfecb155b8b3d3082fb",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0c2_wc . \n?c ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What did the person who wrote \"Vater unser im Himmelreich\" do?",
    "question_entity": "{'m.0_k8qx0': 'Vater unser im Himmelreich'}",
    "question_entity_name": "",
    "answer_entities": [
      "Professor"
    ],
    "answer_entity_names": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_343695bdd9b0b5e1e34112bcaffacde0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0_k8qx0 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What jobs were done by the author who wrote \"The New Atlantis\"?",
    "question_entity": "{'m.04v1lg6': 'The New Atlantis'}",
    "question_entity_name": "",
    "answer_entities": [
      "Scientist"
    ],
    "answer_entity_names": [
      "Scientist"
    ],
    "hop": 2,
    "qid": "WebQTrn-2859_37bf80e89387cf09fca66eb7915a52b0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04v1lg6 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What instruments are played by the composer of \"Colonial Mentality\"?",
    "question_entity": "{'m.0qfj60w': 'Colonial Mentality'}",
    "question_entity_name": "",
    "answer_entities": [
      "Drums"
    ],
    "answer_entity_names": [
      "Drums"
    ],
    "hop": 2,
    "qid": "WebQTrn-2615_02ff1000554288163476ec3bce4c7c2d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0qfj60w . \n?c ns:music.group_member.instruments_played ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where did the composer of the lyrics \"All Around the World\" grow up?",
    "question_entity": "{'m.0jxkzb9': 'All Around The World'}",
    "question_entity_name": "",
    "answer_entities": [
      "London"
    ],
    "answer_entity_names": [
      "London"
    ],
    "hop": 2,
    "qid": "WebQTrn-1297_99157c72607b35d66607df042ab3af4f",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0jxkzb9 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where did the subject of the image \"Martin Luther King, Jr.\" get shot?",
    "question_entity": "{'m.02bgnz2': 'Martin Luther King, Jr.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Memphis"
    ],
    "answer_entity_names": [
      "Memphis"
    ],
    "hop": 2,
    "qid": "WebQTrn-125_92e9299022203f700e6002d02143b613",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.02bgnz2 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "In what country would you find the topic of the image \"Wapen_van_Amsterdam_bewerkt.PNG\"?",
    "question_entity": "{'m.03bvwt1': 'Wapen_van_Amsterdam_bewerkt.PNG'}",
    "question_entity_name": "",
    "answer_entities": [
      "Netherlands"
    ],
    "answer_entity_names": [
      "Netherlands"
    ],
    "hop": 2,
    "qid": "WebQTrn-497_a1739c3fe23ae1c5f93a421061ef5a1d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.03bvwt1 . \n?c ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the subject of the movie \"An American Affair\" raised?",
    "question_entity": "{'m.05h4nz9': 'An American Affair'}",
    "question_entity_name": "",
    "answer_entities": [
      "Brookline"
    ],
    "answer_entity_names": [
      "Brookline"
    ],
    "hop": 2,
    "qid": "WebQTrn-2815_56e8d2e51ce1a46013d0176a58f8d5b3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.05h4nz9 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the composer of \"Thought of You\" raised?",
    "question_entity": "{'m.0jxk_hq': 'Thought Of You'}",
    "question_entity_name": "",
    "answer_entities": [
      "London"
    ],
    "answer_entity_names": [
      "London"
    ],
    "hop": 2,
    "qid": "WebQTrn-1297_11e4c2b019af8a62700bd4b1fe6d1cfd",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0jxk_hq . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What kind of money is used where the subject of the image \"Los Andes\" is found?",
    "question_entity": "{'m.02wtj8c': 'Los Andes'}",
    "question_entity_name": "",
    "answer_entities": [
      "Argentine peso"
    ],
    "answer_entity_names": [
      "Argentine peso"
    ],
    "hop": 2,
    "qid": "WebQTrn-1023_8aae72630c47d660704dda5e96688d1d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.02wtj8c . \n?c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where did the person that stated, \"College isn't the place to go for ideas.\", die at?",
    "question_entity": "{'m.048f8ng': \"College isn't the place to go for ideas.\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Easton"
    ],
    "answer_entity_names": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_8fe5ec39e992465249b6b75c971057ed",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048f8ng . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What does the religion who has a deity \"The Father\" call their God?",
    "question_entity": "{'m.077_fbm': 'The Father'}",
    "question_entity_name": "",
    "answer_entities": [
      "The Father"
    ],
    "answer_entity_names": [
      "The Father"
    ],
    "hop": 2,
    "qid": "WebQTrn-372_301c8094ece19fea6abf81373a2cb78d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:religion.religion.deities ns:m.077_fbm . \n?c ns:religion.religion.deities ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where did the person who was quoted saying \"Nothing pains some people more than having to think,\" killed?",
    "question_entity": "{'m.048fymc': 'Nothing pains some people more than having to think.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Memphis"
    ],
    "answer_entity_names": [
      "Memphis"
    ],
    "hop": 2,
    "qid": "WebQTrn-125_693b01b24a8f9603a580d83fd80d39c1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048fymc . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "The name of the place where the location of the film \"House of Wax\" comes from where?",
    "question_entity": "{'m.060v34': 'House of Wax'}",
    "question_entity_name": "",
    "answer_entities": [
      "William Lamb, 2nd Viscount Melbourne"
    ],
    "answer_entity_names": [
      "William Lamb, 2nd Viscount Melbourne"
    ],
    "hop": 2,
    "qid": "WebQTrn-3379_52c6811b1a36b4eb2a9661b0b4de6bb1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.060v34 . \n?c ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What movies does the subject of the image \"Empire9.jpg\" play in?",
    "question_entity": "{'m.0b7bx_k': 'Empire9.jpg'}",
    "question_entity_name": "",
    "answer_entities": [
      "The Twilight Saga: Breaking Dawn - Part 1"
    ],
    "answer_entity_names": [
      "The Twilight Saga: Breaking Dawn - Part 1"
    ],
    "hop": 2,
    "qid": "WebQTrn-25_a595672eac8b0f404df1cdec081c2e10",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.0b7bx_k . \n?c ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the person raised who recorded \"Happy Birthday, Mr. President\"?",
    "question_entity": "{'m.0_jd323': 'Happy Birthday, Mr. President'}",
    "question_entity_name": "",
    "answer_entities": [
      "Brookline"
    ],
    "answer_entity_names": [
      "Brookline"
    ],
    "hop": 2,
    "qid": "WebQTrn-2815_3a40921ae6042ff93cc654f727b80209",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0_jd323 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the childhood home of the artist who recorded \"I'll Be\"?",
    "question_entity": "{'m.0249140': \"I'll Be\"}",
    "question_entity_name": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "answer_entity_names": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_7d2edee5ce98d6b13dfd25714bb3a6b8",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0249140 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "Where was the \"Still D.R.E.\" lyricist raised?",
    "question_entity": "{'m.0b8wth': 'Still D.R.E.'}",
    "question_entity_name": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "answer_entity_names": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_c0b39ce6f793480f678ceccad425298e",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0b8wth . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What is the occupation of the lyracist for \"800?\"?",
    "question_entity": "{'m.0zhw02j': '800'}",
    "question_entity_name": "",
    "answer_entities": [
      "Musician"
    ],
    "answer_entity_names": [
      "Musician"
    ],
    "hop": 2,
    "qid": "WebQTrn-2428_e9c8e846947ab5ad35bd595466aa0bab",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0zhw02j . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What politicains serves as Vice President under the Presidnet who quoted \"Government does not solve problems; it subsidizes them.\"?",
    "question_entity": "{'m.048g5vm': 'Government does not solve problems; it subsidizes them.'}",
    "question_entity_name": "",
    "answer_entities": [
      "George H. W. Bush"
    ],
    "answer_entity_names": [
      "George H. W. Bush"
    ],
    "hop": 2,
    "qid": "WebQTrn-2258_c20dea9851e737a04505f91280ade736",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048g5vm . \n?c ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  },
  {
    "question": "What are the names of the children of the publishing author of \"Snow White and the Seven Dwarves\"?",
    "question_entity": "{'m.04vv23t': 'Snow White and the Seven Dwarfs'}",
    "question_entity_name": "",
    "answer_entities": [
      "Sharon Mae Disney"
    ],
    "answer_entity_names": [
      "Sharon Mae Disney"
    ],
    "hop": 2,
    "qid": "WebQTrn-62_ea58dc4e50cbfaac0c9c86eba471062d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04vv23t . \n?c ns:people.person.children ?x .\n}\n",
    "dataset": "cwq",
    "compositionality_type": "composition"
  }
]