[
  {
    "question": "What genres of music were favored by the lyacist for \"Proses Lyriques?\"?",
    "question_entity": "",
    "answer_entities": [
      "Ballet"
    ],
    "hop": 2,
    "qid": "WebQTest-389_4f3ec45f5837cea5be1e43247b68086a",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0gbm8_g . \n?c ns:music.artist.genre ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What genre of music was performed by the writer of \"Nuit sans Fin?\"?",
    "question_entity": "",
    "answer_entities": [
      "Ballet"
    ],
    "hop": 2,
    "qid": "WebQTest-389_6f77f1ef356ca56bf9b3b3e8fa165e27",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0gbmbrc . \n?c ns:music.artist.genre ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What type of Claude Debussy music appears in the film, \"Black Tights\"?",
    "question_entity": "",
    "answer_entities": [
      "Ballet"
    ],
    "hop": 2,
    "qid": "WebQTest-389_b58a80f073ce333ff592cf88024eb191",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vvy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vvy ns:music.artist.genre ?x .\n?x ns:film.film_genre.films_in_this_genre ns:m.04j334b . \n}",
    "dataset": "cwq"
  },
  {
    "question": "What was the occupation of the person who said \"War is too important a matter to be left to the military.\"?",
    "question_entity": "",
    "answer_entities": [
      "Writer"
    ],
    "hop": 2,
    "qid": "WebQTest-43_6988da193226944bb48ca59b2115a2b6",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048hg08 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In what time zone does the film \"Nashville\" take place?",
    "question_entity": "",
    "answer_entities": [
      "Central Time Zone"
    ],
    "hop": 2,
    "qid": "WebQTest-519_a236cf83f662b6d443c9d7e1b28b2b37",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0j_t1 . \n?c ns:location.location.time_zones ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What are all the movies the composer of \"Speak Now\" has been in?",
    "question_entity": "",
    "answer_entities": [
      "The Lorax"
    ],
    "hop": 2,
    "qid": "WebQTest-538_0498a505f7181a2845005aaf16d345ba",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0dlm3zy . \n?c ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What was the place of death of the person who wrote the lyrics to \"Stoke It Noel\"?",
    "question_entity": "",
    "answer_entities": [
      "New Orleans"
    ],
    "hop": 2,
    "qid": "WebQTest-542_216264fded30a84867101ba378e2428e",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0zk20vr . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In which American Southern City did the \"Downs\" composer die?",
    "question_entity": "",
    "answer_entities": [
      "New Orleans"
    ],
    "hop": 2,
    "qid": "WebQTest-542_9131e49190aad60dc4fbd564e78cf5d5",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0zht_kh . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What kind of guitar did the recording artist for \"Life in the Fast Lane\" play?",
    "question_entity": "",
    "answer_entities": [
      "Fender Stratocaster"
    ],
    "hop": 2,
    "qid": "WebQTest-548_4d11a45faace15d2c9d5dae9832cae4c",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0fxc8f2 . \n?c ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What type of guitar was used by the lyricists of \"Funk #49\"?",
    "question_entity": "",
    "answer_entities": [
      "Fender Stratocaster"
    ],
    "hop": 2,
    "qid": "WebQTest-548_4ed7d453c445df967570b4685d656f9c",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0jsjjj5 . \n?c ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What kind of guitar did the composer of \"The Confessor\" play?",
    "question_entity": "",
    "answer_entities": [
      "Fender Stratocaster"
    ],
    "hop": 2,
    "qid": "WebQTest-548_6b65a7948e8a5a52b1ed74160c4aecb3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.05mqghg . \n?c ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What work does the artist who recorded \"Soda Pop\" do?",
    "question_entity": "",
    "answer_entities": [
      "Actor"
    ],
    "hop": 2,
    "qid": "WebQTest-55_5d347c9ca6d42c2ca74e06b6bec081cb",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0yby29k . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the timezone in the location of the movie \"Alice Doesn't Live Here Anymore\"?",
    "question_entity": "",
    "answer_entities": [
      "Mountain Time Zone"
    ],
    "hop": 2,
    "qid": "WebQTest-717_b4fff5e42f83a0b3af3821b6d5fbd3dd",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.01gvts . \n?c ns:location.location.time_zones ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Which county is the film \"Attention Shoppers\" set in?",
    "question_entity": "",
    "answer_entities": [
      "Montgomery County"
    ],
    "hop": 2,
    "qid": "WebQTest-783_4abff209a4779f8cada700c90babf2de",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.02kbbcj . \n?c ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What county in Texas is the location where the movie \"Puncture\" takes place?",
    "question_entity": "",
    "answer_entities": [
      "Montgomery County"
    ],
    "hop": 2,
    "qid": "WebQTest-783_b181354faec01d121c5f050e0d0da2fd",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0c1fbxk . \n?c ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What city was the place of death for the person who quoted \"The sky is no longer the limit.\"?",
    "question_entity": "",
    "answer_entities": [
      "New York City"
    ],
    "hop": 2,
    "qid": "WebQTest-96_4cc67ce49bb7a1fec24d61aaf2014ff5",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048kkrd . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where does the Ireland team with the fight song \"Ireland's Call\" play?",
    "question_entity": "",
    "answer_entities": [
      "Aviva Stadium"
    ],
    "hop": 2,
    "qid": "WebQTest-996_e0a199dde06fb3ce678e842ac26c887b",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:sports.sports_team.fight_song ns:m.01fy1j . \n?c ns:sports.sports_team.arena_stadium ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What currency is use din the country where the movie \"Motorcycle Diaries\" takes place?",
    "question_entity": "",
    "answer_entities": [
      "Argentine peso"
    ],
    "hop": 2,
    "qid": "WebQTrn-1023_3f52b9fe00f821ebd9b7bd11ae80fd09",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.03q8xj . \n?c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What currency is used in the country where \"La hora de la siesta\" is set?",
    "question_entity": "",
    "answer_entities": [
      "Argentine peso"
    ],
    "hop": 2,
    "qid": "WebQTrn-1023_5bf6906c26a34660ad81a9e0506d36fc",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0qsdlx5 . \n?c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What kind of money is used where the subject of the image \"Los Andes\" is found?",
    "question_entity": "",
    "answer_entities": [
      "Argentine peso"
    ],
    "hop": 2,
    "qid": "WebQTrn-1023_8aae72630c47d660704dda5e96688d1d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.02wtj8c . \n?c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "The person who said, \"In this Revolution no plans have been written for retreat,\" where was he shot?",
    "question_entity": "",
    "answer_entities": [
      "Memphis"
    ],
    "hop": 2,
    "qid": "WebQTrn-125_2fd33d22c32307ac6536d5c5644a1bde",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048j69x . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the person who was quoted saying \"Nothing pains some people more than having to think,\" killed?",
    "question_entity": "",
    "answer_entities": [
      "Memphis"
    ],
    "hop": 2,
    "qid": "WebQTrn-125_693b01b24a8f9603a580d83fd80d39c1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048fymc . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the subject of the image \"Martin Luther King, Jr.\" get shot?",
    "question_entity": "",
    "answer_entities": [
      "Memphis"
    ],
    "hop": 2,
    "qid": "WebQTrn-125_92e9299022203f700e6002d02143b613",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.02bgnz2 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the name of the U.S. time zone in which the film \"Capitalism: A Love Story\" took place?",
    "question_entity": "",
    "answer_entities": [
      "UTC−05:00"
    ],
    "hop": 2,
    "qid": "WebQTrn-1283_c14b4adc328f5f45ba766e95d00b57a3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.065zzr_ . \n?c ns:location.location.time_zones ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the composer of \"Thought of You\" raised?",
    "question_entity": "",
    "answer_entities": [
      "London"
    ],
    "hop": 2,
    "qid": "WebQTrn-1297_11e4c2b019af8a62700bd4b1fe6d1cfd",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0jxk_hq . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the composer of the lyrics \"All Around the World\" grow up?",
    "question_entity": "",
    "answer_entities": [
      "London"
    ],
    "hop": 2,
    "qid": "WebQTrn-1297_99157c72607b35d66607df042ab3af4f",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0jxkzb9 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What type of paintings were created by the subject of the movie \"Frida Still Life\"?",
    "question_entity": "",
    "answer_entities": [
      "Surrealism"
    ],
    "hop": 2,
    "qid": "WebQTrn-1484_c4d4e06a9ed122d9ffa605447e7772ac",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0bq9r3g . \n?c ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where is the location of the film \"Madly in Love\"?",
    "question_entity": "",
    "answer_entities": [
      "Italy"
    ],
    "hop": 2,
    "qid": "WebQTrn-14_36f43a04afe0083042ec753a2981ab21",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0bgdthp . \n?c ns:location.location.containedby ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "On which continent was the location of the movie \"Holiday in the Sun?\"?",
    "question_entity": "",
    "answer_entities": [
      "North America"
    ],
    "hop": 2,
    "qid": "WebQTrn-1722_2daa95eca863a55e944d56891e48b332",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0839rh . \n?c ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "On which continent, is the location where the movie, \"Speed 2: Cruise Control\" , occur?",
    "question_entity": "",
    "answer_entities": [
      "North America"
    ],
    "hop": 2,
    "qid": "WebQTrn-1722_d50834f94faf4fc329933bfc896be576",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0419kt . \n?c ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the current government of the place where \"The Alchemist of Happiness\" takes place?",
    "question_entity": "",
    "answer_entities": [
      "Presidential system"
    ],
    "hop": 2,
    "qid": "WebQTrn-1758_477d7040a0ed5bfecb155b8b3d3082fb",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0c2_wc . \n?c ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who is the daughter of the composer for the work \"dangerously in Love 2\"?",
    "question_entity": "",
    "answer_entities": [
      "Blue Ivy"
    ],
    "hop": 2,
    "qid": "WebQTrn-1770_6a7c160ace84e7908302f805739ad06d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.094t6x . \n?c ns:people.person.children ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the name of the daughter of the artist who had the \"The Mrs. Carter Show World Tour\"?",
    "question_entity": "",
    "answer_entities": [
      "Blue Ivy"
    ],
    "hop": 2,
    "qid": "WebQTrn-1770_76c2e83b07b9da336705f1d623faf5a4",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.artist.concert_tours ns:m.0qftnyr . \n?c ns:people.person.children ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What form of government is currently used in the place where the movie \"Vietnam, Long Time Coming\" takes place?",
    "question_entity": "",
    "answer_entities": [
      "Communist state"
    ],
    "hop": 2,
    "qid": "WebQTrn-1817_5e5820ae78bf808cd4682f952c2af9d7",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.03nr7mp . \n?c ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What form of government is used in the place where the film \"Defamation\" is set?",
    "question_entity": "",
    "answer_entities": [
      "Parliamentary system"
    ],
    "hop": 2,
    "qid": "WebQTrn-1938_ae0ef655e304be3e017fd9cd4955fd62",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.05sqd0p . \n?c ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the childhood home of the artist who recorded \"I'll Be\"?",
    "question_entity": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_7d2edee5ce98d6b13dfd25714bb3a6b8",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0249140 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the recording artist for \"Suit & Tie\" grow up?",
    "question_entity": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_8349bb144acf1f6bb43d68bfa35e97c1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0sgzv9r . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the author of the lyrics for \"Excuse Me Miss\" grow up?",
    "question_entity": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_babe81e436454a7d4877c4ae80975c85",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0d1yq4 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the \"Still D.R.E.\" lyricist raised?",
    "question_entity": "",
    "answer_entities": [
      "Brooklyn"
    ],
    "hop": 2,
    "qid": "WebQTrn-2023_c0b39ce6f793480f678ceccad425298e",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0b8wth . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the language spoken in Chile that was in \"Beloved\"?",
    "question_entity": "",
    "answer_entities": [
      "Spanish Language"
    ],
    "hop": 2,
    "qid": "WebQTrn-2069_c1d589c22e4bcb71dd3832d4a8a1dbe9",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.languages_spoken ?x .\n?x ns:book.book_subject.works ns:m.04nrl5 . \n}",
    "dataset": "cwq"
  },
  {
    "question": "Where was the person who recorded \"I'm Gonna Get Drunk and Play Hank Williams\" born?",
    "question_entity": "",
    "answer_entities": [
      "Glen Dale"
    ],
    "hop": 2,
    "qid": "WebQTrn-2215_2fa90adc92b5095b8e1fd27754180250",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0k1q72c . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the artist of \"Hot Rod Heart\" born and raised?",
    "question_entity": "",
    "answer_entities": [
      "Glen Dale"
    ],
    "hop": 2,
    "qid": "WebQTrn-2215_38e836442d3d4535942bf8f0cbbbe65a",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0v_yzky . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the birthplace and childhood home of the person who wrote the lyrics to \"Ticks\"?",
    "question_entity": "",
    "answer_entities": [
      "Glen Dale"
    ],
    "hop": 2,
    "qid": "WebQTrn-2215_b6e5a37f53b9952902db798f613a2978",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.02vy9j7 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the hometown of the subject of the movie \"George Washington's First War: The Battles for Fort Duquesne\"?",
    "question_entity": "",
    "answer_entities": [
      "Westmoreland County"
    ],
    "hop": 2,
    "qid": "WebQTrn-2218_05b93d057f56c7f623f0bed078a219b3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0crsj9s . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where is the birthplace of the subject of the film \"We Fight to be Free\"?",
    "question_entity": "",
    "answer_entities": [
      "Westmoreland County"
    ],
    "hop": 2,
    "qid": "WebQTrn-2218_7fde645929322023cada4f38c263bdcb",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0n_v7g3 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What fate did Adolf Hitler meet with at the end of WWII and is the subject of the film \"Shrink\"?",
    "question_entity": "",
    "answer_entities": [
      "Suicide"
    ],
    "hop": 2,
    "qid": "WebQTrn-2256_edb8b9f907200e4130e747f92364472d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:people.deceased_person.cause_of_death ?x .\n?x ns:film.film_subject.films ns:m.04jlsj4 . \n}",
    "dataset": "cwq"
  },
  {
    "question": "Who served as Vice President under the subject of the film \"Reagan\"?",
    "question_entity": "",
    "answer_entities": [
      "George H. W. Bush"
    ],
    "hop": 2,
    "qid": "WebQTrn-2258_a37f457dd3fdc936b7b86a218e415de7",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.0g8n81t . \n?c ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What politicains serves as Vice President under the Presidnet who quoted \"Government does not solve problems; it subsidizes them.\"?",
    "question_entity": "",
    "answer_entities": [
      "George H. W. Bush"
    ],
    "hop": 2,
    "qid": "WebQTrn-2258_c20dea9851e737a04505f91280ade736",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048g5vm . \n?c ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who were influences on the subject of \"Pollock's Work?\"?",
    "question_entity": "",
    "answer_entities": [
      "Pablo Picasso"
    ],
    "hop": 2,
    "qid": "WebQTrn-2316_47b067b98845fdb2ebaf2442f5ad1298",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.01716t . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What are the official languages of the setting of the movie \"Three Stories of Galicia\"?",
    "question_entity": "",
    "answer_entities": [
      "Moldovan language"
    ],
    "hop": 2,
    "qid": "WebQTrn-2319_90b940cb467238cc91ecfd5f2fd89fb1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0wq0vzw . \n?c ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the name of the head coach of the sports team whose fight song is \"Renegade\"?",
    "question_entity": "",
    "answer_entities": [
      "Mike Tomlin"
    ],
    "hop": 2,
    "qid": "WebQTrn-237_993bf41507919333b3a87058c5072363",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:sports.sports_team.fight_song ns:m.06c78r . \n?c ns:american_football.football_team.current_head_coach ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who is the current head coach of the team the uses the song title \"Fight Polka\"?",
    "question_entity": "",
    "answer_entities": [
      "Mike Tomlin"
    ],
    "hop": 2,
    "qid": "WebQTrn-237_f44adc4947a59c150317bb5923cf1c9b",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:sports.sports_team.fight_song ns:m.0j_8yp9 . \n?c ns:american_football.football_team.current_head_coach ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who composed the song \"Thinkin About-U!\"?",
    "question_entity": "",
    "answer_entities": [
      "Musician"
    ],
    "hop": 2,
    "qid": "WebQTrn-2428_7f8dba203353c3b7569b073ccb09dae6",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0zlc1qy . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the occupation of the lyracist for \"800?\"?",
    "question_entity": "",
    "answer_entities": [
      "Musician"
    ],
    "hop": 2,
    "qid": "WebQTrn-2428_e9c8e846947ab5ad35bd595466aa0bab",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0zhw02j . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Which Taylor Lautner movie has a sequel titled \"The Twilight Saga: Breaking Dawn - Part 1\"?",
    "question_entity": "",
    "answer_entities": [
      "Eclipse"
    ],
    "hop": 2,
    "qid": "WebQTrn-25_23b0132339644b875bf6a966c5b0c131",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ldhs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.sequel ns:m.075wx89 . \n}",
    "dataset": "cwq"
  },
  {
    "question": "What movie starring Taylor Lautner has a prequel named \"The Twilight Saga: New Moon\"?",
    "question_entity": "",
    "answer_entities": [
      "Eclipse"
    ],
    "hop": 2,
    "qid": "WebQTrn-25_9cff1917b216e0677c77d95668afba83",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ldhs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.prequel ns:m.05pdh86 . \n}",
    "dataset": "cwq"
  }
]