[
  {
    "question": "What movies does the subject of the image \"Empire9.jpg\" play in?",
    "question_entity": "",
    "answer_entities": [
      "The Twilight Saga: Breaking Dawn - Part 1"
    ],
    "hop": 2,
    "qid": "WebQTrn-25_a595672eac8b0f404df1cdec081c2e10",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.0b7bx_k . \n?c ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What instruments are played by the composer of \"Colonial Mentality\"?",
    "question_entity": "",
    "answer_entities": [
      "Drums"
    ],
    "hop": 2,
    "qid": "WebQTrn-2615_02ff1000554288163476ec3bce4c7c2d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.composer.compositions ns:m.0qfj60w . \n?c ns:music.group_member.instruments_played ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What instruments are played by the artist who recorded \"Dr. Solutsu?\"?",
    "question_entity": "",
    "answer_entities": [
      "Drums"
    ],
    "hop": 2,
    "qid": "WebQTrn-2615_c121d04c73dd169c7c32719d24f768f4",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0fsq284 . \n?c ns:music.group_member.instruments_played ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where is the topic of the image \"Whistler Skilift 040\" found?",
    "question_entity": "",
    "answer_entities": [
      "Coast Mountains"
    ],
    "hop": 2,
    "qid": "WebQTrn-261_7bc18657d5150879fc643779b6ad5e48",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.03ttk28 . \n?c ns:location.location.containedby ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where is Whistler Mountain located that was featured in the work \"Blood Brother\"?",
    "question_entity": "",
    "answer_entities": [
      "North America"
    ],
    "hop": 2,
    "qid": "WebQTrn-261_c360906c6dbb01444144ff6ff216a168",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pg6z3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pg6z3 ns:location.location.containedby ?x .\n?x ns:book.book_subject.works ns:m.02vpg42 . \n}",
    "dataset": "cwq"
  },
  {
    "question": "What is the place of death for the subject of the movie \"The Miracle Worker?\"?",
    "question_entity": "",
    "answer_entities": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_73c5cf3f70ecb7e35617a190ddff860b",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.02r7rth . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the person that stated, \"College isn't the place to go for ideas.\", die at?",
    "question_entity": "",
    "answer_entities": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_8fe5ec39e992465249b6b75c971057ed",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048f8ng . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the author who published \"The Story of My Life\" die?",
    "question_entity": "",
    "answer_entities": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_aa25cef57eebcc069b1783e80e760069",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04tsr84 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where did the subject of the film \"Black\" pass away?",
    "question_entity": "",
    "answer_entities": [
      "Easton"
    ],
    "hop": 2,
    "qid": "WebQTrn-2641_c344028c2ef7fb59dec539cb908d3214",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.05xdl0 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What languages are spoken where \"Shutter\" takes place?",
    "question_entity": "",
    "answer_entities": [
      "Akha Language"
    ],
    "hop": 2,
    "qid": "WebQTrn-2748_510ee63721c43d65b08c99d91f4f4efc",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0cs4yp . \n?c ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In what films does the lyracist for \"Panther Power\" appear?",
    "question_entity": "",
    "answer_entities": [
      "Bullet"
    ],
    "hop": 2,
    "qid": "WebQTrn-2784_025fdfafd914ff922ab8144f527c06ec",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.012nbkn9 . \n?c ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What movie features Tupac and the song \"Again\"?",
    "question_entity": "",
    "answer_entities": [
      "Poetic Justice"
    ],
    "hop": 2,
    "qid": "WebQTrn-2784_7a9abab7f2f16a7f9ea4b2088e7cdd96",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.featured_song ns:m.05n9pf . \n}",
    "dataset": "cwq"
  },
  {
    "question": "Where did the author of \"The Catcher in the Rye\" die?",
    "question_entity": "",
    "answer_entities": [
      "Cornish"
    ],
    "hop": 2,
    "qid": "WebQTrn-2809_9a675f10a70c0e698f094116c3f82a7d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04v7d26 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the person raised who recorded \"Happy Birthday, Mr. President\"?",
    "question_entity": "",
    "answer_entities": [
      "Brookline"
    ],
    "hop": 2,
    "qid": "WebQTrn-2815_3a40921ae6042ff93cc654f727b80209",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0_jd323 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the author of \"Profiles in Courage\" raised?",
    "question_entity": "",
    "answer_entities": [
      "Brookline"
    ],
    "hop": 2,
    "qid": "WebQTrn-2815_4d2f11c63fa0611b0e29bc00f41bf7a9",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04v21dt . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the subject of the movie \"An American Affair\" raised?",
    "question_entity": "",
    "answer_entities": [
      "Brookline"
    ],
    "hop": 2,
    "qid": "WebQTrn-2815_56e8d2e51ce1a46013d0176a58f8d5b3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_subject.films ns:m.05h4nz9 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What did the person who said \"God's first creature, which was light\" do?",
    "question_entity": "",
    "answer_entities": [
      "Scientist"
    ],
    "hop": 2,
    "qid": "WebQTrn-2859_1d0f95cbca773971acb85244d72bed62",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048h1y5 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What jobs were done by the author who wrote \"The New Atlantis\"?",
    "question_entity": "",
    "answer_entities": [
      "Scientist"
    ],
    "hop": 2,
    "qid": "WebQTrn-2859_37bf80e89387cf09fca66eb7915a52b0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04v1lg6 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What was the profession of the person who said \"Mysteries are due to secrecy.\"?",
    "question_entity": "",
    "answer_entities": [
      "Scientist"
    ],
    "hop": 2,
    "qid": "WebQTrn-2859_aa42f50ae2e11ff4be5d8dbb6c65e099",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048c4m_ . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where was the movie \"Shoot 'Em Up\" filmed?",
    "question_entity": "",
    "answer_entities": [
      "Ontario"
    ],
    "hop": 2,
    "qid": "WebQTrn-3033_9bff9b3325534dae4908b820d4364101",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0dz9by . \n?c ns:base.biblioness.bibs_location.state ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the setting of the film \"Saw V?\"?",
    "question_entity": "",
    "answer_entities": [
      "Ontario"
    ],
    "hop": 2,
    "qid": "WebQTrn-3033_e519712761951b558bb7cbf4ea39198a",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.03d243x . \n?c ns:base.biblioness.bibs_location.state ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where is the childhood home of the person who said \"Who is rich? He that rejoices in his portion.\"?",
    "question_entity": "",
    "answer_entities": [
      "Boston"
    ],
    "hop": 2,
    "qid": "WebQTrn-3038_15cace8f716a3aed245757a5874e1bb0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048k067 . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In what city did the person that said  \"Eat to please thyself, but dress to please others.\" grow up?",
    "question_entity": "",
    "answer_entities": [
      "Boston"
    ],
    "hop": 2,
    "qid": "WebQTrn-3038_530c9b007d2e31175fa177ade7ae14ab",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048gglz . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Whereabouts was the writer of \"Poor Richard's Almanac of 1735\" brought up?",
    "question_entity": "",
    "answer_entities": [
      "Boston"
    ],
    "hop": 2,
    "qid": "WebQTrn-3038_75053cb108f036148b2e5631983f76a3",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.040v_ty . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who was the literary role model for the \"Not Without Laughter (Thrift Edition)\" piece poet?",
    "question_entity": "",
    "answer_entities": [
      "Walt Whitman"
    ],
    "hop": 2,
    "qid": "WebQTrn-303_2ee96aa7464485d80d214b61773f4a5c",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04v86lt . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who inspired the person who wrote the lyrics for \"Street Scene: Act I. No. 6b Quartet\" to write poetry?",
    "question_entity": "",
    "answer_entities": [
      "Walt Whitman"
    ],
    "hop": 2,
    "qid": "WebQTrn-303_770773a5150d1cdd3cfadfc25022720b",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0_74_pw . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What location GA is famous for is the where the film \"Tales of the Tinkerdee\" takes place?",
    "question_entity": "",
    "answer_entities": [
      "1996 Summer Olympics"
    ],
    "hop": 2,
    "qid": "WebQTrn-3049_346f676ddb1fead2bb97bbbade933dc8",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0hgy7x3 . \n?c ns:olympics.olympic_host_city.olympics_hosted ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the name of the location, where the film, \"The Loved Ones\" occur?",
    "question_entity": "",
    "answer_entities": [
      "William Lamb, 2nd Viscount Melbourne"
    ],
    "hop": 2,
    "qid": "WebQTrn-3379_1555b448547cae902ba0ac654a097948",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.07l4_nv . \n?c ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "The name of the place where the location of the film \"House of Wax\" comes from where?",
    "question_entity": "",
    "answer_entities": [
      "William Lamb, 2nd Viscount Melbourne"
    ],
    "hop": 2,
    "qid": "WebQTrn-3379_52c6811b1a36b4eb2a9661b0b4de6bb1",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.060v34 . \n?c ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Where is the artist who recorded \"Out of Your Mind\" from?",
    "question_entity": "",
    "answer_entities": [
      "Harlow"
    ],
    "hop": 2,
    "qid": "WebQTrn-3412_305f49b65a760af0e6ce8d06f43aa22a",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.featured_artist.recordings ns:m.0nrtqq . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Which language spoken by the ancient Romans is used on the album \"Tanto Tempo?\"?",
    "question_entity": "",
    "answer_entities": [
      "Latin Language"
    ],
    "hop": 2,
    "qid": "WebQTrn-3527_1661062ba428b2ec2a00e2f84257682f",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:fictional_universe.fictional_setting.languages ?x .\n?x ns:music.genre.albums ns:m.01hk14_ . \n}",
    "dataset": "cwq"
  },
  {
    "question": "What does the religion who has a deity \"The Father\" call their God?",
    "question_entity": "",
    "answer_entities": [
      "The Father"
    ],
    "hop": 2,
    "qid": "WebQTrn-372_301c8094ece19fea6abf81373a2cb78d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:religion.religion.deities ns:m.077_fbm . \n?c ns:religion.religion.deities ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What do Catholics call their God and has said \" It is written again, Thou shalt not tempt the Lord thy God\"?",
    "question_entity": "",
    "answer_entities": [
      "Jesus Christ"
    ],
    "hop": 2,
    "qid": "WebQTrn-372_941e1abcd5c7b97906d8e2bf25fbdbaf",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.deities ?x .\n?x ns:people.person.quotations ns:m.094t_hr . \n}",
    "dataset": "cwq"
  },
  {
    "question": "What language is spoken by the people who live in the place that is the setting for the film \"Holland Carries On?\"?",
    "question_entity": "",
    "answer_entities": [
      "Frisian languages"
    ],
    "hop": 2,
    "qid": "WebQTrn-412_d4b48fc9d595027f8aab59483caf63d8",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.010qtfnb . \n?c ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In what country was the film adaptation \"The Diary of Anne Frank\" filmed?",
    "question_entity": "",
    "answer_entities": [
      "Netherlands"
    ],
    "hop": 2,
    "qid": "WebQTrn-497_4e83d1f69f849b6bcccd4c022820d371",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.01k7b0 . \n?c ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In which country is the location, where the film, \"Interview\" occurs?",
    "question_entity": "",
    "answer_entities": [
      "Netherlands"
    ],
    "hop": 2,
    "qid": "WebQTrn-497_5e9fcaa36ee91d7f8bbea0df75c2da02",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.film_location.featured_in_films ns:m.0fvbd5 . \n?c ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In what country would you find the topic of the image \"Wapen_van_Amsterdam_bewerkt.PNG\"?",
    "question_entity": "",
    "answer_entities": [
      "Netherlands"
    ],
    "hop": 2,
    "qid": "WebQTrn-497_a1739c3fe23ae1c5f93a421061ef5a1d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.03bvwt1 . \n?c ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "In what nation would you find the topic of the image \"The Montelbaanstoren (1512) on the Oude Schans\"?",
    "question_entity": "",
    "answer_entities": [
      "Netherlands"
    ],
    "hop": 2,
    "qid": "WebQTrn-497_a36d1c20b53f39947d462b263c6e1203",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.03tmx8l . \n?c ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What movie did Ron Howard do that was part of the \"American Graffiti\" series?",
    "question_entity": "",
    "answer_entities": [
      "More American Graffiti"
    ],
    "hop": 2,
    "qid": "WebQTrn-567_17f1e54ab0ff1c9fce2f5aefa7a5b1c7",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.film_series ns:m.0w_sgwg . \n}",
    "dataset": "cwq"
  },
  {
    "question": "Whic film directed by Ron Howard includes the song \"All Love Can Be?\"?",
    "question_entity": "",
    "answer_entities": [
      "A Beautiful Mind"
    ],
    "hop": 2,
    "qid": "WebQTrn-567_bfcde480dde9e03c320b2d2cc1d67743",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.featured_song ns:m.0mb_kj . \n}",
    "dataset": "cwq"
  },
  {
    "question": "What are the names of the children of the publishing author of \"Snow White and the Seven Dwarves\"?",
    "question_entity": "",
    "answer_entities": [
      "Sharon Mae Disney"
    ],
    "hop": 2,
    "qid": "WebQTrn-62_ea58dc4e50cbfaac0c9c86eba471062d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04vv23t . \n?c ns:people.person.children ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What work did the person do who said, \"Forgiveness is God's command\"?",
    "question_entity": "",
    "answer_entities": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_290076b4968a6b1f5f7b5425d3a5e9f0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048g5hc . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What did the person who wrote \"Vater unser im Himmelreich\" do?",
    "question_entity": "",
    "answer_entities": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_343695bdd9b0b5e1e34112bcaffacde0",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0_k8qx0 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What is the person that stated \"The devil is God's ape!\", occupation?",
    "question_entity": "",
    "answer_entities": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_ab26b7d4883184a9fa73a088819de4c9",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048g2gr . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What was the profession on the songwrite who wrote \"Aus tiefer Not schrei ich zu dir\"?",
    "question_entity": "",
    "answer_entities": [
      "Professor"
    ],
    "hop": 2,
    "qid": "WebQTrn-634_d33dcb8918f3336a4ee93cfc8bcc332d",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.010ylg25 . \n?c ns:people.person.profession ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What city did the primary focus of the image \"John Muir Cane\" die in?",
    "question_entity": "",
    "answer_entities": [
      "Los Angeles"
    ],
    "hop": 2,
    "qid": "WebQTrn-706_6032efd4798dd7c25582a0bc6cc5b4ea",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.02c6jj0 . \n?c ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What's the topic of the picture \"Flag of Calabria Italy\"?",
    "question_entity": "",
    "answer_entities": [
      "Italian region"
    ],
    "hop": 2,
    "qid": "WebQTrn-724_d133cd1308f3fd8e12b6e2eb7acbc859",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.04r6z74 . \n?c ns:common.topic.notable_types ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What language, spoken by Jewish people, has the initials \"es\"?",
    "question_entity": "",
    "answer_entities": [
      "Spanish Language"
    ],
    "hop": 2,
    "qid": "WebQTrn-783_1457d90ab0f2e38e307aac386e176bbd",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041rx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041rx ns:people.ethnicity.languages_spoken ?x .\n?x ns:language.human_language.iso_639_1_code \"es\" . \n}",
    "dataset": "cwq"
  },
  {
    "question": "Where was the writer of the lyrics \"Unwanted\" born?",
    "question_entity": "",
    "answer_entities": [
      "Belleville"
    ],
    "hop": 2,
    "qid": "WebQTrn-846_e852443b88aebb56535c3fb8390109ca",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:music.lyricist.lyrics_written ns:m.0wfw_hx . \n?c ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who was the Vice President for the author of the \"State of the Union Address of William J. Clinton\"?",
    "question_entity": "",
    "answer_entities": [
      "Al Gore"
    ],
    "hop": 2,
    "qid": "WebQTrn-857_11ec6edb4a5549d8a8ce1f2117fe3368",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:book.author.book_editions_published ns:m.04vs2vl . \n?c ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who was vice president when the actor who played in the movie \"Bill Clinton\" His Life\" was in office?",
    "question_entity": "",
    "answer_entities": [
      "Al Gore"
    ],
    "hop": 2,
    "qid": "WebQTrn-857_d585a4c2e04a9cd40dd5ec98e2456515",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:film.actor.film ?k .\n?k ns:film.performance.film ns:m.0cs716d . \n?c ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What school was attended by the person who was the focal point of the image \"Sergio romo 2010\"?",
    "question_entity": "",
    "answer_entities": [
      "University of North Alabama"
    ],
    "hop": 2,
    "qid": "WebQTrn-886_36e0f3794f873b19127b97c24fcb3743",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:common.topic.image ns:m.0dg0npx . \n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "Who was the inspiration for the person that said \"There are no second acts in American lives\"?",
    "question_entity": "",
    "answer_entities": [
      "T. S. Eliot"
    ],
    "hop": 2,
    "qid": "WebQTrn-894_b751ce0f39b884d02f214d615fe3cb57",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048d7sw . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq"
  },
  {
    "question": "What inspiration of F. Scott Fitzgerald said, \"Business today consists in persuading crowds\"?",
    "question_entity": "",
    "answer_entities": [
      "T. S. Eliot"
    ],
    "hop": 2,
    "qid": "WebQTrn-894_d4bc649d0d9285fcf788058ec07823ef",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zjd ns:influence.influence_node.influenced_by ?x .\n?x ns:people.person.quotations ns:m.02kpjnv . \n}",
    "dataset": "cwq"
  },
  {
    "question": "Who inspired the person who said, \"Her voice is full of money\"?",
    "question_entity": "",
    "answer_entities": [
      "T. S. Eliot"
    ],
    "hop": 2,
    "qid": "WebQTrn-894_e8816f41e30cc619312fa050ff173448",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ?c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\n?c ns:people.person.quotations ns:m.048jrqw . \n?c ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "cwq"
  }
]