[
  {
    "question": "what did baron de montesquie influence",
    "question_entity": "m.0f9wd",
    "question_entity_name": "Montesquieu",
    "answer_entities": [
      "m.014nx0",
      "m.015v8f",
      "m.01g95k",
      "m.026lj",
      "m.029b4z",
      "m.02qr0",
      "m.02ssn",
      "m.03_js",
      "m.032r1",
      "m.039n1",
      "m.0420y",
      "m.0424m",
      "m.056xnr",
      "m.05k9m6",
      "m.07cbs",
      "m.07kwl",
      "m.09j84",
      "m.0cgwf",
      "m.0k665",
      "m.0nk72",
      "m.0tfc"
    ],
    "answer_entity_names": [
      "Isaiah Berlin",
      "Alexis de Tocqueville",
      "William Blackstone",
      "David Hume",
      "Clive James",
      "Edmund Burke",
      "Edward Gibbon",
      "John Adams",
      "Friedrich Hayek",
      "Georg Wilhelm Friedrich Hegel",
      "Jean-Jacques Rousseau",
      "James Madison",
      "Roberto Mangabeira Unger",
      "Paul Féval, père",
      "Thomas Jefferson",
      "Thomas Paine",
      "Émile Durkheim",
      "Jeremy Bentham",
      "Louis Althusser",
      "Hannah Arendt",
      "Adam Smith"
    ],
    "hop": 1,
    "qid": "WebQTest-347",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9wd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9wd ns:influence.influence_node.influenced ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced"
    ]
  },
  {
    "question": "who is jimmy savile",
    "question_entity": "m.01wg0w",
    "question_entity_name": "Jimmy Savile",
    "answer_entities": [
      "m.015cjr",
      "m.02dsz",
      "m.08z956"
    ],
    "answer_entity_names": [
      "Presenter",
      "Disc jockey",
      "Radio personality"
    ],
    "hop": 1,
    "qid": "WebQTest-226",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wg0w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wg0w ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who was frida kahlo influenced by",
    "question_entity": "m.015k04",
    "question_entity_name": "Frida Kahlo",
    "answer_entities": [
      "m.0q2c2"
    ],
    "answer_entity_names": [
      "Diego Rivera"
    ],
    "hop": 1,
    "qid": "WebQTest-829",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015k04)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015k04 ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "who is michael buble",
    "question_entity": "m.02xkkq",
    "question_entity_name": "Michael Bublé",
    "answer_entities": [
      "m.02hrh1q",
      "m.09l65",
      "m.0nbcg"
    ],
    "answer_entity_names": [
      "Actor",
      "Singer",
      "Songwriter"
    ],
    "hop": 1,
    "qid": "WebQTest-55",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xkkq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xkkq ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where was marilyn monroe found dead",
    "question_entity": "m.04wqr",
    "question_entity_name": "Marilyn Monroe",
    "answer_entities": [
      "m.01yq4f"
    ],
    "answer_entity_names": [
      "Brentwood"
    ],
    "hop": 1,
    "qid": "WebQTest-724",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wqr ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where is the home stadium of the new england patriots",
    "question_entity": "m.05g3b",
    "question_entity_name": "New England Patriots",
    "answer_entities": [
      "m.0299m7"
    ],
    "answer_entity_names": [
      "Gillette Stadium"
    ],
    "hop": 1,
    "qid": "WebQTest-1506",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3b ns:sports.sports_team.arena_stadium ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.arena_stadium"
    ]
  },
  {
    "question": "where is chris paul from",
    "question_entity": "m.0cymln",
    "question_entity_name": "Chris Paul",
    "answer_entities": [
      "m.09c7w0"
    ],
    "answer_entity_names": [
      "United States of America"
    ],
    "hop": 1,
    "qid": "WebQTest-1231",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cymln)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cymln ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "what timezone is the state of michigan and",
    "question_entity": "m.04rrx",
    "question_entity_name": "Michigan",
    "answer_entities": [
      "m.02_37z",
      "m.02fqwt",
      "m.02hcv8"
    ],
    "answer_entity_names": [
      "UTC−05:00",
      "Central Time Zone",
      "Eastern Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-636",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rrx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rrx ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what kind of guitar did jerry garcia play",
    "question_entity": "m.0k1bs",
    "question_entity_name": "Jerry Garcia",
    "answer_entities": [
      "m.01jyd4",
      "m.02j9dp",
      "m.02m873"
    ],
    "answer_entity_names": [
      "Gibson SG",
      "Gibson Les Paul",
      "Fender Stratocaster"
    ],
    "hop": 1,
    "qid": "WebQTest-1809",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k1bs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k1bs ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.guitarist.guitars_played"
    ]
  },
  {
    "question": "where did benjamin franklin work",
    "question_entity": "m.019fz",
    "question_entity_name": "Benjamin Franklin",
    "answer_entities": [
      "m.040vjzl",
      "m.0dcms",
      "m.0dw1k2"
    ],
    "answer_entity_names": [
      "James Franklin Printing Shop",
      "United States Postal Service",
      "Josiah Franklin"
    ],
    "hop": 2,
    "qid": "WebQTest-986",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.employment_history",
      "business.employment_tenure.company"
    ]
  },
  {
    "question": "what is the currency of brazil now",
    "question_entity": "m.015fr",
    "question_entity_name": "Brazil",
    "answer_entities": [
      "m.03385m"
    ],
    "answer_entity_names": [
      "Brazilian real"
    ],
    "hop": 1,
    "qid": "WebQTest-855",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015fr ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what is ella fitzgerald parents name",
    "question_entity": "m.0d9xq",
    "question_entity_name": "Ella Fitzgerald",
    "answer_entities": [
      "m.0kcwjlp",
      "m.0kcwjlw"
    ],
    "answer_entity_names": [
      "Temperance Fitzgerald",
      "William Fitzgerald"
    ],
    "hop": 1,
    "qid": "WebQTest-941",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d9xq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d9xq ns:people.person.parents ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "where is the nra headquarters located",
    "question_entity": "m.0j6f9",
    "question_entity_name": "National Rifle Association",
    "answer_entities": [
      "m.0mnzd"
    ],
    "answer_entity_names": [
      "Fairfax"
    ],
    "hop": 2,
    "qid": "WebQTest-139",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j6f9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j6f9 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what is lawton ok zip code",
    "question_entity": "m.0z53k",
    "question_entity_name": "Lawton",
    "answer_entities": [
      "m.020qj4c",
      "m.020qj5_",
      "m.020qj55",
      "m.07nqg4t",
      "m.07nqg50"
    ],
    "answer_entity_names": [
      "73505",
      "73507",
      "73501",
      "73506",
      "73502"
    ],
    "hop": 1,
    "qid": "WebQTest-1115",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0z53k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0z53k ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what russian language called",
    "question_entity": "m.06bnz",
    "question_entity_name": "Russia",
    "answer_entities": [
      "m.06b_j"
    ],
    "answer_entity_names": [
      "Russian Language"
    ],
    "hop": 1,
    "qid": "WebQTest-589",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what countries are part of the baltic",
    "question_entity": "m.019tjm",
    "question_entity_name": "Baltic states",
    "answer_entities": [
      "m.02kmm",
      "m.04g5k",
      "m.04gzd"
    ],
    "answer_entity_names": [
      "Estonia",
      "Latvia",
      "Lithuania"
    ],
    "hop": 1,
    "qid": "WebQTest-173",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019tjm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019tjm ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.contains"
    ]
  },
  {
    "question": "what kind of painter was wassily kandinsky",
    "question_entity": "m.0856z",
    "question_entity_name": "Wassily Kandinsky",
    "answer_entities": [
      "m.015r61",
      "m.0197s6",
      "m.02xk0r",
      "m.04191d",
      "m.0pybl"
    ],
    "answer_entity_names": [
      "Modern art",
      "Abstract art",
      "Der Blaue Reiter",
      "German Expressionism",
      "Expressionism"
    ],
    "hop": 1,
    "qid": "WebQTest-1877",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0856z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0856z ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "where did the crimean war take place",
    "question_entity": "m.0cmc2",
    "question_entity_name": "Crimean War",
    "answer_entities": [
      "m.01522",
      "m.015h7",
      "m.01jjk",
      "m.09shn",
      "m.0cr7m",
      "m.0k_hb",
      "m.0ndwhc3"
    ],
    "answer_entity_names": [
      "Baltic Sea",
      "Black Sea",
      "Balkans",
      "Caucasus",
      "Autonomous Republic of Crimea",
      "White Sea",
      "Crimea"
    ],
    "hop": 1,
    "qid": "WebQTest-1921",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmc2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmc2 ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "who influenced picasso art",
    "question_entity": "m.060_7",
    "question_entity_name": "Pablo Picasso",
    "answer_entities": [
      "m.016s03",
      "m.02mbk",
      "m.02rdf6",
      "m.02y23",
      "m.03p_bz",
      "m.063mx",
      "m.07_m2",
      "m.0cwk2",
      "m.0h7vt",
      "m.0h82x",
      "m.0k92y",
      "m.0tth"
    ],
    "answer_entity_names": [
      "Eugène Delacroix",
      "Édouard Manet",
      "Henri Rousseau",
      "Francisco Goya",
      "Sara Murphy",
      "Paul Cézanne",
      "Vincent van Gogh",
      "Jean-Auguste-Dominique Ingres",
      "Henri de Toulouse-Lautrec",
      "Paul Gauguin",
      "Diego Velázquez",
      "Alfred Jarry"
    ],
    "hop": 1,
    "qid": "WebQTest-1573",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060_7 ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "what was hitler the leader of",
    "question_entity": "m.07_m9_",
    "question_entity_name": "Adolf Hitler",
    "answer_entities": [
      "m.01c73n",
      "m.03cqs",
      "m.03w7xf",
      "m.05g9h",
      "m.06qmk",
      "m.082mc",
      "m.082x5",
      "m.0f6ck"
    ],
    "answer_entity_names": [
      "Hitler Youth",
      "Gestapo",
      "1st SS Panzer Division Leibstandarte SS Adolf Hitler",
      "Nazi Party",
      "Schutzstaffel",
      "Waffen-SS",
      "Wehrmacht",
      "Sturmabteilung"
    ],
    "hop": 1,
    "qid": "WebQTest-1304",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:organization.organization_founder.organizations_founded ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization_founder.organizations_founded"
    ]
  },
  {
    "question": "what did michael crabtree do",
    "question_entity": "m.03ccsym",
    "question_entity_name": "Michael Crabtree",
    "answer_entities": [
      "m.02g_6x"
    ],
    "answer_entity_names": [
      "Wide receiver"
    ],
    "hop": 1,
    "qid": "WebQTest-1757",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ccsym)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ccsym ns:american_football.football_player.position_s ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "american_football.football_player.position_s"
    ]
  },
  {
    "question": "where did diego velazquez die",
    "question_entity": "m.0k92y",
    "question_entity_name": "Diego Velázquez",
    "answer_entities": [
      "m.056_y"
    ],
    "answer_entity_names": [
      "Madrid"
    ],
    "hop": 1,
    "qid": "WebQTest-1944",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k92y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k92y ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where does the city of paris get its name",
    "question_entity": "m.05qtj",
    "question_entity_name": "Paris",
    "answer_entities": [
      "m.0283_dl"
    ],
    "answer_entity_names": [
      "Parisii"
    ],
    "hop": 1,
    "qid": "WebQTest-1496",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qtj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qtj ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "symbols.namesake.named_after"
    ]
  },
  {
    "question": "what kind of guitar john mayer",
    "question_entity": "m.01s21dg",
    "question_entity_name": "John Mayer",
    "answer_entities": [
      "m.02m873"
    ],
    "answer_entity_names": [
      "Fender Stratocaster"
    ],
    "hop": 1,
    "qid": "WebQTest-1566",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s21dg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s21dg ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.guitarist.guitars_played"
    ]
  },
  {
    "question": "where are the nato headquarters located",
    "question_entity": "m.059dn",
    "question_entity_name": "North Atlantic Treaty Organization (NATO)",
    "answer_entities": [
      "m.0177z"
    ],
    "answer_entity_names": [
      "Brussels"
    ],
    "hop": 2,
    "qid": "WebQTest-2023",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059dn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059dn ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "where is perpignan located",
    "question_entity": "m.09nkq",
    "question_entity_name": "Perpignan",
    "answer_entities": [
      "m.01087l",
      "m.0f8l9c",
      "m.0lwkz"
    ],
    "answer_entity_names": [
      "Pyrénées-Orientales",
      "France",
      "Languedoc-Roussillon"
    ],
    "hop": 1,
    "qid": "WebQTest-420",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09nkq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09nkq ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what language do they speak in malta",
    "question_entity": "m.04v3q",
    "question_entity_name": "Malta",
    "answer_entities": [
      "m.02h40lc"
    ],
    "answer_entity_names": [
      "English Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1613",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v3q ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what is president nixon 's first name",
    "question_entity": "m.06c97",
    "question_entity_name": "Richard Nixon",
    "answer_entities": [
      "Richard Nixon"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1731",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c97)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c97 ns:type.object.name ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "type.object.name"
    ]
  },
  {
    "question": "where is ancient phoenician",
    "question_entity": "m.0617q",
    "question_entity_name": "Phoenicia",
    "answer_entities": [
      "m.04hqz"
    ],
    "answer_entity_names": [
      "Lebanon"
    ],
    "hop": 1,
    "qid": "WebQTest-869",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0617q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0617q ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what all movies has taylor lautner been in",
    "question_entity": "m.07ldhs",
    "question_entity_name": "Taylor Lautner",
    "answer_entities": [
      "m.011q0_7k",
      "m.012z_7zt",
      "m.02686wj",
      "m.03nm_fh",
      "m.05pdh86",
      "m.06_wqk4",
      "m.066b_n",
      "m.06crgb",
      "m.06zs80t",
      "m.075wx7_",
      "m.075wx89",
      "m.07cdy_t",
      "m.0bdwfqj",
      "m.0cmdl80",
      "m.0djz0rc",
      "m.0g_w5hs",
      "m.0gx8qcw",
      "m.0mzt5cs",
      "m.0ngj__s"
    ],
    "answer_entity_names": [
      "Run the Tide",
      "The Ridiculous Six",
      "He's a Bully, Charlie Brown",
      "Twilight",
      "The Twilight Saga: New Moon",
      "Valentine's Day",
      "Cheaper by the Dozen 2",
      "The Adventures of Sharkboy and Lavagirl",
      "Shadow Fury",
      "Eclipse",
      "The Twilight Saga: Breaking Dawn - Part 1",
      "The Nick and Jessica Variety Hour",
      "Northern Lights",
      "Abduction",
      "The Twilight Saga: Breaking Dawn - Part 2",
      "Field of Dreams 2: Lockout",
      "Incarceron",
      "Grown Ups 2",
      "Tracers"
    ],
    "hop": 2,
    "qid": "WebQTest-1583",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ldhs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what county is st paul va in",
    "question_entity": "m.013nm2",
    "question_entity_name": "St. Paul",
    "answer_entities": [
      "m.0mmy6",
      "m.0mn3x"
    ],
    "answer_entity_names": [
      "Wise County",
      "Russell County"
    ],
    "hop": 1,
    "qid": "WebQTest-279",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013nm2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013nm2 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpym_ .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where was the ottoman empire based",
    "question_entity": "m.05kyr",
    "question_entity_name": "Ottoman Empire",
    "answer_entities": [
      "m.01ffbn"
    ],
    "answer_entity_names": [
      "Near East"
    ],
    "hop": 1,
    "qid": "WebQTest-818",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05kyr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05kyr ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where obama went to school",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.014zws",
      "m.01w5m",
      "m.0265r_n",
      "m.0280qps",
      "m.02d9nr",
      "m.05q2c",
      "m.0nbyhz3"
    ],
    "answer_entity_names": [
      "Harvard Law School",
      "Columbia University",
      "Noelani Elementary School",
      "State Elementary School Menteng 01",
      "Punahou School",
      "Occidental College",
      "St. Francis of Assisi Catholic School"
    ],
    "hop": 2,
    "qid": "WebQTest-255",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what continent is cayman islands located",
    "question_entity": "m.01nty",
    "question_entity_name": "Cayman Islands",
    "answer_entities": [
      "m.059g4",
      "m.07c5l"
    ],
    "answer_entity_names": [
      "North America",
      "Americas"
    ],
    "hop": 1,
    "qid": "WebQTest-1519",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01nty)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01nty ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what timezone is nashville tn",
    "question_entity": "m.05jbn",
    "question_entity_name": "Nashville",
    "answer_entities": [
      "m.02fqwt"
    ],
    "answer_entity_names": [
      "Central Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-519",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jbn ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what to do with kids in essex",
    "question_entity": "m.02ly_",
    "question_entity_name": "Essex",
    "answer_entities": [
      "m.04g1431",
      "m.05zjnd",
      "m.0ff9kn",
      "m.0fyfyd",
      "m.0k5wwrf",
      "m.0k6f1n4",
      "m.0k6f1nc",
      "m.0k6f1nr",
      "m.0k6f1p1",
      "m.0v3bszv"
    ],
    "answer_entity_names": [
      "Beth Chatto Gardens",
      "Colchester Zoo",
      "Waltham Abbey Royal Gunpowder Mills",
      "RHS Garden, Hyde Hall",
      "Marsh Farm Country Park",
      "Thorndon Country Park",
      "Cudmore Grove Country Park",
      "Green Island Gardens",
      "Mistley Place Park",
      "Stansted Mountfitchet Castle"
    ],
    "hop": 1,
    "qid": "WebQTest-1055",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ly_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ly_ ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what are bigos",
    "question_entity": "m.06815z",
    "question_entity_name": "Bigos",
    "answer_entities": [
      "m.0jnxw"
    ],
    "answer_entity_names": [
      "Stew"
    ],
    "hop": 1,
    "qid": "WebQTest-1654",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06815z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06815z ns:food.dish.type_of_dish1 ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "food.dish.type_of_dish1"
    ]
  },
  {
    "question": "when does the vietnam war end",
    "question_entity": "m.07_nf",
    "question_entity_name": "Vietnam War",
    "answer_entities": [
      "1975-04-30"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1332",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_nf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_nf ns:time.event.end_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.end_date"
    ]
  },
  {
    "question": "who plays marshall eriksen",
    "question_entity": "m.02vkmj9",
    "question_entity_name": "Marshall Eriksen",
    "answer_entities": [],
    "answer_entity_names": [],
    "hop": 2,
    "qid": "WebQTest-863",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vkmj9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vkmj9 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_character.appeared_in_tv_program",
      "tv.regular_tv_appearance.actor"
    ]
  },
  {
    "question": "what are john terry 's children called",
    "question_entity": "m.029f79",
    "question_entity_name": "John Terry",
    "answer_entities": [
      "m.0j51lwj",
      "m.0j51lwr"
    ],
    "answer_entity_names": [
      "Summer Rose Terry",
      "Georgie John Terry"
    ],
    "hop": 1,
    "qid": "WebQTest-1795",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.029f79)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.029f79 ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what system of government does guyana have",
    "question_entity": "m.034m8",
    "question_entity_name": "Guyana",
    "answer_entities": [
      "m.01dw03",
      "m.01fpfn",
      "m.06cx9"
    ],
    "answer_entity_names": [
      "Semi-presidential system",
      "Unitary state",
      "Republic"
    ],
    "hop": 1,
    "qid": "WebQTest-678",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034m8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034m8 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "when are the summer and winter olympics held",
    "question_entity": "m.05nd_",
    "question_entity_name": "Olympic Games",
    "answer_entities": [
      "m.04q0_4f"
    ],
    "answer_entity_names": [
      "Quadrennial"
    ],
    "hop": 1,
    "qid": "WebQTest-1276",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05nd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05nd_ ns:time.recurring_event.current_frequency ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.recurring_event.current_frequency"
    ]
  }
]