[
  {
    "question": "what music period did beethoven live in",
    "question_entity": "m.04k15",
    "question_entity_name": "Ludwig van Beethoven",
    "answer_entities": [
      "m.05lls",
      "m.0ggq0m"
    ],
    "answer_entity_names": [
      "Opera",
      "Classical music"
    ],
    "hop": 1,
    "qid": "WebQTest-446",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04k15)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04k15 ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what sports do people play in poland",
    "question_entity": "m.05qhw",
    "question_entity_name": "Poland",
    "answer_entities": [
      "m.025wfz7",
      "m.026prdm",
      "m.026xnhs",
      "m.02r6q5w",
      "m.037p7l",
      "m.037p8c",
      "m.037ph0",
      "m.03b6j8",
      "m.03gv21b",
      "m.047d9d5",
      "m.051zxkk",
      "m.0dd9mps"
    ],
    "answer_entity_names": [
      "Poland national handball team",
      "Poland women's national handball team",
      "Poland men's national volleyball team",
      "Poland women's national volleyball team",
      "Asseco Gdynia",
      "KK Włocławek",
      "Turów Zgorzelec",
      "Poland national football team",
      "Stal Gorzów Wielkopolski",
      "Śląsk Wrocław",
      "GTŻ Grudziądz",
      "Basket Zielona Góra"
    ],
    "hop": 1,
    "qid": "WebQTest-1084",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qhw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qhw ns:sports.sports_team_location.teams ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team_location.teams"
    ]
  },
  {
    "question": "what currency is used in panama",
    "question_entity": "m.05qx1",
    "question_entity_name": "Panama",
    "answer_entities": [
      "m.0200cp",
      "m.09nqf"
    ],
    "answer_entity_names": [
      "Panamanian balboa",
      "United States Dollar"
    ],
    "hop": 1,
    "qid": "WebQTest-469",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qx1 ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what is claire danes famous for",
    "question_entity": "m.01gq0b",
    "question_entity_name": "Claire Danes",
    "answer_entities": [
      "m.02hrh1q",
      "m.03gjzk",
      "m.0np9r"
    ],
    "answer_entity_names": [
      "Actor",
      "Television producer",
      "Voice Actor"
    ],
    "hop": 1,
    "qid": "WebQTest-633",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01gq0b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01gq0b ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what is the capital of modern egypt",
    "question_entity": "m.02k54",
    "question_entity_name": "Egypt",
    "answer_entities": [
      "m.01w2v"
    ],
    "answer_entity_names": [
      "Cairo"
    ],
    "hop": 1,
    "qid": "WebQTest-204",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "what language did the sioux indians speak",
    "question_entity": "m.0fk3s",
    "question_entity_name": "Sioux",
    "answer_entities": [
      "m.02h40lc",
      "m.0565z6",
      "m.064_8sq"
    ],
    "answer_entity_names": [
      "English Language",
      "Sioux language",
      "French"
    ],
    "hop": 1,
    "qid": "WebQTest-957",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fk3s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fk3s ns:people.ethnicity.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.languages_spoken"
    ]
  },
  {
    "question": "what language does peru speak",
    "question_entity": "m.016wzw",
    "question_entity_name": "Peru",
    "answer_entities": [
      "m.01y5tq",
      "m.02hxk02",
      "m.06nm1",
      "m.06qmrf",
      "m.09_sxt",
      "m.09j2hg"
    ],
    "answer_entity_names": [
      "Aymara language",
      "Omagua dialect",
      "Spanish Language",
      "Ayacucho Quechua",
      "Puquina Language",
      "Waorani Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1721",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016wzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016wzw ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what country does rafael nadal play for",
    "question_entity": "m.051q39",
    "question_entity_name": "Rafael Nadal",
    "answer_entities": [
      "m.06mkj"
    ],
    "answer_entity_names": [
      "Spain"
    ],
    "hop": 1,
    "qid": "WebQTest-1770",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051q39)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051q39 ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "what time zone is anaheim california",
    "question_entity": "m.0k9p4",
    "question_entity_name": "Anaheim",
    "answer_entities": [
      "m.02lcqs"
    ],
    "answer_entity_names": [
      "Pacific Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-297",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k9p4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k9p4 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what superbowl did the baltimore ravens win",
    "question_entity": "m.01ct6",
    "question_entity_name": "Baltimore Ravens",
    "answer_entities": [
      "m.0_gt_qt",
      "m.0_gtz8t",
      "m.0642vqv",
      "m.076yq"
    ],
    "answer_entity_names": [
      "2001 AFC Championship Game",
      "2013 AFC Championship Game",
      "Super Bowl XLVII",
      "Super Bowl XXXV"
    ],
    "hop": 1,
    "qid": "WebQTest-915",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:sports.sports_team.championships ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.championships"
    ]
  },
  {
    "question": "what language does cuba speak",
    "question_entity": "m.0d04z6",
    "question_entity_name": "Cuba",
    "answer_entities": [
      "m.02dhwl",
      "m.02hwhd2",
      "m.06nm1"
    ],
    "answer_entity_names": [
      "Haitian Creole",
      "Lucumi Language",
      "Spanish Language"
    ],
    "hop": 1,
    "qid": "WebQTest-150",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d04z6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d04z6 ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "who owns the portland press herald",
    "question_entity": "m.0852w8",
    "question_entity_name": "Portland Press Herald",
    "answer_entities": [
      "m.05kh9x5"
    ],
    "answer_entity_names": [
      "Blethen Maine Newspapers, Inc."
    ],
    "hop": 1,
    "qid": "WebQTest-351",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0852w8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0852w8 ns:book.newspaper.owner ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.newspaper.owner"
    ]
  },
  {
    "question": "what is arkansas state capitol",
    "question_entity": "m.05yzfg",
    "question_entity_name": "Arkansas State Capitol",
    "answer_entities": [
      "m.0ftvg"
    ],
    "answer_entity_names": [
      "Little Rock"
    ],
    "hop": 2,
    "qid": "WebQTest-564",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05yzfg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05yzfg ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.street_address",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what did franz liszt do to earn a living",
    "question_entity": "m.0hqgp",
    "question_entity_name": "Life of Franz Liszt",
    "answer_entities": [
      "m.01c72t",
      "m.01cmdm",
      "m.04l1gwb",
      "m.05vyk",
      "m.05xjb"
    ],
    "answer_entity_names": [
      "Composer",
      "Virtuoso",
      "Film Score Composer",
      "Pianist",
      "Priest"
    ],
    "hop": 1,
    "qid": "WebQTest-1379",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hqgp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hqgp ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what is the most common language in norway",
    "question_entity": "m.05b4w",
    "question_entity_name": "Norway",
    "answer_entities": [
      "m.01648r",
      "m.016rsc",
      "m.05f_3"
    ],
    "answer_entity_names": [
      "Bokmål",
      "Nynorsk",
      "Norwegian Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1683",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b4w ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "when is saint george day celebrated",
    "question_entity": "m.05474b",
    "question_entity_name": "St George's Day",
    "answer_entities": [
      "m.0tht"
    ],
    "answer_entity_names": [
      "April 23"
    ],
    "hop": 1,
    "qid": "WebQTest-556",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05474b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05474b ns:time.holiday.day_of_year ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.holiday.day_of_year"
    ]
  },
  {
    "question": "where is tunis on a map",
    "question_entity": "m.07fj_",
    "question_entity_name": "Tunisia",
    "answer_entities": [
      "m.0dg3n1"
    ],
    "answer_entity_names": [
      "Africa"
    ],
    "hop": 1,
    "qid": "WebQTest-1640",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07fj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07fj_ ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  },
  {
    "question": "what is the name of the san francisco newspaper",
    "question_entity": "m.0d6lp",
    "question_entity_name": "San Francisco",
    "answer_entities": [
      "m.0_l9flk",
      "m.01v9vx",
      "m.01yrn5",
      "m.0271stb",
      "m.02rnd80",
      "m.03g_4mj",
      "m.03l2ys",
      "m.03x7zl",
      "m.04j38b3",
      "m.04tk4gw",
      "m.04zg67",
      "m.06_gr",
      "m.085z3r",
      "m.09573v",
      "m.09jj5c",
      "m.0b44w3m",
      "m.0bsjtf",
      "m.0d3zvq",
      "m.0f83cz",
      "m.0hqgb4v"
    ],
    "answer_entity_names": [
      "Dock of the Bay",
      "San Francisco Chronicle",
      "Sing Tao Daily",
      "The Daily Alta California",
      "San Francisco Bay Times",
      "Free Society",
      "San Francisco Bay Guardian",
      "San Francisco Bay View",
      "Synapse",
      "California Star",
      "The Golden Era",
      "The San Francisco Examiner",
      "San Francisco Foghorn",
      "San Francisco Call",
      "Street Sheet",
      "San Francisco News-Call Bulletin Newspaper",
      "AsianWeek",
      "San Francisco Daily",
      "Bay Area Reporter",
      "San Francisco Business Times"
    ],
    "hop": 1,
    "qid": "WebQTest-91",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6lp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6lp ns:periodicals.newspaper_circulation_area.newspapers ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "periodicals.newspaper_circulation_area.newspapers"
    ]
  },
  {
    "question": "what was the currency used in france before the euro",
    "question_entity": "m.0f8l9c",
    "question_entity_name": "France",
    "answer_entities": [
      "m.01m4tk",
      "m.0298sr"
    ],
    "answer_entity_names": [
      "Assignat",
      "French franc"
    ],
    "hop": 1,
    "qid": "WebQTest-1120",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.currency_formerly_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_formerly_used"
    ]
  },
  {
    "question": "what language tunisia",
    "question_entity": "m.07fj_",
    "question_entity_name": "Tunisia",
    "answer_entities": [
      "m.064_8sq",
      "m.0jzc"
    ],
    "answer_entity_names": [
      "French",
      "Arabic Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1624",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07fj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07fj_ ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what language does iceland speak",
    "question_entity": "m.03rj0",
    "question_entity_name": "Iceland",
    "answer_entities": [
      "m.01gmkg"
    ],
    "answer_entity_names": [
      "Icelandic Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1648",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rj0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rj0 ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what body of water does st lawrence river flow into",
    "question_entity": "m.0cg4t",
    "question_entity_name": "Saint Lawrence River",
    "answer_entities": [
      "m.0j8pq"
    ],
    "answer_entity_names": [
      "Gulf of Saint Lawrence"
    ],
    "hop": 1,
    "qid": "WebQTest-1895",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cg4t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cg4t ns:geography.river.mouth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "geography.river.mouth"
    ]
  },
  {
    "question": "where is daud ibrahim",
    "question_entity": "m.02ry1s",
    "question_entity_name": "Dawood Ibrahim",
    "answer_entities": [
      "m.055vr"
    ],
    "answer_entity_names": [
      "Maharashtra"
    ],
    "hop": 2,
    "qid": "WebQTest-1764",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ry1s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ry1s ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "where did the mississippi river end",
    "question_entity": "m.04yf_",
    "question_entity_name": "Mississippi River",
    "answer_entities": [
      "m.03f_9"
    ],
    "answer_entity_names": [
      "Gulf of Mexico"
    ],
    "hop": 1,
    "qid": "WebQTest-1200",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yf_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yf_ ns:geography.river.mouth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "geography.river.mouth"
    ]
  },
  {
    "question": "what style of music did bessie smith perform",
    "question_entity": "m.0dq47",
    "question_entity_name": "Bessie Smith",
    "answer_entities": [
      "m.0155w",
      "m.03_d0"
    ],
    "answer_entity_names": [
      "Blues",
      "Jazz"
    ],
    "hop": 1,
    "qid": "WebQTest-971",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dq47)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dq47 ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what movies did nick cannon star in",
    "question_entity": "m.01d1st",
    "question_entity_name": "Nick Cannon",
    "answer_entities": [
      "m.0134yc8y",
      "m.01yzvd",
      "m.02qzrt_",
      "m.02rhxt_",
      "m.031t2d",
      "m.043dz8",
      "m.0464t_m",
      "m.04ybhxs",
      "m.07kjm8q",
      "m.07mj_0",
      "m.07pnlt",
      "m.07y9w5",
      "m.08_wh0",
      "m.08jml6",
      "m.08r4x3",
      "m.09flkf",
      "m.09zg5d",
      "m.0c34n5",
      "m.0ftc14",
      "m.0gj9fmj",
      "m.0mzmnx4"
    ],
    "answer_entity_names": [
      "Chiraq",
      "Garfield: The Movie",
      "Even Money",
      "American Son",
      "Men in Black II",
      "Shall We Dance?",
      "Ball Don't Lie",
      "The Killing Room",
      "Weapons",
      "Underclassman",
      "Roll Bounce",
      "Monster House",
      "Goal II: Living the Dream",
      "Drumline",
      "Bobby",
      "Love Don't Cost a Thing",
      "Day of the Dead",
      "Whatever It Takes",
      "The Adventures of Brer Rabbit",
      "A Very School Gyrls Holla-Day",
      "Drumline: A New Beat"
    ],
    "hop": 2,
    "qid": "WebQTest-1107",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d1st)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d1st ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "when did the san francisco earthquake occur",
    "question_entity": "m.01f6rm",
    "question_entity_name": "1906 San Francisco earthquake",
    "answer_entities": [
      "1906-04-18"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1051",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f6rm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f6rm ns:time.event.start_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.start_date"
    ]
  },
  {
    "question": "what was van halen first album",
    "question_entity": "m.0ycfj",
    "question_entity_name": "Van Halen",
    "answer_entities": [
      "m.0vs85p3"
    ],
    "answer_entity_names": [
      "Ain't Talkin' 'Bout Love"
    ],
    "hop": 1,
    "qid": "WebQTest-944",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ycfj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ycfj ns:music.artist.album ?x .\n?x ns:music.album.release_date ?sk0 .\n}\nORDER BY xsd:datetime(?sk0)\nLIMIT 1\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.album"
    ]
  },
  {
    "question": "what kind of cancer did carl wilson have",
    "question_entity": "m.01n9vwg",
    "question_entity_name": "Carl Wilson",
    "answer_entities": [
      "m.04p3w",
      "m.09969"
    ],
    "answer_entity_names": [
      "Lung cancer",
      "Brain tumor"
    ],
    "hop": 1,
    "qid": "WebQTest-67",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n9vwg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n9vwg ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "after how many years are the olympic games held",
    "question_entity": "m.05nd_",
    "question_entity_name": "Olympic Games",
    "answer_entities": [
      "m.04q0_4f"
    ],
    "answer_entity_names": [
      "Quadrennial"
    ],
    "hop": 1,
    "qid": "WebQTest-677",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05nd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05nd_ ns:time.recurring_event.current_frequency ?x .\n?x ns:freebase.unit_profile.dimension ns:m.07c_l .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.recurring_event.current_frequency"
    ]
  },
  {
    "question": "what political party is jerry brown",
    "question_entity": "m.017pf5",
    "question_entity_name": "Jerry Brown",
    "answer_entities": [
      "m.0b8h9s",
      "m.0d075m"
    ],
    "answer_entity_names": [
      "California Democratic Party",
      "Democratic Party"
    ],
    "hop": 2,
    "qid": "WebQTest-1621",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017pf5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017pf5 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.politician.party",
      "government.political_party_tenure.party"
    ]
  },
  {
    "question": "where were the great pyramids of giza built",
    "question_entity": "m.036mk",
    "question_entity_name": "Great Pyramid of Giza",
    "answer_entities": [
      "m.06bkmh"
    ],
    "answer_entity_names": [
      "Giza Plateau"
    ],
    "hop": 1,
    "qid": "WebQTest-1075",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036mk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036mk ns:architecture.building.building_complex ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "architecture.building.building_complex"
    ]
  },
  {
    "question": "who killed lee harvey oswald shot",
    "question_entity": "m.04gwy",
    "question_entity_name": "Lee Harvey Oswald",
    "answer_entities": [
      "m.044sb"
    ],
    "answer_entity_names": [
      "Jack Ruby"
    ],
    "hop": 1,
    "qid": "WebQTest-997",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04gwy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04gwy ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "user.alexander.misc.murdered_person.murdered_by"
    ]
  },
  {
    "question": "where did francisco coronado come from",
    "question_entity": "m.0jgb2",
    "question_entity_name": "Francisco Vázquez de Coronado",
    "answer_entities": [
      "m.0b283h"
    ],
    "answer_entity_names": [
      "Salamanca"
    ],
    "hop": 1,
    "qid": "WebQTest-122",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgb2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgb2 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "how many mary mary sisters",
    "question_entity": "m.01kq11t",
    "question_entity_name": "Mary Mary",
    "answer_entities": [
      "m.05bw51f",
      "m.05bw51n"
    ],
    "answer_entity_names": [
      "Tina Campbell",
      "Erica Campbell"
    ],
    "hop": 2,
    "qid": "WebQTest-1103",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kq11t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kq11t ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.musical_group.member",
      "music.group_membership.member"
    ]
  },
  {
    "question": "what language does east timor speak",
    "question_entity": "m.02lx0",
    "question_entity_name": "Timor-Leste",
    "answer_entities": [
      "m.025t0jp",
      "m.02h40lc",
      "m.02hwsld",
      "m.02hwtzw",
      "m.02hwv54",
      "m.02hxpqk",
      "m.02hxv_x",
      "m.02hxwg_",
      "m.02hxz87",
      "m.03xwkt",
      "m.05zjd",
      "m.063xlx",
      "m.097kp",
      "m.0bvt6k",
      "m.0dss2",
      "m.0k97dfx",
      "m.0kc98sf",
      "m.0kc98sk",
      "m.0kc98sn",
      "m.0kc98sr"
    ],
    "answer_entity_names": [
      "Bunak Language",
      "English Language",
      "Habu Language",
      "Kemak Language",
      "Makuv'a Language",
      "Mambai Language",
      "Galoli Language",
      "Makasae Language",
      "Tukudede Language",
      "Makalero dialect",
      "Portuguese Language",
      "Fataluku Language",
      "Indonesian Language",
      "Kawaimina languages",
      "Tetun Language",
      "Idalaka",
      "Bekais",
      "Dawan",
      "Wetarese",
      "Tetun-Terik"
    ],
    "hop": 1,
    "qid": "WebQTest-1059",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lx0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lx0 ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what does wh smith stand for",
    "question_entity": "m.04sxlr",
    "question_entity_name": "William Henry Smith",
    "answer_entities": [
      "m.013_kt"
    ],
    "answer_entity_names": [
      "WHSmith"
    ],
    "hop": 1,
    "qid": "WebQTest-1133",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  ?x ns:common.topic.alias \"W H Smith\"@en .\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "who played maggie in himym",
    "question_entity": "m.0h67q",
    "question_entity_name": "Maggie Simpson",
    "answer_entities": [
      "m.0sw62"
    ],
    "answer_entity_names": [
      "Nancy Cartwright"
    ],
    "hop": 2,
    "qid": "WebQTest-1996",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h67q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h67q ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "where was the vietnam war location",
    "question_entity": "m.07_nf",
    "question_entity_name": "Vietnam War",
    "answer_entities": [
      "m.01crd5",
      "m.01xbgx",
      "m.04hhv",
      "m.073q1",
      "m.0g8bw",
      "m.0g970"
    ],
    "answer_entity_names": [
      "Vietnam",
      "Cambodia",
      "Laos",
      "Southeast Asia",
      "South Vietnam",
      "North Vietnam"
    ],
    "hop": 1,
    "qid": "WebQTest-200",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_nf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_nf ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what language is spoken in haiti today",
    "question_entity": "m.03gyl",
    "question_entity_name": "Haiti",
    "answer_entities": [
      "m.02dhwl",
      "m.064_8sq"
    ],
    "answer_entity_names": [
      "Haitian Creole",
      "French"
    ],
    "hop": 1,
    "qid": "WebQTest-100",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gyl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gyl ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "when was lucy lawless born",
    "question_entity": "m.01r9md",
    "question_entity_name": "Lucy Lawless",
    "answer_entities": [
      "1968-03-29"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-718",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r9md)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r9md ns:people.person.date_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.date_of_birth"
    ]
  },
  {
    "question": "what schools did sir isaac newton go to",
    "question_entity": "m.03s9v",
    "question_entity_name": "Isaac Newton",
    "answer_entities": [
      "m.07tk7",
      "m.0h37f2"
    ],
    "answer_entity_names": [
      "Trinity College, Cambridge",
      "The King's School, Grantham"
    ],
    "hop": 2,
    "qid": "WebQTest-920",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03s9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03s9v ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  }
]