[
  {
    "question": "what is the zip code for walnut creek",
    "question_entity": "m.0qyzb",
    "question_entity_name": "Walnut Creek",
    "answer_entities": [
      "m.01zs6f0",
      "m.01zs6ht",
      "m.01zs6ms",
      "m.01zs75v"
    ],
    "answer_entity_names": [
      "94596",
      "94598",
      "94597",
      "94595"
    ],
    "hop": 1,
    "qid": "WebQTest-1659",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qyzb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qyzb ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what was lucille ball",
    "question_entity": "m.04nw9",
    "question_entity_name": "Lucille Ball",
    "answer_entities": [
      "m.018gz8",
      "m.02hrh1q",
      "m.03gjzk",
      "m.09l65",
      "m.0d1pc"
    ],
    "answer_entity_names": [
      "Comedian",
      "Actor",
      "Television producer",
      "Singer",
      "Model"
    ],
    "hop": 1,
    "qid": "WebQTest-129",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nw9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nw9 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what team did adrian peterson play for in college",
    "question_entity": "m.095xk6",
    "question_entity_name": "Adrian Peterson",
    "answer_entities": [
      "m.01vs5c"
    ],
    "answer_entity_names": [
      "University of Oklahoma"
    ],
    "hop": 2,
    "qid": "WebQTest-479",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.095xk6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.095xk6 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.school ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.drafted_athlete.drafted",
      "sports.sports_league_draft_pick.school"
    ]
  },
  {
    "question": "what standard time is texas",
    "question_entity": "m.07b_l",
    "question_entity_name": "Texas",
    "answer_entities": [
      "m.02fqwt",
      "m.02hczc"
    ],
    "answer_entity_names": [
      "Central Time Zone",
      "Mountain Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1845",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07b_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07b_l ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what is the zip code for morgantown wv",
    "question_entity": "m.010y34",
    "question_entity_name": "Morgantown",
    "answer_entities": [
      "m.021l1w6",
      "m.03dz41r",
      "m.03dz42b",
      "m.07nr9sw",
      "m.07nr9t2",
      "m.07nr9t9",
      "m.07nr9tj"
    ],
    "answer_entity_names": [
      "26505",
      "26501",
      "26508",
      "26507",
      "26506",
      "26504",
      "26502"
    ],
    "hop": 1,
    "qid": "WebQTest-1045",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.010y34)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.010y34 ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what are the names of harry potter movies in order",
    "question_entity": "m.02676m4",
    "question_entity_name": "Harry Potter",
    "answer_entities": [
      "m.02pth35",
      "m.03176f",
      "m.031778",
      "m.03177r",
      "m.031786",
      "m.031hcx",
      "m.03hxsv",
      "m.0gvsynb"
    ],
    "answer_entity_names": [
      "Harry Potter and the Deathly Hallows - Part I",
      "Harry Potter and the Philosopher's Stone",
      "Harry Potter and the Chamber of Secrets",
      "Harry Potter and the Prisoner of Azkaban",
      "Harry Potter and the Goblet of Fire",
      "Harry Potter and the Order of the Phoenix",
      "Harry Potter and the Half-Blood Prince",
      "Harry Potter and the Deathly Hallows – Part 2"
    ],
    "hop": 1,
    "qid": "WebQTest-820",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02676m4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02676m4 ns:film.film_series.films_in_series ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_series.films_in_series"
    ]
  },
  {
    "question": "where was country singer george jones born",
    "question_entity": "m.01hb9p",
    "question_entity_name": "George Jones",
    "answer_entities": [
      "m.0f9hl3"
    ],
    "answer_entity_names": [
      "Saratoga"
    ],
    "hop": 1,
    "qid": "WebQTest-315",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hb9p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hb9p ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "who plays stanley hudson",
    "question_entity": "m.026nx7k",
    "question_entity_name": "Stanley Hudson",
    "answer_entities": [
      "m.0cnl09"
    ],
    "answer_entity_names": [
      "Leslie David Baker"
    ],
    "hop": 2,
    "qid": "WebQTest-729",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026nx7k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026nx7k ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_character.appeared_in_tv_program",
      "tv.regular_tv_appearance.actor"
    ]
  },
  {
    "question": "where did mary bell live",
    "question_entity": "m.01j324",
    "question_entity_name": "Mary Bell",
    "answer_entities": [
      "m.0j7ng"
    ],
    "answer_entity_names": [
      "Newcastle upon Tyne"
    ],
    "hop": 1,
    "qid": "WebQTest-646",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01j324)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01j324 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "who or what influenced albert einstein",
    "question_entity": "m.0jcx",
    "question_entity_name": "Albert Einstein",
    "answer_entities": [
      "m.012102",
      "m.015n8",
      "m.015yk8",
      "m.01bgwr",
      "m.01dfd4",
      "m.026lj",
      "m.032l1",
      "m.03cdg",
      "m.03s9v",
      "m.0434m",
      "m.04xfb",
      "m.05q658z",
      "m.05vy1",
      "m.0bjvq",
      "m.0dm1p",
      "m.0fcy0",
      "m.0j3v",
      "m.0m3hd"
    ],
    "answer_entity_names": [
      "Henry George",
      "Baruch Spinoza",
      "Karl Pearson",
      "Hermann Minkowski",
      "Moritz Schlick",
      "David Hume",
      "Fyodor Dostoyevsky",
      "George Bernard Shaw",
      "Isaac Newton",
      "James Clerk Maxwell",
      "Mahatma Gandhi",
      "Riazuddin",
      "Paul Valéry",
      "Bernhard Riemann",
      "Thomas Young",
      "Ernst Mach",
      "Arthur Schopenhauer",
      "Hendrik Lorentz"
    ],
    "hop": 1,
    "qid": "WebQTest-1781",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jcx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jcx ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "what area of science did sir isaac newton study",
    "question_entity": "m.03s9v",
    "question_entity_name": "Isaac Newton",
    "answer_entities": [
      "m.01pxg",
      "m.02h6fbs",
      "m.04s2z",
      "m.05snw",
      "m.06q2q",
      "m.0h9c"
    ],
    "answer_entity_names": [
      "Chemist",
      "Philosopher",
      "Mathematician",
      "Physicist",
      "Scientist",
      "Astronomer"
    ],
    "hop": 1,
    "qid": "WebQTest-1125",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03s9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03s9v ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where is electrolux based",
    "question_entity": "m.02h0_y",
    "question_entity_name": "Electrolux",
    "answer_entities": [
      "m.06mxs"
    ],
    "answer_entity_names": [
      "Stockholm"
    ],
    "hop": 2,
    "qid": "WebQTest-1690",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h0_y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h0_y ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what does god shiva represent",
    "question_entity": "m.074l5",
    "question_entity_name": "Shiva",
    "answer_entities": [
      "m.03j6c"
    ],
    "answer_entity_names": [
      "Hinduism"
    ],
    "hop": 1,
    "qid": "WebQTest-1885",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.074l5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.074l5 ns:religion.deity.deity_of ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "religion.deity.deity_of"
    ]
  },
  {
    "question": "where is the thames river source",
    "question_entity": "m.0d2kt",
    "question_entity_name": "River Thames",
    "answer_entities": [
      "m.02pj_tp"
    ],
    "answer_entity_names": [
      "Thames Head"
    ],
    "hop": 1,
    "qid": "WebQTest-1593",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d2kt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d2kt ns:geography.river.origin ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "geography.river.origin"
    ]
  },
  {
    "question": "what is monta ellis career high points",
    "question_entity": "m.06rsnl",
    "question_entity_name": "Monta Ellis",
    "answer_entities": [
      "m.06js8m"
    ],
    "answer_entity_names": [
      "NBA Most Improved Player Award"
    ],
    "hop": 2,
    "qid": "WebQTest-1217",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rsnl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rsnl ns:sports.sports_award_winner.awards ?y .\n?y ns:sports.sports_award.award ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_award_winner.awards",
      "sports.sports_award.award"
    ]
  },
  {
    "question": "what was kim richards in",
    "question_entity": "m.08l257",
    "question_entity_name": "Kim Richards",
    "answer_entities": [
      "m.02r2r2j",
      "m.02rl4qq",
      "m.04f2h9q",
      "m.04f76fm",
      "m.05dj6dc",
      "m.05r3nm",
      "m.07wbmd",
      "m.08dyxd",
      "m.0bfmjvh",
      "m.0d1_kl",
      "m.0dnh5w",
      "m.0ff1st"
    ],
    "answer_entity_names": [
      "Devil Dog: The Hound of Hell",
      "Tuff Turf",
      "Escape to Witch Mountain",
      "Race to Witch Mountain",
      "Nanny and the Professor",
      "Return from Witch Mountain",
      "Meatballs Part II",
      "The Car",
      "The Whiz Kid and the Mystery at Riverton",
      "No Deposit, No Return",
      "Raid on Entebbe",
      "Black Snake Moan"
    ],
    "hop": 2,
    "qid": "WebQTest-1785",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08l257)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08l257 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "where did the battle of waterloo occur",
    "question_entity": "m.01dcm",
    "question_entity_name": "Battle of Waterloo",
    "answer_entities": [
      "m.017qwy"
    ],
    "answer_entity_names": [
      "Waterloo"
    ],
    "hop": 1,
    "qid": "WebQTest-834",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dcm ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what kind of leukemia did jill clayburgh have",
    "question_entity": "m.01gw8b",
    "question_entity_name": "Jill Clayburgh",
    "answer_entities": [
      "m.02bg7m",
      "m.04psf"
    ],
    "answer_entity_names": [
      "B-cell chronic lymphocytic leukemia",
      "Leukemia"
    ],
    "hop": 1,
    "qid": "WebQTest-721",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01gw8b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01gw8b ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "where did rob kardashian go to school",
    "question_entity": "m.043n6dp",
    "question_entity_name": "Rob Kardashian",
    "answer_entities": [
      "m.06t2qb"
    ],
    "answer_entity_names": [
      "USC Marshall School of Business"
    ],
    "hop": 2,
    "qid": "WebQTest-1913",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043n6dp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043n6dp ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what language do the russian speak",
    "question_entity": "m.06bnz",
    "question_entity_name": "Russia",
    "answer_entities": [
      "m.017dsl",
      "m.0198z0",
      "m.019yz7",
      "m.01bcw_",
      "m.01qyqy",
      "m.01y_vl",
      "m.020g7w",
      "m.0234zj",
      "m.0264gxt",
      "m.027bj_4",
      "m.02gj5b",
      "m.02hwm9x",
      "m.02lpht",
      "m.02mj1c",
      "m.02mxzf",
      "m.02nbbh",
      "m.02q4t0g",
      "m.02x9lm",
      "m.037lmh",
      "m.037nfm",
      "m.03f3f1",
      "m.03gn_0",
      "m.03klw8",
      "m.03wt_j",
      "m.049jrm",
      "m.04rxz0",
      "m.04xqkr",
      "m.054zyh",
      "m.05l6md",
      "m.06b_j",
      "m.06bw_x",
      "m.0880p",
      "m.091dr6",
      "m.093gjw",
      "m.0cjk9"
    ],
    "answer_entity_names": [
      "Osetin Language",
      "Chechen Language",
      "Tatar Language",
      "Azerbaijani language",
      "Abaza Language",
      "Mari language",
      "Bashkir Language",
      "Avar Language",
      "Aghul language",
      "Tsakhur Language",
      "Tuvin Language",
      "Moksha Language",
      "Erzya Language",
      "Kalmyk-Oirat Language",
      "Kabardian Language",
      "Adyghe Language",
      "Rutul language",
      "Lezgi Language",
      "Ingush Language",
      "Altai language",
      "Crimean Turkish Language",
      "Nogai Language",
      "Dargwa Language",
      "Komi language",
      "Udmurt Language",
      "Kumyk Language",
      "Karachay-Balkar Language",
      "Buryat language",
      "Yakut Language",
      "Russian Language",
      "Tabassaran Language",
      "Yiddish Language",
      "Lak Language",
      "Khakas Language",
      "Ukrainian Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1077",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what to do with my kids in toronto",
    "question_entity": "m.0h7h6",
    "question_entity_name": "Toronto",
    "answer_entities": [
      "m.01_zt4",
      "m.0170x4",
      "m.018dtx",
      "m.01tws",
      "m.01xs9p",
      "m.01yk7l",
      "m.01zqjc",
      "m.01zrh2",
      "m.024wty",
      "m.024yvy",
      "m.026gt46",
      "m.026lgdg",
      "m.027_p6",
      "m.028b_w",
      "m.02cfl0",
      "m.02dktk",
      "m.02h456",
      "m.02jlfc",
      "m.02js07",
      "m.02jzwv",
      "m.02kppx",
      "m.02qnrn_",
      "m.02vpvh6",
      "m.02vpw01",
      "m.02vylr",
      "m.03q_c9",
      "m.0496dg",
      "m.049963",
      "m.049gjy",
      "m.049gql",
      "m.04h_rf",
      "m.04zvykh",
      "m.05398k",
      "m.056fr8",
      "m.05dv6f",
      "m.05kywl",
      "m.05s4g6",
      "m.06d1jn",
      "m.06j93_",
      "m.07040p",
      "m.08jh92",
      "m.08pt1m",
      "m.08wgfx",
      "m.0bk7sc",
      "m.0cp0hfg",
      "m.0g5824n",
      "m.0jt2h",
      "m.0swmcnz",
      "m.0wbh5pc"
    ],
    "answer_entity_names": [
      "Casa Loma",
      "Rogers Centre",
      "Toronto Islands",
      "CN Tower",
      "Royal Ontario Museum",
      "Cabbagetown, Toronto",
      "The Beaches",
      "Toronto Eaton Centre",
      "High Park",
      "Chinatown, Toronto",
      "Toronto Waterfront Marathon",
      "Textile Museum of Canada",
      "Kensington Market",
      "Air Canada Centre",
      "Spadina House",
      "Queen Street West",
      "Canada's Wonderland",
      "Toronto Zoo",
      "Ontario Science Centre",
      "Ontario Place",
      "Black Creek Pioneer Village",
      "Museum of Contemporary Canadian Art",
      "Gardiner Museum",
      "Luminato",
      "Art Gallery of Ontario",
      "Yorkville, Toronto",
      "Bata Shoe Museum",
      "Nathan Phillips Square",
      "Roy Thomson Hall",
      "Sony Centre for the Performing Arts",
      "Royal Alexandra Theatre",
      "Bayview Village Shopping Centre",
      "Toronto Centre for the Arts",
      "Princess of Wales Theatre",
      "Planet in Focus",
      "Danforth Avenue",
      "McMichael Canadian Art Collection",
      "Queens Quay",
      "St. Lawrence Market",
      "Distillery District",
      "Edwards Gardens",
      "First Toronto Post Office",
      "BMO Field",
      "Hanlan's Point Beach",
      "Sugar Beach",
      "Bare Oaks Family Naturist Park",
      "Hockey Hall of Fame",
      "Heartland Town Centre",
      "Corktown Common"
    ],
    "hop": 1,
    "qid": "WebQTest-1464",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h7h6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h7h6 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what was jesse owens education",
    "question_entity": "m.0cmr3",
    "question_entity_name": "Jesse Owens",
    "answer_entities": [
      "m.05krk",
      "m.0fcddh"
    ],
    "answer_entity_names": [
      "Ohio State University",
      "East Technical High School"
    ],
    "hop": 2,
    "qid": "WebQTest-778",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmr3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmr3 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what sarah dessen books are movies",
    "question_entity": "m.052s_8",
    "question_entity_name": "Sarah Dessen",
    "answer_entities": [
      "m.04y364"
    ],
    "answer_entity_names": [
      "How to Deal"
    ],
    "hop": 1,
    "qid": "WebQTest-1180",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.052s_8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.052s_8 ns:film.film_story_contributor.film_story_credits ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_story_contributor.film_story_credits"
    ]
  },
  {
    "question": "who is richard pryor son",
    "question_entity": "m.01hmk9",
    "question_entity_name": "Richard Pryor",
    "answer_entities": [
      "m.05z2sc1",
      "m.05z2scn",
      "m.05z2scv"
    ],
    "answer_entity_names": [
      "Franklin Pryor",
      "Richard Pryor Jr.",
      "Steven Pryor"
    ],
    "hop": 1,
    "qid": "WebQTest-340",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hmk9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hmk9 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what type of art did raphael sanzio create",
    "question_entity": "m.0c43g",
    "question_entity_name": "Raphael",
    "answer_entities": [
      "m.02csf",
      "m.05qdh"
    ],
    "answer_entity_names": [
      "Drawing",
      "Painting"
    ],
    "hop": 1,
    "qid": "WebQTest-1612",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c43g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c43g ns:visual_art.visual_artist.art_forms ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.art_forms"
    ]
  },
  {
    "question": "which country was michael jackson born",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.09c7w0"
    ],
    "answer_entity_names": [
      "United States of America"
    ],
    "hop": 1,
    "qid": "WebQTest-1213",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.09889g ns:people.person.place_of_birth ?y .\n\t?y ns:location.location.containedby ?x .\n\t?x ns:common.topic.notable_types ns:m.01mp .  #Country\n}",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where did bristol palin go to school",
    "question_entity": "m.04jg1kh",
    "question_entity_name": "Bristol Palin",
    "answer_entities": [
      "m.02fqd7",
      "m.04jdv0r",
      "m.08r1_d"
    ],
    "answer_entity_names": [
      "Juneau-Douglas High School",
      "Wasilla High School",
      "West Anchorage High School"
    ],
    "hop": 2,
    "qid": "WebQTest-188",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jg1kh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jg1kh ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "who is willow smith mom name",
    "question_entity": "m.03gq433",
    "question_entity_name": "Willow Smith",
    "answer_entities": [
      "m.01j7z7"
    ],
    "answer_entity_names": [
      "Jada Pinkett Smith"
    ],
    "hop": 1,
    "qid": "WebQTest-88",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gq433)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gq433 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what is malaysian currency",
    "question_entity": "m.09pmkv",
    "question_entity_name": "Malaysia",
    "answer_entities": [
      "m.01_c9q"
    ],
    "answer_entity_names": [
      "Malaysian ringgit"
    ],
    "hop": 1,
    "qid": "WebQTest-766",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09pmkv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09pmkv ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what did stephen hawking become famous for",
    "question_entity": "m.01tdnyh",
    "question_entity_name": "Stephen Hawking",
    "answer_entities": [
      "m.016fly",
      "m.02h65p0",
      "m.02h666v",
      "m.03qsdk0",
      "m.04s2z",
      "m.05snw",
      "m.06q2q",
      "m.0cbd2",
      "m.0h9c",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Professor",
      "Astrophysicist",
      "Science writer",
      "Cosmologist",
      "Mathematician",
      "Physicist",
      "Scientist",
      "Writer",
      "Astronomer",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-164",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tdnyh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tdnyh ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what state new york city belong to",
    "question_entity": "m.02_286",
    "question_entity_name": "New York City",
    "answer_entities": [
      "m.059rby"
    ],
    "answer_entity_names": [
      "New York"
    ],
    "hop": 1,
    "qid": "WebQTest-248",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02_286)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02_286 ns:base.biblioness.bibs_location.state ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.biblioness.bibs_location.state"
    ]
  },
  {
    "question": "where is traditional chinese used",
    "question_entity": "m.01r2l",
    "question_entity_name": "Chinese language",
    "answer_entities": [
      "m.0d05w3"
    ],
    "answer_entity_names": [
      "China"
    ],
    "hop": 1,
    "qid": "WebQTest-1873",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r2l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r2l ns:language.human_language.main_country ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.main_country"
    ]
  },
  {
    "question": "what school did douglas macarthur go to",
    "question_entity": "m.0c_jc",
    "question_entity_name": "Douglas MacArthur",
    "answer_entities": [
      "m.05chz5",
      "m.07x4c"
    ],
    "answer_entity_names": [
      "TMI — The Episcopal School of Texas",
      "United States Military Academy"
    ],
    "hop": 2,
    "qid": "WebQTest-1067",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c_jc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c_jc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "where was anne boleyn executed",
    "question_entity": "m.09sxn",
    "question_entity_name": "Anne Boleyn",
    "answer_entities": [
      "m.07nqn"
    ],
    "answer_entity_names": [
      "Tower of London"
    ],
    "hop": 1,
    "qid": "WebQTest-581",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09sxn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09sxn ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what is armenian currency",
    "question_entity": "m.0jgx",
    "question_entity_name": "Armenia",
    "answer_entities": [
      "m.033xr3"
    ],
    "answer_entity_names": [
      "Armenian dram"
    ],
    "hop": 1,
    "qid": "WebQTest-1611",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgx ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what movies does logan lerman play in",
    "question_entity": "m.04f1s6",
    "question_entity_name": "Logan Lerman",
    "answer_entities": [
      "g.122h61qh",
      "m.02bg55",
      "m.02pjkz7",
      "m.04f46k7",
      "m.0642xf3",
      "m.06y_y74",
      "m.07799g",
      "m.0b7hdh",
      "m.0btbyn",
      "m.0c4mcp",
      "m.0crc2cp",
      "m.0d31rqr",
      "m.0d67yl",
      "m.0g57wgv",
      "m.0gltv",
      "m.0gwrkkn",
      "m.0j27n5r",
      "m.0kdy118",
      "m.0lbcy8h",
      "m.0qlz9",
      "m.0t_5p_m"
    ],
    "answer_entity_names": [
      "The Flannerys",
      "The Butterfly Effect",
      "Gamer",
      "My One and Only",
      "Percy Jackson & the Olympians: The Lightning Thief",
      "A Painted House",
      "Riding in Cars with Boys",
      "Hoot",
      "3:10 to Yuma",
      "The Number 23",
      "The Three Musketeers",
      "Percy Jackson: Sea of Monsters",
      "Meet Bill",
      "The Perks of Being a Wallflower",
      "The Patriot",
      "The Only Living Boy in New York",
      "Stuck in Love",
      "Noah",
      "The Scribe",
      "What Women Want",
      "Fury"
    ],
    "hop": 2,
    "qid": "WebQTest-1528",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04f1s6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04f1s6 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  }
]