[
  {
    "question": "what countries in the world speak chinese",
    "question_entity": "m.01r2l",
    "question_entity_name": "Chinese language",
    "answer_entities": [
      "m.0167v",
      "m.01crd5",
      "m.06t2t",
      "m.09pmkv",
      "m.0d05w3",
      "m.0d060g",
      "m.0pb4_wn"
    ],
    "answer_entity_names": [
      "Brunei",
      "Vietnam",
      "Singapore",
      "Malaysia",
      "China",
      "Canada",
      "Shěn"
    ],
    "hop": 1,
    "qid": "WebQTest-254",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r2l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r2l ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "what county is greeley colorado in",
    "question_entity": "m.0rczx",
    "question_entity_name": "Greeley",
    "answer_entities": [
      "m.0n_ps"
    ],
    "answer_entity_names": [
      "Weld County"
    ],
    "hop": 1,
    "qid": "WebQTest-80",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rczx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rczx ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what was laura ingalls wilder famous for",
    "question_entity": "m.01bt87",
    "question_entity_name": "Laura Ingalls Wilder",
    "answer_entities": [
      "m.01d30f",
      "m.0cbd2",
      "m.0d8qb",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Teacher",
      "Writer",
      "Journalist",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-1449",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bt87)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bt87 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what religion does madonna practice",
    "question_entity": "m.01vs_v8",
    "question_entity_name": "Madonna",
    "answer_entities": [
      "m.01n15n",
      "m.0c8wxp"
    ],
    "answer_entity_names": [
      "Jewish Renewal",
      "Catholicism"
    ],
    "hop": 1,
    "qid": "WebQTest-1850",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vs_v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vs_v8 ns:people.person.religion ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.religion"
    ]
  },
  {
    "question": "what is the head judge of the supreme court called",
    "question_entity": "m.07sz1",
    "question_entity_name": "Supreme Court of the United States",
    "answer_entities": [
      "m.07szk"
    ],
    "answer_entity_names": [
      "Chief Justice of the United States"
    ],
    "hop": 1,
    "qid": "WebQTest-828",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07sz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07sz1 ns:government.governmental_body.offices_positions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.governmental_body.offices_positions"
    ]
  },
  {
    "question": "what is the australian dollar called",
    "question_entity": "m.0kz1h",
    "question_entity_name": "Australian dollar",
    "answer_entities": [
      "AUD"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-32",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kz1h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kz1h ns:finance.currency.currency_code ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "finance.currency.currency_code"
    ]
  },
  {
    "question": "where did the gettysburg address",
    "question_entity": "m.037yx",
    "question_entity_name": "Gettysburg Address",
    "answer_entities": [
      "m.0dzs0"
    ],
    "answer_entity_names": [
      "Gettysburg"
    ],
    "hop": 1,
    "qid": "WebQTest-742",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.037yx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.037yx ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what did randy savage died of",
    "question_entity": "m.02p7_z",
    "question_entity_name": "Randy Savage",
    "answer_entities": [
      "m.0gk4g"
    ],
    "answer_entity_names": [
      "heart attack"
    ],
    "hop": 1,
    "qid": "WebQTest-94",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02p7_z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02p7_z ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what did miles davis died of",
    "question_entity": "m.053yx",
    "question_entity_name": "Miles Davis",
    "answer_entities": [
      "m.019dmc",
      "m.02y0js",
      "m.0dq9p"
    ],
    "answer_entity_names": [
      "Respiratory failure",
      "Stroke",
      "Pneumonia"
    ],
    "hop": 1,
    "qid": "WebQTest-892",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.053yx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.053yx ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what continent does armenia belong to",
    "question_entity": "m.0jgx",
    "question_entity_name": "Armenia",
    "answer_entities": [
      "m.02j9z"
    ],
    "answer_entity_names": [
      "Europe"
    ],
    "hop": 1,
    "qid": "WebQTest-93",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgx ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  },
  {
    "question": "who will coach carolina panthers in 2013",
    "question_entity": "m.01y3c",
    "question_entity_name": "Carolina Panthers",
    "answer_entities": [
      "m.04g57l"
    ],
    "answer_entity_names": [
      "Ron Rivera"
    ],
    "hop": 1,
    "qid": "WebQTest-861",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y3c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y3c ns:american_football.football_team.current_head_coach ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "american_football.football_team.current_head_coach"
    ]
  },
  {
    "question": "what is jamie spears baby name",
    "question_entity": "m.0p52s",
    "question_entity_name": "Jamie Lynn Spears",
    "answer_entities": [
      "m.07zq7jk"
    ],
    "answer_entity_names": [
      "Maddie Briann Aldridge"
    ],
    "hop": 1,
    "qid": "WebQTest-1156",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0p52s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0p52s ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what is the new movie john carter about",
    "question_entity": "m.03whyr",
    "question_entity_name": "John Carter",
    "answer_entities": [
      "m.01hmnh",
      "m.02kdv5l",
      "m.03k9fj",
      "m.06n90"
    ],
    "answer_entity_names": [
      "Fantasy",
      "Action Film",
      "Adventure Film",
      "Science Fiction"
    ],
    "hop": 1,
    "qid": "WebQTest-780",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03whyr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03whyr ns:film.film.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film.genre"
    ]
  },
  {
    "question": "where is french spoken most",
    "question_entity": "m.064_8sq",
    "question_entity_name": "French",
    "answer_entities": [
      "m.0154j",
      "m.0162v",
      "m.0164v",
      "m.01699",
      "m.0169t",
      "m.01n6c",
      "m.01nln",
      "m.01nyl",
      "m.01p1b",
      "m.01ppq",
      "m.01rxw",
      "m.01xbgx",
      "m.027jk",
      "m.027nb",
      "m.02kcz",
      "m.03_xj",
      "m.03548",
      "m.03676",
      "m.03c8mkv",
      "m.03gk2",
      "m.03gyl",
      "m.04g61",
      "m.04hhv",
      "m.04hqz",
      "m.04sj3",
      "m.04v09",
      "m.04vg8",
      "m.04vs9",
      "m.04w58",
      "m.04wgh",
      "m.05cc1",
      "m.0697s",
      "m.06dfg",
      "m.06mzp",
      "m.06srk",
      "m.06sw9",
      "m.07fj_",
      "m.07ytt",
      "m.07z5n",
      "m.0f8l9c",
      "m.0fv4v",
      "m.0g8bw",
      "m.0h3y"
    ],
    "answer_entity_names": [
      "Belgium",
      "Barbados",
      "Benin",
      "Burkina Faso",
      "Burundi",
      "Comoros",
      "Cameroon",
      "Central African Republic",
      "Chad",
      "Cyprus",
      "Congo",
      "Cambodia",
      "Djibouti",
      "Dominica",
      "Equatorial Guinea",
      "Jersey",
      "Gabon",
      "Guinea",
      "Habsburg Netherlands",
      "Holy Roman Empire",
      "Haiti",
      "Luxembourg",
      "Laos",
      "Lebanon",
      "Madagascar",
      "Mali",
      "Martinique",
      "Mauritius",
      "Monaco",
      "Morocco",
      "Niger",
      "Qatar",
      "Rwanda",
      "Switzerland",
      "Senegal",
      "Seychelles",
      "Tunisia",
      "Vatican City",
      "Vanuatu",
      "France",
      "Ivory Coast",
      "South Vietnam",
      "Algeria"
    ],
    "hop": 1,
    "qid": "WebQTest-700",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.064_8sq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.064_8sq ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "what time zone is pennsylvania in right now",
    "question_entity": "m.05tbn",
    "question_entity_name": "Pennsylvania",
    "answer_entities": [
      "m.02_37z",
      "m.02hcv8"
    ],
    "answer_entity_names": [
      "UTC−05:00",
      "Eastern Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1176",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tbn ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "where is nineveh city",
    "question_entity": "m.05fym",
    "question_entity_name": "Nineveh",
    "answer_entities": [
      "m.01chdh",
      "m.0d05q4"
    ],
    "answer_entity_names": [
      "Nineveh Governorate",
      "Iraq"
    ],
    "hop": 1,
    "qid": "WebQTest-1248",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fym)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fym ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where is jay leno from",
    "question_entity": "m.046lt",
    "question_entity_name": "Jay Leno",
    "answer_entities": [
      "m.0yc84"
    ],
    "answer_entity_names": [
      "New Rochelle"
    ],
    "hop": 1,
    "qid": "WebQTest-104",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.046lt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.046lt ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what is the capital of italy today",
    "question_entity": "m.03rjj",
    "question_entity_name": "Italy",
    "answer_entities": [
      "m.06c62"
    ],
    "answer_entity_names": [
      "Rome"
    ],
    "hop": 1,
    "qid": "WebQTest-1189",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rjj ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "what type of sports do japanese play",
    "question_entity": "m.03_3d",
    "question_entity_name": "Japan",
    "answer_entities": [
      "m.02ppd68",
      "m.02rkd3c",
      "m.03xh50",
      "m.05p71j1",
      "m.09gqcv",
      "m.0f9d97",
      "m.0qfps15",
      "m.0t_dl1j"
    ],
    "answer_entity_names": [
      "Japan women's national volleyball team",
      "Japan men's national volleyball team",
      "Japan national football team",
      "Japan women's national handball team",
      "Japan national baseball team",
      "Japan national handball team",
      "Bridgestone-Anchor",
      "Burning"
    ],
    "hop": 1,
    "qid": "WebQTest-281",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_3d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_3d ns:sports.sports_team_location.teams ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team_location.teams"
    ]
  },
  {
    "question": "what did bernie mac died of",
    "question_entity": "m.02lj6p",
    "question_entity_name": "Bernie Mac",
    "answer_entities": [
      "m.01q5y6",
      "m.0p367zp"
    ],
    "answer_entity_names": [
      "Sarcoidosis",
      "Complications from pneumonia"
    ],
    "hop": 1,
    "qid": "WebQTest-1688",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lj6p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lj6p ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "who did cher have a son with",
    "question_entity": "m.01vtj38",
    "question_entity_name": "Cher",
    "answer_entities": [
      "m.02jg92",
      "m.06wmp"
    ],
    "answer_entity_names": [
      "Gregg Allman",
      "Sonny Bono"
    ],
    "hop": 1,
    "qid": "WebQTest-1480",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.01vtj38 ns:people.person.children ?y .\n\t?y ns:people.person.gender ns:m.05zppz . #Male\n\t?y ns:people.person.parents ?x .\n  FILTER (?x != ns:m.01vtj38)\n}",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "where the missouri river ends",
    "question_entity": "m.04ykz",
    "question_entity_name": "Missouri River",
    "answer_entities": [
      "m.04yf_"
    ],
    "answer_entity_names": [
      "Mississippi River"
    ],
    "hop": 1,
    "qid": "WebQTest-180",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ykz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ykz ns:geography.river.mouth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "geography.river.mouth"
    ]
  },
  {
    "question": "what are the two official languages of paraguay",
    "question_entity": "m.05v10",
    "question_entity_name": "Paraguay",
    "answer_entities": [
      "m.06nm1",
      "m.0k3pq"
    ],
    "answer_entity_names": [
      "Spanish Language",
      "Paraguayan Guaraní"
    ],
    "hop": 1,
    "qid": "WebQTest-393",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v10 ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what is jacksonville fl timezone",
    "question_entity": "m.0ggh3",
    "question_entity_name": "Jacksonville",
    "answer_entities": [
      "m.02hcv8"
    ],
    "answer_entity_names": [
      "Eastern Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1046",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ggh3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ggh3 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what types of art did andy warhol do",
    "question_entity": "m.0kc6",
    "question_entity_name": "Andy Warhol",
    "answer_entities": [
      "m.015r61",
      "m.0q4mn"
    ],
    "answer_entity_names": [
      "Modern art",
      "Pop art"
    ],
    "hop": 1,
    "qid": "WebQTest-856",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kc6 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "where is auburn university located",
    "question_entity": "m.01wdj_",
    "question_entity_name": "Auburn University",
    "answer_entities": [
      "m.06_g97h",
      "m.09c7w0",
      "m.0gyh",
      "m.0q8p8"
    ],
    "answer_entity_names": [
      "Auburn University Historic District",
      "United States of America",
      "Alabama",
      "Auburn"
    ],
    "hop": 1,
    "qid": "WebQTest-1669",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wdj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wdj_ ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what county is kansas city kansas",
    "question_entity": "m.0tcj6",
    "question_entity_name": "Kansas City",
    "answer_entities": [
      "m.0nnyr"
    ],
    "answer_entity_names": [
      "Wyandotte County"
    ],
    "hop": 1,
    "qid": "WebQTest-56",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0tcj6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0tcj6 ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what book did tupac write",
    "question_entity": "m.07pzc",
    "question_entity_name": "Tupac Shakur",
    "answer_entities": [
      "m.04xl32f",
      "m.04xl335",
      "m.04xl36z",
      "m.04xl38k",
      "m.04xl391"
    ],
    "answer_entity_names": [
      "The Rose That Grew from Concrete",
      "The rose that grew from concrete",
      "Tupac",
      "Tupac",
      "Tupac"
    ],
    "hop": 1,
    "qid": "WebQTest-382",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:book.author.book_editions_published ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.author.book_editions_published"
    ]
  },
  {
    "question": "what team did peyton manning 's dad play for",
    "question_entity": "m.027jv8",
    "question_entity_name": "Peyton Manning",
    "answer_entities": [
      "m.03gqb0k",
      "m.04nmxtk",
      "m.051q5",
      "m.05g3v"
    ],
    "answer_entity_names": [
      "Ole Miss Rebels football",
      "Houston Oilers",
      "Minnesota Vikings",
      "New Orleans Saints"
    ],
    "hop": 1,
    "qid": "WebQTest-1348",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027jv8 ns:people.person.parents ?y .\n?y ns:people.person.gender ns:m.05zppz . #Male\n?y ns:sports.pro_athlete.teams ?z .\n?z ns:sports.sports_team_roster.team ?x .\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "where did venus williams come from",
    "question_entity": "m.016cff",
    "question_entity_name": "Venus Williams",
    "answer_entities": [
      "m.0r0ls"
    ],
    "answer_entity_names": [
      "Lynwood"
    ],
    "hop": 1,
    "qid": "WebQTest-468",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016cff)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016cff ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where did tim tebow grow up",
    "question_entity": "m.0g7km1",
    "question_entity_name": "Tim Tebow",
    "answer_entities": [
      "m.01dvzy"
    ],
    "answer_entity_names": [
      "Makati"
    ],
    "hop": 1,
    "qid": "WebQTest-617",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g7km1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g7km1 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what state is the steelers from",
    "question_entity": "m.05tfm",
    "question_entity_name": "Pittsburgh Steelers",
    "answer_entities": [
      "m.068p2"
    ],
    "answer_entity_names": [
      "Pittsburgh"
    ],
    "hop": 1,
    "qid": "WebQTest-395",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.sports_team.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.location"
    ]
  },
  {
    "question": "where were the seneca indians located",
    "question_entity": "m.028yj0",
    "question_entity_name": "Seneca people",
    "answer_entities": [
      "m.059rby",
      "m.05kr_"
    ],
    "answer_entity_names": [
      "New York",
      "Ontario"
    ],
    "hop": 1,
    "qid": "WebQTest-227",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.028yj0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.028yj0 ns:people.ethnicity.geographic_distribution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.geographic_distribution"
    ]
  },
  {
    "question": "what did dr. seuss do",
    "question_entity": "m.02g3w",
    "question_entity_name": "Theodore Lesieg",
    "answer_entities": [
      "m.015h31",
      "m.0196pc",
      "m.01d_h8",
      "m.020xn5",
      "m.03gjzk",
      "m.03hz6vv",
      "m.05z96",
      "m.0cbd2",
      "m.0dxtg",
      "m.0n1h",
      "m.0nbcg"
    ],
    "answer_entity_names": [
      "Animator",
      "Cartoonist",
      "Film Producer",
      "Illustrator",
      "Television producer",
      "Visual Artist",
      "Poet",
      "Writer",
      "Screenwriter",
      "Artist",
      "Songwriter"
    ],
    "hop": 1,
    "qid": "WebQTest-190",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02g3w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02g3w ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "when was taylor swift fearless tour",
    "question_entity": "m.06w493d",
    "question_entity_name": "Fearless Tour",
    "answer_entities": [
      "2009-04-23"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1149",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w493d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w493d ns:time.event.start_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.start_date"
    ]
  },
  {
    "question": "what are the songs that justin bieber wrote",
    "question_entity": "m.06w2sn5",
    "question_entity_name": "Justin Bieber",
    "answer_entities": [
      "m.0116pj4q",
      "m.012k_48s",
      "m.09v3gb4",
      "m.0bbvzq2",
      "m.0bbz4p9",
      "m.0bmc2ql",
      "m.0c3vvnk",
      "m.0fqlv5l",
      "m.0g5b0p2",
      "m.0g5q9ky",
      "m.0j4453t",
      "m.0j64n8c",
      "m.0jwqwyx",
      "m.0jwx2_w",
      "m.0jxk_hq",
      "m.0jxk_kq",
      "m.0jxkzb9",
      "m.0k0l2vf",
      "m.0qfpkqq",
      "m.0rytzvz",
      "m.0y6b7k5",
      "m.0ynrkyl",
      "m.0yt1lb9",
      "m.0yt3yyw",
      "m.0yt3zg2",
      "m.0z6sgcx",
      "m.0zbv_v0",
      "m.0zdkrym",
      "m.0zg6nnd",
      "m.0zgb5ny",
      "m.0zmzvrc"
    ],
    "answer_entity_names": [
      "Lolly",
      "Home to Mama",
      "Baby",
      "Never Let You Go",
      "Eenie Meenie",
      "Somebody to Love",
      "Never Say Never",
      "Bigger",
      "Pray",
      "First Dance",
      "Live My Life",
      "Boyfriend",
      "Turn to You (Mother's Day Dedication)",
      "Die in Your Arms",
      "Thought Of You",
      "Beauty And A Beat",
      "All Around The World",
      "As Long as You Love Me",
      "Right Here",
      "#thatPower",
      "Heartbreaker",
      "All That Matters",
      "Hold Tight",
      "Wait for a Minute",
      "Recovery",
      "Bad Day",
      "All Bad",
      "PYD",
      "Change Me",
      "Roller Coaster",
      "Confident"
    ],
    "hop": 1,
    "qid": "WebQTest-42",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w2sn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w2sn5 ns:music.composer.compositions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.composer.compositions"
    ]
  },
  {
    "question": "what is john edwards indicted for",
    "question_entity": "m.01651q",
    "question_entity_name": "John Edwards",
    "answer_entities": [
      "m.0hj49"
    ],
    "answer_entity_names": [
      "Political corruption"
    ],
    "hop": 2,
    "qid": "WebQTest-1789",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01651q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01651q ns:base.crime.acquitted_person.acquittal ?y .\n?y ns:base.crime.acquittal.crime_type ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.crime.acquitted_person.acquittal",
      "base.crime.acquittal.crime_type"
    ]
  },
  {
    "question": "what religion was king louis xiv",
    "question_entity": "m.04pwg",
    "question_entity_name": "Louis XIV of France",
    "answer_entities": [
      "m.0c8wxp"
    ],
    "answer_entity_names": [
      "Catholicism"
    ],
    "hop": 1,
    "qid": "WebQTest-1614",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04pwg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04pwg ns:people.person.religion ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.religion"
    ]
  },
  {
    "question": "what is my timezone in louisiana",
    "question_entity": "m.04ly1",
    "question_entity_name": "Louisiana",
    "answer_entities": [
      "m.02fqwt"
    ],
    "answer_entity_names": [
      "Central Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-19",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ly1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ly1 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what are the four main languages spoken in spain",
    "question_entity": "m.06mkj",
    "question_entity_name": "Spain",
    "answer_entities": [
      "m.017k6",
      "m.01m69",
      "m.01q5d9",
      "m.05l0r",
      "m.06nm1"
    ],
    "answer_entity_names": [
      "Basque Language",
      "Catalan language",
      "Galician Language",
      "Occitan language",
      "Spanish Language"
    ],
    "hop": 1,
    "qid": "WebQTest-138",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mkj ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what was james garfield most known for",
    "question_entity": "m.0b22w",
    "question_entity_name": "James A. Garfield",
    "answer_entities": [
      "m.01xljv7"
    ],
    "answer_entity_names": [
      "US President"
    ],
    "hop": 2,
    "qid": "WebQTest-528",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b22w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b22w ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.object ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "common.topic.notable_for",
      "common.notable_for.object"
    ]
  }
]