[
  {
    "question": "which political party does barack obama represent",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.0d075m"
    ],
    "answer_entity_names": [
      "Democratic Party"
    ],
    "hop": 2,
    "qid": "WebQTest-719",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.politician.party",
      "government.political_party_tenure.party"
    ]
  },
  {
    "question": "what county is st paul nc in",
    "question_entity": "m.0yk9v",
    "question_entity_name": "St. Pauls",
    "answer_entities": [
      "m.0n3s6"
    ],
    "answer_entity_names": [
      "Robeson County"
    ],
    "hop": 1,
    "qid": "WebQTest-898",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yk9v ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what team did aguero play for",
    "question_entity": "m.099vgz",
    "question_entity_name": "Sergio Agüero",
    "answer_entities": [
      "m.01634x",
      "m.02bh_v",
      "m.047yd6",
      "m.0lg7v"
    ],
    "answer_entity_names": [
      "Manchester City F.C.",
      "Argentina national football team",
      "Club Atlético Independiente",
      "Atlético Madrid"
    ],
    "hop": 2,
    "qid": "WebQTest-680",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.099vgz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.099vgz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "who is angelina jolie mom and dad",
    "question_entity": "m.0f4vbz",
    "question_entity_name": "Angelina Jolie",
    "answer_entities": [
      "m.01mqgf",
      "m.046qq"
    ],
    "answer_entity_names": [
      "Marcheline Bertrand",
      "Jon Voight"
    ],
    "hop": 1,
    "qid": "WebQTest-757",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f4vbz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f4vbz ns:people.person.parents ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "who became president when henry harrison died",
    "question_entity": "m.0835q",
    "question_entity_name": "William Henry Harrison",
    "answer_entities": [
      "m.042dk"
    ],
    "answer_entity_names": [
      "John Tyler"
    ],
    "hop": 1,
    "qid": "WebQTest-789",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0835q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0835q ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.us_president.vice_president"
    ]
  },
  {
    "question": "what there to do in salt lake city utah",
    "question_entity": "m.0f2r6",
    "question_entity_name": "Salt Lake City",
    "answer_entities": [
      "g.121xqqc4",
      "m.01626x",
      "m.0268k69",
      "m.02x5d6c",
      "m.02z2sd8",
      "m.034zn4",
      "m.034zsf",
      "m.048fms",
      "m.04p9dd",
      "m.05qp9q",
      "m.06mp6_",
      "m.0b6mxyf",
      "m.0cgn__",
      "m.0cnsp",
      "m.0h231z"
    ],
    "answer_entity_names": [
      "Zion National Park",
      "Days of '47 Parade",
      "Discovery Gateway",
      "Church History Museum",
      "Salt Lake Temple",
      "Temple Square",
      "Salt Lake City Public Library",
      "Trolley Square",
      "Red Butte Garden and Arboretum",
      "Clark Planetarium",
      "Antelope Island State Park",
      "Sugar House Park",
      "Bryce Canyon National Park",
      "Hogle Zoo"
    ],
    "hop": 1,
    "qid": "WebQTest-1405",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2r6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2r6 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "where was caesar when he was stabbed",
    "question_entity": "m.041wm",
    "question_entity_name": "Julius Caesar",
    "answer_entities": [
      "m.05l4p5"
    ],
    "answer_entity_names": [
      "Theatre of Pompey"
    ],
    "hop": 1,
    "qid": "WebQTest-970",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041wm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041wm ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what capital city of brazil",
    "question_entity": "m.015fr",
    "question_entity_name": "Brazil",
    "answer_entities": [
      "m.01hy_"
    ],
    "answer_entity_names": [
      "Brasília"
    ],
    "hop": 1,
    "qid": "WebQTest-1455",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015fr ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "who was carolus linnaeus",
    "question_entity": "m.01lwd",
    "question_entity_name": "Carl Linnaeus",
    "answer_entities": [
      "m.02h6p1f",
      "m.05t4q",
      "m.06q2q",
      "m.07lqg0"
    ],
    "answer_entity_names": [
      "Botanist",
      "Physician",
      "Scientist",
      "Biologist"
    ],
    "hop": 1,
    "qid": "WebQTest-294",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwd ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where was st. lucy born",
    "question_entity": "m.01r0zd",
    "question_entity_name": "Saint Lucy",
    "answer_entities": [
      "m.071bn"
    ],
    "answer_entity_names": [
      "Syracuse"
    ],
    "hop": 1,
    "qid": "WebQTest-492",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r0zd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r0zd ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what country did magellan represent",
    "question_entity": "m.033ky",
    "question_entity_name": "Ferdinand Magellan",
    "answer_entities": [
      "m.0285m87"
    ],
    "answer_entity_names": [
      "Kingdom of Portugal"
    ],
    "hop": 1,
    "qid": "WebQTest-419",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033ky)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033ky ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "where did the battle of passchendaele happen",
    "question_entity": "m.0c3mz",
    "question_entity_name": "Battle of Passchendaele",
    "answer_entities": [
      "m.02pb6l5",
      "m.02y4t"
    ],
    "answer_entity_names": [
      "Passendale",
      "Flanders"
    ],
    "hop": 1,
    "qid": "WebQTest-1261",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c3mz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c3mz ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what form of government does north korea have",
    "question_entity": "m.05b7q",
    "question_entity_name": "North Korea",
    "answer_entities": [
      "m.01gt0n",
      "m.025tbxf",
      "m.0py4y"
    ],
    "answer_entity_names": [
      "Juche",
      "Socialist state",
      "Single-party state"
    ],
    "hop": 1,
    "qid": "WebQTest-672",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b7q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b7q ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what are all the countries in north africa",
    "question_entity": "m.05g2v",
    "question_entity_name": "North Africa",
    "answer_entities": [
      "m.02jbz2",
      "m.02vkl1t",
      "m.02wvgjs",
      "m.04q7yp",
      "m.06frc",
      "m.06tw8",
      "m.0c75f"
    ],
    "answer_entity_names": [
      "Western Roman Empire",
      "Ptolemaic Kingdom",
      "Rashidun Caliphate",
      "Caliphate of Córdoba",
      "Roman Republic",
      "Sudan",
      "United Arab Republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1563",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g2v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g2v ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.contains"
    ]
  },
  {
    "question": "what school did michael jordan attend",
    "question_entity": "m.054c1",
    "question_entity_name": "Michael Jordan",
    "answer_entities": [
      "m.07qymj",
      "m.0bx8pn"
    ],
    "answer_entity_names": [
      "Emsley A. Laney High School",
      "University of North Carolina at Chapel Hill"
    ],
    "hop": 2,
    "qid": "WebQTest-377",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what government does new zealand have",
    "question_entity": "m.0ctw_b",
    "question_entity_name": "New Zealand",
    "answer_entities": [
      "m.018wl5",
      "m.01fpfn",
      "m.01q20"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Unitary state",
      "Constitutional monarchy"
    ],
    "hop": 1,
    "qid": "WebQTest-665",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ctw_b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ctw_b ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where is tyrese gibson from",
    "question_entity": "m.01l1b90",
    "question_entity_name": "Tyrese Gibson",
    "answer_entities": [
      "m.027sp2"
    ],
    "answer_entity_names": [
      "Watts"
    ],
    "hop": 1,
    "qid": "WebQTest-210",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l1b90)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l1b90 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "who wrote the gospel according to john",
    "question_entity": "m.038vs",
    "question_entity_name": "Gospel of John",
    "answer_entities": [
      "m.046_b"
    ],
    "answer_entity_names": [
      "John the Evangelist"
    ],
    "hop": 1,
    "qid": "WebQTest-658",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.038vs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.038vs ns:book.written_work.author ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.written_work.author"
    ]
  },
  {
    "question": "what county is san antonio in",
    "question_entity": "m.0f2w0",
    "question_entity_name": "San Antonio",
    "answer_entities": [
      "m.0ms5v"
    ],
    "answer_entity_names": [
      "Comal County"
    ],
    "hop": 1,
    "qid": "WebQTest-634",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2w0 ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what is carlos pena jr nationality",
    "question_entity": "m.05c95x",
    "question_entity_name": "Carlos Peña",
    "answer_entities": [
      "m.027rn"
    ],
    "answer_entity_names": [
      "Dominican Republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1716",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05c95x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05c95x ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "what city is acadia university in",
    "question_entity": "m.0xxc",
    "question_entity_name": "Acadia University",
    "answer_entities": [
      "m.084vj"
    ],
    "answer_entity_names": [
      "Wolfville"
    ],
    "hop": 2,
    "qid": "WebQTest-1751",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xxc ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what jobs did robert burns have",
    "question_entity": "m.09482",
    "question_entity_name": "Robert Burns",
    "answer_entities": [
      "m.05z96",
      "m.0cbd2",
      "m.0knj1",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Poet",
      "Writer",
      "Bard",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-1389",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09482)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09482 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who is sir james dyson",
    "question_entity": "m.0209vm",
    "question_entity_name": "James Dyson",
    "answer_entities": [
      "m.01c979",
      "m.02xhgy6",
      "m.03sbb",
      "m.09j9h"
    ],
    "answer_entity_names": [
      "Designer",
      "Industrial designer",
      "Inventor",
      "Engineer"
    ],
    "hop": 1,
    "qid": "WebQTest-885",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0209vm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0209vm ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what industry does walmart operate in",
    "question_entity": "m.0841v",
    "question_entity_name": "Walmart",
    "answer_entities": [
      "m.0191_7",
      "m.01k_mv",
      "m.03qtgrv"
    ],
    "answer_entity_names": [
      "Retail",
      "Department store",
      "Variety Stores"
    ],
    "hop": 1,
    "qid": "WebQTest-442",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0841v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0841v ns:business.business_operation.industry ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "business.business_operation.industry"
    ]
  },
  {
    "question": "where did mario lopez go to school",
    "question_entity": "m.02w5q6",
    "question_entity_name": "Mario Lopez",
    "answer_entities": [
      "m.0h0sx6"
    ],
    "answer_entity_names": [
      "Chula Vista High School"
    ],
    "hop": 2,
    "qid": "WebQTest-1177",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02w5q6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02w5q6 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what are italians classified as",
    "question_entity": "m.0222qb",
    "question_entity_name": "Italian people",
    "answer_entities": [
      "m.03rkmh",
      "m.043_yvy"
    ],
    "answer_entity_names": [
      "Latin European peoples",
      "Europeans"
    ],
    "hop": 1,
    "qid": "WebQTest-1030",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0222qb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0222qb ns:people.ethnicity.included_in_group ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.included_in_group"
    ]
  },
  {
    "question": "who plays voldemort",
    "question_entity": "m.0c8lv",
    "question_entity_name": "Lord Voldemort",
    "answer_entities": [
      "m.0170qf",
      "m.0414vty",
      "m.04gw9xr",
      "m.06_4v9",
      "m.071yrz"
    ],
    "answer_entity_names": [
      "Ralph Fiennes",
      "Frank Dillane",
      "Hero Fiennes-Tiffin",
      "Christian Coulson",
      "Richard Bremmer"
    ],
    "hop": 2,
    "qid": "WebQTest-927",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8lv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8lv ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "what is the currency used in italy",
    "question_entity": "m.03rjj",
    "question_entity_name": "Italy",
    "answer_entities": [
      "m.02l6h"
    ],
    "answer_entity_names": [
      "Euro"
    ],
    "hop": 1,
    "qid": "WebQTest-202",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rjj ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "where do florida panthers play",
    "question_entity": "m.0j8js",
    "question_entity_name": "Florida Panthers",
    "answer_entities": [
      "m.038hc3",
      "m.039xlz"
    ],
    "answer_entity_names": [
      "BB&T Center",
      "Miami Arena"
    ],
    "hop": 1,
    "qid": "WebQTest-1557",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j8js)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j8js ns:sports.sports_team.arena_stadium ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.arena_stadium"
    ]
  },
  {
    "question": "who is judy garland father",
    "question_entity": "m.0g10g",
    "question_entity_name": "Judy Garland",
    "answer_entities": [
      "m.0gyhn8m"
    ],
    "answer_entity_names": [
      "Francis Avent Gumm"
    ],
    "hop": 1,
    "qid": "WebQTest-1354",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g10g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g10g ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what are the colors of the ny giants",
    "question_entity": "m.05gg4",
    "question_entity_name": "New York Giants",
    "answer_entities": [
      "m.01g5v",
      "m.036k5h",
      "m.06fvc",
      "m.083jv"
    ],
    "answer_entity_names": [
      "Blue",
      "Grey",
      "Red",
      "White"
    ],
    "hop": 1,
    "qid": "WebQTest-1233",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gg4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gg4 ns:sports.sports_team.colors ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.colors"
    ]
  },
  {
    "question": "what school did karl benz go to",
    "question_entity": "m.049xg",
    "question_entity_name": "Karl Benz",
    "answer_entities": [
      "m.0fhr05"
    ],
    "answer_entity_names": [
      "Karlsruhe Institute of Technology"
    ],
    "hop": 2,
    "qid": "WebQTest-286",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049xg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049xg ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what kind of government does libya have today",
    "question_entity": "m.04gqr",
    "question_entity_name": "Libya",
    "answer_entities": [
      "m.02tz3y",
      "m.0glnsx"
    ],
    "answer_entity_names": [
      "Provisional government",
      "Parliamentary republic"
    ],
    "hop": 1,
    "qid": "WebQTest-296",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04gqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04gqr ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where did the anasazi indians live",
    "question_entity": "m.0lyq",
    "question_entity_name": "Ancestral Puebloans",
    "answer_entities": [
      "m.027v6g"
    ],
    "answer_entity_names": [
      "Four Corners"
    ],
    "hop": 1,
    "qid": "WebQTest-1204",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lyq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lyq ns:people.ethnicity.geographic_distribution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.geographic_distribution"
    ]
  },
  {
    "question": "what type of cancer did eva peron die from",
    "question_entity": "m.0dltj",
    "question_entity_name": "Eva Perón",
    "answer_entities": [
      "m.0d_bk",
      "m.0qcr0"
    ],
    "answer_entity_names": [
      "Cervical cancer",
      "Cancer"
    ],
    "hop": 1,
    "qid": "WebQTest-1255",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dltj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dltj ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what form of government is the uk",
    "question_entity": "m.07ssc",
    "question_entity_name": "United Kingdom",
    "answer_entities": [
      "m.018wl5",
      "m.01fpfn",
      "m.01q20"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Unitary state",
      "Constitutional monarchy"
    ],
    "hop": 1,
    "qid": "WebQTest-659",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what is the capital of republic of ireland",
    "question_entity": "m.03rt9",
    "question_entity_name": "Republic of Ireland",
    "answer_entities": [
      "m.02cft"
    ],
    "answer_entity_names": [
      "Dublin"
    ],
    "hop": 1,
    "qid": "WebQTest-667",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rt9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rt9 ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "what county is houston tx in",
    "question_entity": "m.03l2n",
    "question_entity_name": "Houston",
    "answer_entities": [
      "m.0fxwx"
    ],
    "answer_entity_names": [
      "Montgomery County"
    ],
    "hop": 1,
    "qid": "WebQTest-783",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03l2n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03l2n ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what country does alaska belong to",
    "question_entity": "m.0hjy",
    "question_entity_name": "Alaska",
    "answer_entities": [
      "m.09c7w0"
    ],
    "answer_entity_names": [
      "United States of America"
    ],
    "hop": 1,
    "qid": "WebQTest-952",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hjy ns:base.biblioness.bibs_location.country ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.biblioness.bibs_location.country"
    ]
  },
  {
    "question": "where is jamarcus russell from",
    "question_entity": "m.0cjcdj",
    "question_entity_name": "JaMarcus Russell",
    "answer_entities": [
      "m.058cm"
    ],
    "answer_entity_names": [
      "Mobile"
    ],
    "hop": 1,
    "qid": "WebQTest-6",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cjcdj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cjcdj ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what tv series did mark harmon star in",
    "question_entity": "m.037gjc",
    "question_entity_name": "Mark Harmon",
    "answer_entities": [
      "m.01fx1l",
      "m.02996d",
      "m.02kk_c",
      "m.02md2d",
      "m.02x6r9",
      "m.03m8sg",
      "m.05c2j5_",
      "m.05p4qwd",
      "m.06yg5s",
      "m.07cgcf9",
      "m.0dl6q1_",
      "m.0g6sm2"
    ],
    "answer_entity_names": [
      "Chicago Hope",
      "Centennial",
      "From the Earth to the Moon",
      "St. Elsewhere",
      "Flamingo Road",
      "NCIS",
      "Eleanor and Franklin: The White House Years",
      "Sam",
      "240-Robert",
      "Charlie Grace",
      "The Dream Merchants",
      "Reasonable Doubts"
    ],
    "hop": 2,
    "qid": "WebQTest-1445",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.037gjc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.037gjc ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_actor.starring_roles",
      "tv.regular_tv_appearance.series"
    ]
  },
  {
    "question": "what made richard hammond famous",
    "question_entity": "m.02508x",
    "question_entity_name": "Richard Hammond",
    "answer_entities": [
      "m.015cjr",
      "m.01tkqy",
      "m.03gjzk",
      "m.08z956",
      "m.0cbd2",
      "m.0d8qb",
      "m.0dxtg",
      "m.0kyk",
      "m.0np9r"
    ],
    "answer_entity_names": [
      "Presenter",
      "Stunt Performer",
      "Television producer",
      "Radio personality",
      "Writer",
      "Journalist",
      "Screenwriter",
      "Author",
      "Voice Actor"
    ],
    "hop": 1,
    "qid": "WebQTest-1853",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02508x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02508x ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what concentration camp did anne frank died in",
    "question_entity": "m.03d9rk",
    "question_entity_name": "Anne Frank",
    "answer_entities": [
      "m.0139dh"
    ],
    "answer_entity_names": [
      "Bergen-Belsen concentration camp"
    ],
    "hop": 1,
    "qid": "WebQTest-1057",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d9rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d9rk ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what did albert speer design",
    "question_entity": "m.0l4t",
    "question_entity_name": "Albert Speer",
    "answer_entities": [
      "m.03js7d",
      "m.04j99j",
      "m.06cwrf",
      "m.06ft3z"
    ],
    "answer_entity_names": [
      "Olympiastadion",
      "Reich Chancellery",
      "Deutsches Stadion",
      "Volkshalle"
    ],
    "hop": 1,
    "qid": "WebQTest-352",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0l4t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0l4t ns:architecture.architect.structures_designed ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "architecture.architect.structures_designed"
    ]
  }
]