[
  {
    "question": "what movies queen latifah is in",
    "question_entity": "m.01wgcvn",
    "question_entity_name": "Queen Latifah",
    "answer_entities": [
      "g.11bc95kg2q",
      "m.010p_crb",
      "m.01345yx_",
      "m.01370796",
      "m.016f62",
      "m.01cmp9",
      "m.01yzjg",
      "m.027j9wd",
      "m.02b5v3",
      "m.02ntj8",
      "m.02rg6sm",
      "m.02wc6sp",
      "m.02z84b3",
      "m.032knp",
      "m.03c3vl6",
      "m.03cljvq",
      "m.03l6q0",
      "m.04f9bz6",
      "m.04rncw",
      "m.054vql",
      "m.0569lx",
      "m.05bzxn0",
      "m.05p46dv",
      "m.05rkmv",
      "m.05zynv8",
      "m.06_wqk4",
      "m.060p1m",
      "m.06bks2",
      "m.06fwns",
      "m.06n95j",
      "m.07_3vm",
      "m.0729rh",
      "m.07kbj2s",
      "m.07nt4j",
      "m.08qsz2",
      "m.08w51z",
      "m.0bm2nq",
      "m.0bt3j9",
      "m.0bvpwc6",
      "m.0c3_662",
      "m.0crt91p",
      "m.0crv_pd",
      "m.0crvchf",
      "m.0crvfd7",
      "m.0crw1rn",
      "m.0crw75p",
      "m.0crxknq",
      "m.0cryhb4",
      "m.0cs2r3l",
      "m.0cs45fr",
      "m.0cs85c7",
      "m.0ds27b",
      "m.0fpgp26",
      "m.0g54bw9",
      "m.0gym9j6",
      "m.0j24hls",
      "m.0j72nq9",
      "m.0kvh49",
      "m.0v_w91n"
    ],
    "answer_entity_names": [
      "Kung Faux: Vol. 4",
      "Bessie",
      "Barbershop 3",
      "Jungle Fever",
      "Chicago",
      "Bringing Out the Dead",
      "Ice Age: Dawn of the Dinosaurs",
      "Taxi",
      "Barbershop 2: Back in Business",
      "Arctic Tale",
      "Mad Money",
      "Life Support",
      "Set It Off",
      "What Happens in Vegas",
      "The Perfect Holiday",
      "Scary Movie 3",
      "The Secret Life of Bees",
      "Sphere",
      "House Party 2",
      "The Muppets' Wizard of Oz",
      "We Are One: The Obama Inaugural Celebration at the Lincoln Memorial",
      "Hairspray 2: White Lipstick",
      "Beauty Shop",
      "Living with the Dead",
      "Valentine's Day",
      "Hoodlum",
      "The Cookout",
      "The Bone Collector",
      "The Country Bears",
      "Brown Sugar",
      "Ice Age: The Meltdown",
      "Just Wright",
      "Last Holiday",
      "Bringing Down the House",
      "Juice",
      "Stranger than Fiction",
      "Hairspray",
      "Mama Flora's Family",
      "The Dilemma",
      "The Making of What's Going On: An All-Star Tribute",
      "Kung Faux: Vol. 1",
      "We Are Family",
      "Kung Faux: Vol. 3",
      "Breaking Out: The Alcatraz Concert",
      "Kung Faux: Vol. 5",
      "One Love: The Bob Marley All-Star Tribute",
      "Queen Latifah - Unauthorized",
      "Through the Years of Hip-Hop: Vol. 1: Graffiti",
      "Life in the 310: Vol. 3",
      "Kung Faux: Vol. 2",
      "My Life",
      "Ice Age: Continental Drift",
      "Joyful Noise",
      "Zac Efron's Pool Party",
      "Ice Age: A Mammoth Christmas",
      "Steel Magnolias",
      "Living Out Loud",
      "22 Jump Street"
    ],
    "hop": 2,
    "qid": "WebQTest-1096",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wgcvn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wgcvn ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what school did sir ernest rutherford go to",
    "question_entity": "m.02m7r",
    "question_entity_name": "Ernest Rutherford",
    "answer_entities": [
      "m.013tch",
      "m.02722n",
      "m.07tg4",
      "m.07tk7",
      "m.07xpm"
    ],
    "answer_entity_names": [
      "Nelson College",
      "University of New Zealand",
      "University of Cambridge",
      "Trinity College, Cambridge",
      "University of Canterbury"
    ],
    "hop": 2,
    "qid": "WebQTest-205",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02m7r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02m7r ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what did king henry viii rule",
    "question_entity": "m.03p77",
    "question_entity_name": "Henry VIII of England",
    "answer_entities": [
      "m.02jx1"
    ],
    "answer_entity_names": [
      "England"
    ],
    "hop": 1,
    "qid": "WebQTest-585",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p77 ns:royalty.monarch.kingdom ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "royalty.monarch.kingdom"
    ]
  },
  {
    "question": "where did john franklin live",
    "question_entity": "m.06hw0m",
    "question_entity_name": "John Franklin",
    "answer_entities": [
      "m.0s4jk"
    ],
    "answer_entity_names": [
      "Blue Island"
    ],
    "hop": 2,
    "qid": "WebQTest-1972",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06hw0m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06hw0m ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "who is keyshia cole dad",
    "question_entity": "m.01pkxs9",
    "question_entity_name": "Keyshia Cole",
    "answer_entities": [
      "m.0n9hj_f",
      "m.0n9hk0h",
      "m.0wq93rk"
    ],
    "answer_entity_names": [
      "Francine Lons",
      "Leon Cole",
      "Sal Gibson"
    ],
    "hop": 1,
    "qid": "WebQTest-21",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pkxs9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pkxs9 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "where did morgan freeman graduate",
    "question_entity": "m.055c8",
    "question_entity_name": "Morgan Freeman",
    "answer_entities": [
      "m.06kknt",
      "m.0zw3n07"
    ],
    "answer_entity_names": [
      "Los Angeles City College",
      "Pasadena Playhouse"
    ],
    "hop": 2,
    "qid": "WebQTest-291",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055c8 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what are the catholic holy days",
    "question_entity": "m.0c8wxp",
    "question_entity_name": "Catholicism",
    "answer_entities": [
      "m.0_kv0v5",
      "m.0_kvb49",
      "m.0_kvbh6",
      "m.0_l_d7h",
      "m.0_lpd56",
      "m.0_lsyyw",
      "m.0_m1438",
      "m.0_m14vv",
      "m.0_mrbts",
      "m.011ncb1h",
      "m.011ncyv_",
      "m.011nk6vg",
      "m.011nkz4p",
      "m.0148r6",
      "m.016s_l",
      "m.016v69",
      "m.01cqmf",
      "m.01v147",
      "m.03nlrrk",
      "m.0497bm",
      "m.04mrs1",
      "m.04qnzg",
      "m.04sy0c",
      "m.058_lf",
      "m.0581_5",
      "m.05b22_z",
      "m.060_r",
      "m.0604_c",
      "m.0cpnkn",
      "m.0dsq86",
      "m.0f6l2j",
      "m.0fdm1h",
      "m.0k0c",
      "m.0k5y347",
      "m.0n_fbc8"
    ],
    "answer_entity_names": [
      "Feast of St. Margaret of the Árpád House",
      "Feast of Our Lady of Hungary",
      "Feast of Our Lady of the Rosary",
      "Our Lady of Aparecida's day",
      "Father Damien Day",
      "Our Lady of Guadalupe Day",
      "St. Spiridon Day",
      "Saint Nicholas' Eve",
      "Feast of Assumption",
      "Euthymius the Great's Feast Day",
      "The Feast of Our Lady of Mount Carmel",
      "St. Anthony's Day",
      "Feast of Our Lady of Sorrows",
      "St Joseph's Day",
      "Saint Patrick's Day",
      "Maundy Thursday",
      "St. Stephen's Day",
      "Corpus Christi",
      "Nativity of Mary",
      "Olsok",
      "Feast of the Immaculate Conception",
      "Feast of the Cross",
      "Feast of Christ the King",
      "Name day",
      "Fat Thursday",
      "World Day of Peace",
      "Palm Sunday",
      "Saints Cyril and Methodius Day",
      "Solemnity of Mary, Mother of God",
      "Feast of Saints Peter and Paul",
      "St Crispin's Day",
      "St Casimir's Day",
      "All Saints' Day",
      "Feast of St Francis of Assisi",
      "St Nicholas Day"
    ],
    "hop": 1,
    "qid": "WebQTest-1637",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.holidays ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "religion.religion.holidays"
    ]
  },
  {
    "question": "where do the appalachian mountains run through",
    "question_entity": "m.0lm0n",
    "question_entity_name": "Appalachian Mountains",
    "answer_entities": [
      "m.01x73",
      "m.029jpy",
      "m.0498y",
      "m.050ks",
      "m.059f4",
      "m.059rby",
      "m.059s8",
      "m.059t8",
      "m.05fjf",
      "m.05fkf",
      "m.05j49",
      "m.05k7sb",
      "m.05kkh",
      "m.05rh2",
      "m.05tbn",
      "m.0694j",
      "m.06s4c",
      "m.06yxd",
      "m.07_f2",
      "m.07h34",
      "m.07z1m",
      "m.081mh",
      "m.0d0x8",
      "m.0gyh"
    ],
    "answer_entity_names": [
      "Connecticut",
      "New England",
      "Kentucky",
      "Maine",
      "New Hampshire",
      "New York",
      "New Brunswick",
      "Nova Scotia",
      "New Jersey",
      "North Carolina",
      "Newfoundland and Labrador",
      "Massachusetts",
      "Ohio",
      "Prince Edward Island",
      "Pennsylvania",
      "Québec",
      "Saint Pierre and Miquelon",
      "South Carolina",
      "Vermont",
      "Tennessee",
      "Virginia",
      "West Virginia",
      "Georgia",
      "Alabama"
    ],
    "hop": 1,
    "qid": "WebQTest-1675",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lm0n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lm0n ns:location.location.partially_containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.partially_containedby"
    ]
  },
  {
    "question": "where do john lennon die",
    "question_entity": "m.01vsl3_",
    "question_entity_name": "John Lennon",
    "answer_entities": [
      "m.02_286"
    ],
    "answer_entity_names": [
      "New York City"
    ],
    "hop": 1,
    "qid": "WebQTest-805",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what is charlie chaplin famous for",
    "question_entity": "m.01lc5",
    "question_entity_name": "Charlie Chaplin",
    "answer_entities": [
      "m.018gz8",
      "m.01c72t",
      "m.01d_h8",
      "m.02hrh1q",
      "m.02jknp",
      "m.04l1gwb",
      "m.05hj__k",
      "m.0dxtg"
    ],
    "answer_entity_names": [
      "Comedian",
      "Composer",
      "Film Producer",
      "Actor",
      "Film director",
      "Film Score Composer",
      "Film Editor",
      "Screenwriter"
    ],
    "hop": 1,
    "qid": "WebQTest-235",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lc5 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where is holy roman empire located",
    "question_entity": "m.03gk2",
    "question_entity_name": "Holy Roman Empire",
    "answer_entities": [
      "m.02j9z"
    ],
    "answer_entity_names": [
      "Europe"
    ],
    "hop": 1,
    "qid": "WebQTest-1736",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gk2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gk2 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "who plays donna noble",
    "question_entity": "m.02pcf8b",
    "question_entity_name": "Donna Noble",
    "answer_entities": [
      "m.05l0j5"
    ],
    "answer_entity_names": [
      "Catherine Tate"
    ],
    "hop": 2,
    "qid": "WebQTest-165",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pcf8b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pcf8b ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_character.appeared_in_tv_episodes",
      "tv.tv_guest_role.actor"
    ]
  },
  {
    "question": "where is chesapeake bay bridge",
    "question_entity": "m.03xksb",
    "question_entity_name": "Chesapeake Bay Bridge",
    "answer_entities": [
      "m.0dn8b",
      "m.0g834"
    ],
    "answer_entity_names": [
      "Anne Arundel County",
      "Queen Anne's County"
    ],
    "hop": 1,
    "qid": "WebQTest-618",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03xksb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03xksb ns:transportation.bridge.locale ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "transportation.bridge.locale"
    ]
  },
  {
    "question": "what books are written by suzanne collins",
    "question_entity": "m.0bpd5z",
    "question_entity_name": "Suzanne Collins",
    "answer_entities": [
      "m.028x_pw",
      "m.028xx05",
      "m.028y9ks",
      "m.028ydyx",
      "m.04tw_12",
      "m.04twz_3",
      "m.04twzyz",
      "m.04twzzg",
      "m.04twzzx",
      "m.04v_xrh",
      "m.04v_xsg",
      "m.04v_xsq",
      "m.04v_xsz",
      "m.04v_xt6",
      "m.04v_xvj",
      "m.04v_xwy",
      "m.04v8tq8",
      "m.04v9qdx",
      "m.04vdhlv",
      "m.04vdhnl",
      "m.04vdhpk",
      "m.04vt74n",
      "m.04vt75g",
      "m.04vt79f",
      "m.04yl5n0"
    ],
    "answer_entity_names": [
      "Gregor and the Curse of the Warmbloods",
      "Gregor the Overlander",
      "Gregor and the Marks of Secret",
      "Gregor and the Prophecy of Bane",
      "FIRE PROOF",
      "Gregor the Overlander",
      "Gregor and the Code of Claw (Underland Chronicles, Book 5)",
      "When Charlie McButton lost power",
      "The Underland Chronicles Book Three",
      "Gregor the Overlander (Underland Chronicles)",
      "Gregor the Overlander (Underland Chronicles (Sagebrush))",
      "Gregor the Overlander (Underland Chronicles (Turtleback))",
      "Gregor the Overlander",
      "Gregor the Overlander",
      "Gregor The Overlander (Underland Chronicles)",
      "Gregor the Overlander (Underland Chronicles)",
      "Gregor and the curse of the warmbloods",
      "Gregor and the marks of secret",
      "Gregor and the Prophecy of Bane (Underland Chronicles (Paperback))",
      "Gregor and the Prophecy of Bane (Underland Chronicles (Audio))",
      "Gregor and the Prophecy of Bane (Underland Chronicles (Turtleback))",
      "Gregor And The Code Of Claw",
      "Gregor and the Code of Claw (Thorndike Press Large Print Literacy Bridge Series)",
      "Fire Proof",
      "The Hunger Games"
    ],
    "hop": 1,
    "qid": "WebQTest-922",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bpd5z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bpd5z ns:book.author.book_editions_published ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.author.book_editions_published"
    ]
  },
  {
    "question": "what two countries make up the dominican republic",
    "question_entity": "m.027rn",
    "question_entity_name": "Dominican Republic",
    "answer_entities": [],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-974",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.contains"
    ]
  },
  {
    "question": "what time zone is in the bahamas",
    "question_entity": "m.0160w",
    "question_entity_name": "Bahamas",
    "answer_entities": [
      "m.02_37z",
      "m.02hcv8"
    ],
    "answer_entity_names": [
      "UTC−05:00",
      "Eastern Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1195",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what country did the battle of san juan hill take place",
    "question_entity": "m.01tf88",
    "question_entity_name": "Battle of San Juan Hill",
    "answer_entities": [
      "m.01j4rs"
    ],
    "answer_entity_names": [
      "Santiago de Cuba"
    ],
    "hop": 1,
    "qid": "WebQTest-1678",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tf88)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tf88 ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "when did shaq come into the nba",
    "question_entity": "m.012xdf",
    "question_entity_name": "Shaquille O'Neal",
    "answer_entities": [
      "m.06jnjz"
    ],
    "answer_entity_names": [
      "1992 NBA draft"
    ],
    "hop": 2,
    "qid": "WebQTest-1657",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012xdf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012xdf ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.drafted_athlete.drafted",
      "sports.sports_league_draft_pick.draft"
    ]
  },
  {
    "question": "where was toussaint l'ouverture born",
    "question_entity": "m.011wgw",
    "question_entity_name": "Toussaint Louverture",
    "answer_entities": [
      "m.01f5d8"
    ],
    "answer_entity_names": [
      "Saint-Domingue"
    ],
    "hop": 1,
    "qid": "WebQTest-1113",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.011wgw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.011wgw ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where did jrr tolkien go to school",
    "question_entity": "m.041h0",
    "question_entity_name": "J. R. R. Tolkien",
    "answer_entities": [
      "m.025ycq",
      "m.07tgn",
      "m.0b_b0v",
      "m.0ylvj"
    ],
    "answer_entity_names": [
      "King Edward's School, Birmingham",
      "University of Oxford",
      "St. Philip's School",
      "Exeter College, Oxford"
    ],
    "hop": 2,
    "qid": "WebQTest-1817",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041h0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041h0 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what did st. nicholas do in his life",
    "question_entity": "m.0f9q7",
    "question_entity_name": "Saint Nicholas",
    "answer_entities": [
      "m.027k49j"
    ],
    "answer_entity_names": [
      "Bishop"
    ],
    "hop": 1,
    "qid": "WebQTest-1410",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9q7 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what happened to pope john paul ii",
    "question_entity": "m.05yfx",
    "question_entity_name": "Pope John Paul II",
    "answer_entities": [
      "m.0g02vk",
      "m.0gk4g"
    ],
    "answer_entity_names": [
      "Parkinson's disease",
      "heart attack"
    ],
    "hop": 1,
    "qid": "WebQTest-1414",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05yfx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05yfx ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "who or what influenced frank lloyd wright",
    "question_entity": "m.02wlk",
    "question_entity_name": "Frank Lloyd Wright",
    "answer_entities": [
      "m.01cqpy",
      "m.01whq3q",
      "m.06jmjj",
      "m.08304",
      "m.0bwx3",
      "m.0bybqwn",
      "m.0dvns"
    ],
    "answer_entity_names": [
      "Ebenezer Howard",
      "Georges I. Gurdjieff and Thomas De Hartmann",
      "Bruce Price",
      "William Morris",
      "Henry David Thoreau",
      "Elizabeth Gordon",
      "Louis Sullivan"
    ],
    "hop": 1,
    "qid": "WebQTest-1733",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wlk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wlk ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "where is the riviera casino",
    "question_entity": "m.05vv6l",
    "question_entity_name": "Riviera",
    "answer_entities": [
      "m.0cv3w"
    ],
    "answer_entity_names": [
      "Las Vegas"
    ],
    "hop": 1,
    "qid": "WebQTest-787",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05vv6l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05vv6l ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where is midlothian scotland",
    "question_entity": "m.011w8v",
    "question_entity_name": "Midlothian",
    "answer_entities": [
      "m.06q1r",
      "m.07ssc",
      "m.0hzc9md"
    ],
    "answer_entity_names": [
      "Scotland",
      "United Kingdom",
      "United Kingdom, with Dependencies and Territories"
    ],
    "hop": 1,
    "qid": "WebQTest-1792",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.011w8v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.011w8v ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what language do the maasai speak",
    "question_entity": "m.054vv",
    "question_entity_name": "Maasai people",
    "answer_entities": [
      "m.064kl7"
    ],
    "answer_entity_names": [
      "Maasai Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1672",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054vv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054vv ns:people.ethnicity.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.languages_spoken"
    ]
  },
  {
    "question": "which ocean does the zambezi river flow into",
    "question_entity": "m.0p_70",
    "question_entity_name": "Zambezi",
    "answer_entities": [
      "m.03rz4"
    ],
    "answer_entity_names": [
      "Indian Ocean"
    ],
    "hop": 1,
    "qid": "WebQTest-2025",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0p_70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0p_70 ns:geography.river.mouth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "geography.river.mouth"
    ]
  },
  {
    "question": "what was obama 's former occupation",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.04gc2",
      "m.0cbd2",
      "m.0fj9f",
      "m.0fz465",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Lawyer",
      "Writer",
      "Politician",
      "Law professor",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-1591",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where is mali located",
    "question_entity": "m.04v09",
    "question_entity_name": "Mali",
    "answer_entities": [
      "m.0dg3n1"
    ],
    "answer_entity_names": [
      "Africa"
    ],
    "hop": 1,
    "qid": "WebQTest-1531",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v09)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v09 ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  },
  {
    "question": "who were king henry vii children",
    "question_entity": "m.03p6r",
    "question_entity_name": "Henry VII of England",
    "answer_entities": [
      "m.0183g3",
      "m.02p4twb",
      "m.03p77",
      "m.04_p57",
      "m.04yss8",
      "m.05c8kk",
      "m.0btnbg",
      "m.0c3yxg0",
      "m.0j83d",
      "m.0j8jc"
    ],
    "answer_entity_names": [
      "Arthur, Prince of Wales",
      "Edward Tudor",
      "Henry VIII of England",
      "Katherine Tudor",
      "Elizabeth Tudor",
      "Edmund Tudor, Duke of Somerset",
      "Edward Tudor",
      "Roland de Velville",
      "Mary Tudor, Queen of France",
      "Margaret Tudor"
    ],
    "hop": 1,
    "qid": "WebQTest-1048",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p6r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p6r ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "who did george w. bush run against for the second term",
    "question_entity": "m.09b6zr",
    "question_entity_name": "George W. Bush",
    "answer_entities": [
      "m.033tf9",
      "m.03vyyd",
      "m.06dnh",
      "m.0d3qd0"
    ],
    "answer_entity_names": [
      "Michael Peroutka",
      "Gene Amondson",
      "Ralph Nader",
      "John Kerry"
    ],
    "hop": 1,
    "qid": "WebQTest-38",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.04qwhs ns:government.election.campaigns ?y .\n\t?y ns:government.election_campaign.candidate ?x .\nFILTER (?x != ns:m.09b6zr)\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "what did the ancient romans speak",
    "question_entity": "m.06cmp",
    "question_entity_name": "Roman Empire",
    "answer_entities": [
      "m.04h9h"
    ],
    "answer_entity_names": [
      "Latin Language"
    ],
    "hop": 1,
    "qid": "WebQTest-490",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what political party did andrew johnson belong to",
    "question_entity": "m.0rmg",
    "question_entity_name": "Andrew Johnson",
    "answer_entities": [
      "m.07wbk",
      "m.0d075m",
      "m.0d9fdp"
    ],
    "answer_entity_names": [
      "Republican Party",
      "Democratic Party",
      "National Union Party"
    ],
    "hop": 2,
    "qid": "WebQTest-933",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rmg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rmg ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.politician.party",
      "government.political_party_tenure.party"
    ]
  },
  {
    "question": "in which continent is germany",
    "question_entity": "m.0345h",
    "question_entity_name": "Germany",
    "answer_entities": [
      "m.02j9z"
    ],
    "answer_entity_names": [
      "Europe"
    ],
    "hop": 1,
    "qid": "WebQTest-218",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  }
]