[
  {
    "question": "what does monsanto own",
    "question_entity": "m.0n8m6",
    "question_entity_name": "Monsanto",
    "answer_entities": [
      "m.02ntf00",
      "m.09dh0",
      "m.0g10z",
      "m.0hkf"
    ],
    "answer_entity_names": [
      "Agrochemical",
      "Seed",
      "Chemical industry",
      "Agriculture"
    ],
    "hop": 1,
    "qid": "WebQTest-1420",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0n8m6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0n8m6 ns:business.business_operation.industry ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "business.business_operation.industry"
    ]
  },
  {
    "question": "where do they speak turkish",
    "question_entity": "m.02hwyss",
    "question_entity_name": "Turkish Language",
    "answer_entities": [
      "m.01ppq",
      "m.01znc_",
      "m.04fh3",
      "m.0bjv6",
      "m.0h7x"
    ],
    "answer_entity_names": [
      "Cyprus",
      "Turkey",
      "Republic of Kosovo",
      "Republic of Macedonia",
      "Austria"
    ],
    "hop": 1,
    "qid": "WebQTest-1658",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hwyss)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hwyss ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "what is the zip code for wyoming michigan",
    "question_entity": "m.0v9xs",
    "question_entity_name": "Wyoming",
    "answer_entities": [
      "m.01_xtr9",
      "m.01_xv47"
    ],
    "answer_entity_names": [
      "49509",
      "49519"
    ],
    "hop": 1,
    "qid": "WebQTest-655",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0v9xs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0v9xs ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what music did louis armstrong play",
    "question_entity": "m.04n32",
    "question_entity_name": "Louis Armstrong",
    "answer_entities": [
      "m.015y_n",
      "m.03_d0",
      "m.09xw2",
      "m.0dhb2",
      "m.0m40d"
    ],
    "answer_entity_names": [
      "Swing music",
      "Jazz",
      "Dixieland",
      "Scat singing",
      "Traditional pop music"
    ],
    "hop": 1,
    "qid": "WebQTest-1663",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04n32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04n32 ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "who plays chuck bass in gossip girl",
    "question_entity": "m.0g0jx7",
    "question_entity_name": "Chuck Bass",
    "answer_entities": [
      "m.02w4x29"
    ],
    "answer_entity_names": [
      "Ed Westwick"
    ],
    "hop": 1,
    "qid": "WebQTest-711",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g0jx7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g0jx7 ns:base.gossipgirl.character.played_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.gossipgirl.character.played_by"
    ]
  },
  {
    "question": "what language do people from thailand speak",
    "question_entity": "m.07f1x",
    "question_entity_name": "Thailand",
    "answer_entities": [
      "m.011ln5",
      "m.01lqm",
      "m.02hwgbx",
      "m.02hx03r",
      "m.04lx1w",
      "m.052px1",
      "m.072f4m",
      "m.07zrf",
      "m.08h4f2",
      "m.08h4l8",
      "m.0bskhb",
      "m.0bxn4",
      "m.0c_v2"
    ],
    "answer_entity_names": [
      "Lao Language",
      "Khmer language",
      "Akha Language",
      "Mlabri Language",
      "Hmong language",
      "Saek language",
      "Malay, Pattani Language",
      "Vietnamese Language",
      "Nyaw Language",
      "Phu Thai language",
      "Cham language",
      "Mon Language",
      "Thai Language"
    ],
    "hop": 1,
    "qid": "WebQTest-105",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07f1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07f1x ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "when did annie open",
    "question_entity": "m.01_1m4",
    "question_entity_name": "Annie",
    "answer_entities": [
      "1976-08-10"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-59",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_1m4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_1m4 ns:theater.play.date_of_first_performance ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "theater.play.date_of_first_performance"
    ]
  },
  {
    "question": "who was in the israeli palestinian conflict",
    "question_entity": "m.0cj5y",
    "question_entity_name": "Israeli–Palestinian conflict",
    "answer_entities": [
      "m.012bk",
      "m.019x_p",
      "m.01cw71",
      "m.01czvz",
      "m.01html",
      "m.01tp58",
      "m.0203v",
      "m.036df9",
      "m.039b_q",
      "m.056xs",
      "m.08849",
      "m.0b_zw",
      "m.0c_8s",
      "m.0cj84",
      "m.0d58h",
      "m.0hspy",
      "m.0jfzc",
      "m.0kvhz",
      "m.0kwtd",
      "m.0kww1",
      "m.0lf35"
    ],
    "answer_entity_names": [
      "Ariel Sharon",
      "Chaim Weizmann",
      "Ahmad Shukeiri",
      "Haj Amin al-Husseini",
      "Mahmoud Abbas",
      "Ahmed Qurei",
      "Colin Powell",
      "Hanan Ashrawi",
      "Dalal Mughrabi",
      "Menachem Begin",
      "Yasser Arafat",
      "Yitzhak Rabin",
      "Shimon Peres",
      "Anthony Zinni",
      "Anwar Sadat",
      "David Ben-Gurion",
      "Marwan Barghouti",
      "Hussein of Jordan",
      "Nabil Shaath",
      "Ahmed Yassin",
      "Abdullah of Saudi Arabia"
    ],
    "hop": 1,
    "qid": "WebQTest-1942",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cj5y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cj5y ns:time.event.people_involved ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.people_involved"
    ]
  },
  {
    "question": "where did emperor constantine die",
    "question_entity": "m.021tl",
    "question_entity_name": "Constantine the Great",
    "answer_entities": [
      "m.01678j"
    ],
    "answer_entity_names": [
      "Nicomedia"
    ],
    "hop": 1,
    "qid": "WebQTest-1529",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.021tl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.021tl ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what musical instruments does justin bieber play",
    "question_entity": "m.06w2sn5",
    "question_entity_name": "Justin Bieber",
    "answer_entities": [
      "m.0290ngj"
    ],
    "answer_entity_names": [
      "Vocals"
    ],
    "hop": 2,
    "qid": "WebQTest-802",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w2sn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w2sn5 ns:music.artist.track_contributions ?y .\n?y ns:music.track_contribution.role ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.track_contributions",
      "music.track_contribution.role"
    ]
  },
  {
    "question": "what type of currency do they use in thailand",
    "question_entity": "m.07f1x",
    "question_entity_name": "Thailand",
    "answer_entities": [
      "m.0mcb5"
    ],
    "answer_entity_names": [
      "Thai baht"
    ],
    "hop": 1,
    "qid": "WebQTest-181",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07f1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07f1x ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "who has pudge rodriguez played for",
    "question_entity": "m.02p6g7",
    "question_entity_name": "Iván Rodríguez",
    "answer_entities": [
      "m.02__x",
      "m.02d02",
      "m.07l8x"
    ],
    "answer_entity_names": [
      "Miami Marlins",
      "Detroit Tigers",
      "Texas Rangers"
    ],
    "hop": 2,
    "qid": "WebQTest-1319",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02p6g7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02p6g7 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "who is mary mcleod bethune for kids",
    "question_entity": "m.025rv7p",
    "question_entity_name": "Mary McLeod Bethune",
    "answer_entities": [
      "g.121bkpjb"
    ],
    "answer_entity_names": [
      "Educator"
    ],
    "hop": 1,
    "qid": "WebQTest-337",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025rv7p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025rv7p ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what instrument did robin gibb play",
    "question_entity": "m.0137hn",
    "question_entity_name": "Robin Gibb",
    "answer_entities": [
      "m.05r5c",
      "m.07y_7"
    ],
    "answer_entity_names": [
      "Piano",
      "Violin"
    ],
    "hop": 1,
    "qid": "WebQTest-559",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0137hn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0137hn ns:music.group_member.instruments_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.group_member.instruments_played"
    ]
  },
  {
    "question": "who plays captain kirk in star trek",
    "question_entity": "m.0crtw",
    "question_entity_name": "James T. Kirk",
    "answer_entities": [
      "m.06_6j3",
      "m.084m3",
      "m.0lx2l"
    ],
    "answer_entity_names": [
      "Vic Mignogna",
      "William Shatner",
      "Jim Carrey"
    ],
    "hop": 2,
    "qid": "WebQTest-312",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0crtw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0crtw ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_character.appeared_in_tv_program",
      "tv.regular_tv_appearance.actor"
    ]
  },
  {
    "question": "who was wesley snipes",
    "question_entity": "m.02lymt",
    "question_entity_name": "Wesley Snipes",
    "answer_entities": [
      "m.012t_z",
      "m.01d_h8",
      "m.02h6p92",
      "m.02hrh1q",
      "m.02wszfz",
      "m.09l65"
    ],
    "answer_entity_names": [
      "Businessperson",
      "Film Producer",
      "Dancer",
      "Actor",
      "Martial Artist",
      "Singer"
    ],
    "hop": 1,
    "qid": "WebQTest-1038",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lymt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lymt ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who is running for vice president with barack obama 2012",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.012gx2"
    ],
    "answer_entity_names": [
      "Joe Biden"
    ],
    "hop": 1,
    "qid": "WebQTest-1462",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.us_president.vice_president"
    ]
  },
  {
    "question": "what county is brentwood tennessee in",
    "question_entity": "m.0_xcq",
    "question_entity_name": "Brentwood",
    "answer_entities": [
      "m.0msrq"
    ],
    "answer_entity_names": [
      "Williamson County"
    ],
    "hop": 1,
    "qid": "WebQTest-69",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_xcq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_xcq ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what is the zip code for midland tx",
    "question_entity": "m.013n2h",
    "question_entity_name": "Midland",
    "answer_entities": [
      "m.020zz8q",
      "m.0215s_p",
      "m.0215t0_",
      "m.0215t3_",
      "m.0215t88",
      "m.0215t9t",
      "m.07nq9l_",
      "m.07nq9ls",
      "m.07nq9m6",
      "m.07nq9mf",
      "m.07nq9mn"
    ],
    "answer_entity_names": [
      "79702",
      "79705",
      "79701",
      "79707",
      "79703",
      "79706",
      "79711",
      "79712",
      "79710",
      "79708",
      "79704"
    ],
    "hop": 1,
    "qid": "WebQTest-427",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013n2h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013n2h ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "when did the battle of alamo start",
    "question_entity": "m.02hztm",
    "question_entity_name": "Battle of the Alamo",
    "answer_entities": [
      "1836-02-23"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-614",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hztm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hztm ns:time.event.start_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.start_date"
    ]
  },
  {
    "question": "what language do they use in pakistan",
    "question_entity": "m.05sb1",
    "question_entity_name": "Pakistan",
    "answer_entities": [
      "m.02h40lc",
      "m.02hxcvy"
    ],
    "answer_entity_names": [
      "English Language",
      "Urdu Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1596",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sb1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sb1 ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what does bolivia border",
    "question_entity": "m.0165v",
    "question_entity_name": "Bolivia",
    "answer_entities": [
      "m.015fr",
      "m.016wzw",
      "m.01p1v",
      "m.05v10",
      "m.0jgd"
    ],
    "answer_entity_names": [
      "Brazil",
      "Peru",
      "Chile",
      "Paraguay",
      "Argentina"
    ],
    "hop": 2,
    "qid": "WebQTest-823",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0165v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0165v ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.adjoin_s",
      "location.adjoining_relationship.adjoins"
    ]
  },
  {
    "question": "where michael jackson from",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.03b12"
    ],
    "answer_entity_names": [
      "Gary"
    ],
    "hop": 1,
    "qid": "WebQTest-1934",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:music.artist.origin ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.origin"
    ]
  },
  {
    "question": "who is michael j fox parents",
    "question_entity": "m.0hz_1",
    "question_entity_name": "Michael J. Fox",
    "answer_entities": [
      "m.0gxtzg3",
      "m.0gxtzg9"
    ],
    "answer_entity_names": [
      "Phyllis Piper",
      "William Fox"
    ],
    "hop": 1,
    "qid": "WebQTest-1515",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hz_1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hz_1 ns:people.person.parents ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what is sir isaac newton theory",
    "question_entity": "m.03s9v",
    "question_entity_name": "Isaac Newton",
    "answer_entities": [
      "m.01kffn"
    ],
    "answer_entity_names": [
      "Newton's law of universal gravitation"
    ],
    "hop": 1,
    "qid": "WebQTest-1571",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03s9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03s9v ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.argumentmaps.innovator.original_ideas"
    ]
  },
  {
    "question": "where was the city of david",
    "question_entity": "m.0j3w2",
    "question_entity_name": "City of David",
    "answer_entities": [
      "m.0430_"
    ],
    "answer_entity_names": [
      "Jerusalem"
    ],
    "hop": 1,
    "qid": "WebQTest-260",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j3w2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j3w2 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "who did ben stiller date",
    "question_entity": "m.0mdqp",
    "question_entity_name": "Ben Stiller",
    "answer_entities": [
      "m.015p37",
      "m.01x72k",
      "m.023s8",
      "m.03_jy4",
      "m.03m8lq",
      "m.0f0j02",
      "m.0qdgc"
    ],
    "answer_entity_names": [
      "Janeane Garofalo",
      "Claire Forlani",
      "Calista Flockhart",
      "Jeanne Tripplehorn",
      "Amanda Peet",
      "Rhea Durham",
      "Christine Taylor"
    ],
    "hop": 2,
    "qid": "WebQTest-1682",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mdqp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mdqp ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.popstra.celebrity.dated",
      "base.popstra.dated.participant"
    ]
  },
  {
    "question": "what to see in phoenix arizona",
    "question_entity": "m.0d35y",
    "question_entity_name": "Phoenix",
    "answer_entities": [
      "m.0_ftvfh",
      "m.02qwv58",
      "m.03qmw7r",
      "m.056wfy",
      "m.05pmpd",
      "m.06_2xlx",
      "m.08d2pc",
      "m.0cggr1",
      "m.0cns5",
      "m.0d3hj6",
      "m.0k2myn3"
    ],
    "answer_entity_names": [
      "Castle Hot Springs",
      "Arizona Science Center",
      "Ro Ho En",
      "Desert Botanical Garden",
      "Heard Museum",
      "Pueblo Grande Ruin",
      "Phoenix Art Museum",
      "Mesa Arts Center",
      "Grand Canyon",
      "Phoenix Mountain Preserve",
      "Musical Instrument Museum"
    ],
    "hop": 1,
    "qid": "WebQTest-233",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d35y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d35y ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what is rihanna mum called",
    "question_entity": "m.06mt91",
    "question_entity_name": "Rihanna",
    "answer_entities": [
      "m.0h30zg_"
    ],
    "answer_entity_names": [
      "Monica Braithwaite"
    ],
    "hop": 1,
    "qid": "WebQTest-1777",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what genre of art is the mona lisa",
    "question_entity": "m.0jbg2",
    "question_entity_name": "Mona Lisa",
    "answer_entities": [
      "m.01dv4h"
    ],
    "answer_entity_names": [
      "Portrait"
    ],
    "hop": 1,
    "qid": "WebQTest-1633",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jbg2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jbg2 ns:visual_art.artwork.art_genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.artwork.art_genre"
    ]
  },
  {
    "question": "what discovery did galileo make",
    "question_entity": "m.034ks",
    "question_entity_name": "Galileo Galilei",
    "answer_entities": [
      "m.041sd6",
      "m.0bt_p",
      "m.0bv05",
      "m.0f58c"
    ],
    "answer_entity_names": [
      "Io",
      "Callisto",
      "Europa",
      "Ganymede"
    ],
    "hop": 1,
    "qid": "WebQTest-1860",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034ks)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034ks ns:astronomy.astronomer.astronomical_objects_discovered ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "astronomy.astronomer.astronomical_objects_discovered"
    ]
  },
  {
    "question": "what year did the orioles go to the world series",
    "question_entity": "m.01d6g",
    "question_entity_name": "Baltimore Orioles",
    "answer_entities": [
      "m.046_p6",
      "m.04jg7y",
      "m.04td_d"
    ],
    "answer_entity_names": [
      "1983 World Series",
      "1970 World Series",
      "1966 World Series"
    ],
    "hop": 1,
    "qid": "WebQTest-298",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d6g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d6g ns:sports.sports_team.championships ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.championships"
    ]
  },
  {
    "question": "who influenced samuel taylor coleridge",
    "question_entity": "m.078w2",
    "question_entity_name": "Samuel Taylor Coleridge",
    "answer_entities": [
      "m.015_hb",
      "m.015n8",
      "m.017m4j",
      "m.0182w0",
      "m.01gnng",
      "m.03sbs",
      "m.0448r",
      "m.081k8",
      "m.09482",
      "m.0nld"
    ],
    "answer_entity_names": [
      "Giambattista Vico",
      "Baruch Spinoza",
      "Thomas Browne",
      "Friedrich Wilhelm Joseph Schelling",
      "Emanuel Swedenborg",
      "Immanuel Kant",
      "John Milton",
      "William Shakespeare",
      "Robert Burns",
      "Algernon Charles Swinburne"
    ],
    "hop": 1,
    "qid": "WebQTest-1198",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.078w2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.078w2 ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "what are some major events in venezuela",
    "question_entity": "m.07ylj",
    "question_entity_name": "Venezuela",
    "answer_entities": [
      "g.122dshgz",
      "m.0_s2b74",
      "m.0_yl8cs",
      "m.01082t0z",
      "m.010pvsz8",
      "m.011nwg_8",
      "m.011sm70c",
      "m.02qb83",
      "m.02qlx__",
      "m.02r0mx4",
      "m.02rf6lc",
      "m.0461c3",
      "m.080bblj",
      "m.0c0349z",
      "m.0cnymms",
      "m.0dgqgqf",
      "m.0ggbq0x",
      "m.0gys1lh",
      "m.0ryskwc"
    ],
    "answer_entity_names": [
      "2014–15 Venezuelan protests",
      "2014 NACAM Rally Championship",
      "Battle of Santa Inés",
      "2014 Caribbean Earthquake",
      "2014 Festival Internacional de Cine Infantil y Juvenil",
      "Dutch–Venezuelan crisis of 1908",
      "Venezuelan War of Independence",
      "Battle of La Victoria",
      "Machurucuto Incident",
      "2007 RCTV protests",
      "2002 Venezuelan coup d'état attempt",
      "Los Maniceros massacre",
      "12th G-15 summit",
      "Dutch–Venezuela War",
      "Venezuelan crisis of 1902–03",
      "Bombardment of Fort San Carlos",
      "2011 ALBA Games",
      "2013 Venezuela Transaereo 5074 Britten-Norman Islander crash"
    ],
    "hop": 1,
    "qid": "WebQTest-1278",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ylj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ylj ns:location.location.events ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.events"
    ]
  },
  {
    "question": "what kind of government does iran have after 1979",
    "question_entity": "m.03shp",
    "question_entity_name": "Iran",
    "answer_entities": [
      "m.018wl5",
      "m.01d9r3",
      "m.01fgl7",
      "m.01fpfn",
      "m.07lg6"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Presidential system",
      "Islamic republic",
      "Unitary state",
      "Theocracy"
    ],
    "hop": 1,
    "qid": "WebQTest-1306",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03shp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03shp ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "who was sir walter raleigh and what did he do",
    "question_entity": "m.084t6",
    "question_entity_name": "Walter Raleigh",
    "answer_entities": [
      "m.016wtf",
      "m.01h3_3",
      "m.05z96",
      "m.099md",
      "m.0cbd2"
    ],
    "answer_entity_names": [
      "Sailor",
      "Courtier",
      "Poet",
      "Soldier",
      "Writer"
    ],
    "hop": 1,
    "qid": "WebQTest-1244",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084t6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084t6 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who is martin luther king jr facts",
    "question_entity": "m.051cc",
    "question_entity_name": "Martin Luther King, Jr.",
    "answer_entities": [
      "m.010b8yqs",
      "m.01fhsb",
      "m.0377kt",
      "m.065qmpf",
      "m.0cbd2",
      "m.0db79"
    ],
    "answer_entity_names": [
      "Civil rights activist",
      "Pastor",
      "Minister",
      "Humanitarian",
      "Writer",
      "Clergy"
    ],
    "hop": 1,
    "qid": "WebQTest-1101",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what team did howie long",
    "question_entity": "m.04jg88",
    "question_entity_name": "Howie Long",
    "answer_entities": [
      "m.05l71",
      "m.0crj6pn"
    ],
    "answer_entity_names": [
      "Oakland Raiders",
      "Villanova Wildcats football"
    ],
    "hop": 2,
    "qid": "WebQTest-1227",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jg88)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jg88 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what region of the world is egypt associated with",
    "question_entity": "m.02k54",
    "question_entity_name": "Egypt",
    "answer_entities": [
      "m.04wsz"
    ],
    "answer_entity_names": [
      "Middle East"
    ],
    "hop": 1,
    "qid": "WebQTest-189",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  }
]