[
  {
    "question": "what is the zip code for trenton",
    "question_entity": "m.0fvxz",
    "question_entity_name": "Trenton",
    "answer_entities": [
      "m.0206ng_",
      "m.0206njw",
      "m.0206nlg",
      "m.0206qfx",
      "m.0206qgw",
      "m.0206qlh",
      "m.0206qq6",
      "m.0206qr2",
      "m.02075l8",
      "m.02075s5",
      "m.02075z3",
      "m.03dtqlk",
      "m.03dtqmy",
      "m.03dtqnj",
      "m.07nrtm_",
      "m.07nrtn6",
      "m.07nrtnf",
      "m.07nrtnn",
      "m.07nrtnw",
      "m.07nrtp2",
      "m.07nrtp9",
      "m.07nrtpj",
      "m.07nrtpr",
      "m.07nrtpz",
      "m.07nrtq5",
      "m.07nrtqd",
      "m.07nrtqm"
    ],
    "answer_entity_names": [
      "08628",
      "08618",
      "08638",
      "08610",
      "08619",
      "08620",
      "08691",
      "08611",
      "08609",
      "08608",
      "08629",
      "08625",
      "08641",
      "08690",
      "08695",
      "08666",
      "08650",
      "08647",
      "08646",
      "08645",
      "08607",
      "08606",
      "08605",
      "08604",
      "08603",
      "08602",
      "08601"
    ],
    "hop": 1,
    "qid": "WebQTest-500",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fvxz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fvxz ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what city is mt lassen in",
    "question_entity": "m.01ymq1",
    "question_entity_name": "Lassen Peak",
    "answer_entities": [
      "m.01n7q",
      "m.01ymnm",
      "m.059g4",
      "m.09c7w0",
      "m.0k3nk",
      "m.0l30v"
    ],
    "answer_entity_names": [
      "California",
      "Lassen Volcanic National Park",
      "North America",
      "United States of America",
      "Cascade Range",
      "Shasta County"
    ],
    "hop": 1,
    "qid": "WebQTest-1285",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ymq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ymq1 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where is the illinois river on a map",
    "question_entity": "m.0j1qb",
    "question_entity_name": "Illinois River",
    "answer_entities": [
      "m.03v0t",
      "m.059g4",
      "m.09c7w0"
    ],
    "answer_entity_names": [
      "Illinois",
      "North America",
      "United States of America"
    ],
    "hop": 1,
    "qid": "WebQTest-1137",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j1qb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j1qb ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what school did miley cyrus",
    "question_entity": "m.0bdxs5",
    "question_entity_name": "Miley Cyrus",
    "answer_entities": [
      "m.0d_s7d"
    ],
    "answer_entity_names": [
      "Heritage Elementary School"
    ],
    "hop": 2,
    "qid": "WebQTest-691",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdxs5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdxs5 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "who was vp for nixon",
    "question_entity": "m.06c97",
    "question_entity_name": "Richard Nixon",
    "answer_entities": [
      "m.09r62",
      "m.0c_md_"
    ],
    "answer_entity_names": [
      "Spiro Agnew",
      "Gerald Ford"
    ],
    "hop": 1,
    "qid": "WebQTest-1135",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c97)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c97 ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.us_president.vice_president"
    ]
  },
  {
    "question": "where are the new orleans hornets moving to",
    "question_entity": "m.01k8vh",
    "question_entity_name": "Charlotte Hornets",
    "answer_entities": [
      "m.0fsb8"
    ],
    "answer_entity_names": [
      "Charlotte"
    ],
    "hop": 1,
    "qid": "WebQTest-579",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01k8vh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01k8vh ns:sports.sports_team.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.location"
    ]
  },
  {
    "question": "what currency does cyprus use",
    "question_entity": "m.01ppq",
    "question_entity_name": "Cyprus",
    "answer_entities": [
      "m.02l6h"
    ],
    "answer_entity_names": [
      "Euro"
    ],
    "hop": 1,
    "qid": "WebQTest-1473",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ppq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ppq ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what drink did john pemberton create",
    "question_entity": "m.0h24w",
    "question_entity_name": "John Pemberton",
    "answer_entities": [
      "m.01yvs"
    ],
    "answer_entity_names": [
      "Coca-Cola"
    ],
    "hop": 1,
    "qid": "WebQTest-752",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h24w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h24w ns:law.inventor.inventions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "law.inventor.inventions"
    ]
  },
  {
    "question": "what happened to dunkirk during ww2",
    "question_entity": "m.0md6f",
    "question_entity_name": "Dunkirk",
    "answer_entities": [
      "m.03hm2pk",
      "m.0jpb7"
    ],
    "answer_entity_names": [
      "Siege of Dunkirk",
      "Battle of Dunkirk"
    ],
    "hop": 1,
    "qid": "WebQTest-989",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0md6f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0md6f ns:location.location.events ?x .\n?x ns:time.event.included_in_event ns:m.081pw .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.events"
    ]
  },
  {
    "question": "where honduras in the world",
    "question_entity": "m.03h2c",
    "question_entity_name": "Honduras",
    "answer_entities": [
      "m.01tzh",
      "m.04pnx",
      "m.059g4",
      "m.07c5l"
    ],
    "answer_entity_names": [
      "Central America",
      "Latin America",
      "North America",
      "Americas"
    ],
    "hop": 1,
    "qid": "WebQTest-1138",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h2c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h2c ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where was the boston tea party 1773",
    "question_entity": "m.0ccd96",
    "question_entity_name": "Boston Tea Party",
    "answer_entities": [
      "m.04n7kgz"
    ],
    "answer_entity_names": [
      "Boston Harbor"
    ],
    "hop": 1,
    "qid": "WebQTest-1269",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ccd96)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ccd96 ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what languages do they speak in costa rica",
    "question_entity": "m.01p8s",
    "question_entity_name": "Costa Rica",
    "answer_entities": [
      "m.02hwk2m",
      "m.04ygk0",
      "m.06k02z",
      "m.06nm1"
    ],
    "answer_entity_names": [
      "Bribri Language",
      "Jamaican Creole English Language",
      "Limonese Creole",
      "Spanish Language"
    ],
    "hop": 1,
    "qid": "WebQTest-453",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p8s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p8s ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what art movement did leonardo da vinci belong to",
    "question_entity": "m.04lg6",
    "question_entity_name": "Leonardo da Vinci",
    "answer_entities": [
      "m.011nkkt6",
      "m.01z__d"
    ],
    "answer_entity_names": [
      "Pastel Art",
      "High Renaissance"
    ],
    "hop": 1,
    "qid": "WebQTest-354",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "which airport to fly into in buenos aires",
    "question_entity": "m.01ly5m",
    "question_entity_name": "Buenos Aires",
    "answer_entities": [
      "m.01_t37",
      "m.01ky3d",
      "m.04fmtt8"
    ],
    "answer_entity_names": [
      "Aeroparque Jorge Newbery",
      "Ministro Pistarini International Airport",
      "Don Torcuato Airport"
    ],
    "hop": 1,
    "qid": "WebQTest-477",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ly5m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ly5m ns:location.location.nearby_airports ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.nearby_airports"
    ]
  },
  {
    "question": "what was antoni gaudi inspired by",
    "question_entity": "m.0yb0",
    "question_entity_name": "Antoni Gaudí",
    "answer_entities": [
      "m.02mpv",
      "m.08304"
    ],
    "answer_entity_names": [
      "Eugène Viollet-le-Duc",
      "William Morris"
    ],
    "hop": 1,
    "qid": "WebQTest-1311",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yb0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yb0 ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "who is the mother of prince michael jackson",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.0524pr"
    ],
    "answer_entity_names": [
      "Katherine Jackson"
    ],
    "hop": 1,
    "qid": "WebQTest-1160",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "who is anne hathaway parents",
    "question_entity": "m.02vntj",
    "question_entity_name": "Anne Hathaway",
    "answer_entities": [
      "m.07ylp26",
      "m.07ylp2d"
    ],
    "answer_entity_names": [
      "Gerald Hathaway",
      "Kate McCauley Hathaway"
    ],
    "hop": 1,
    "qid": "WebQTest-942",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vntj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vntj ns:people.person.parents ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what did galileo do to become famous",
    "question_entity": "m.034ks",
    "question_entity_name": "Galileo Galilei",
    "answer_entities": [
      "m.025rxky",
      "m.04s2z",
      "m.05snw",
      "m.06q2q",
      "m.0h9c"
    ],
    "answer_entity_names": [
      "Astrologer",
      "Mathematician",
      "Physicist",
      "Scientist",
      "Astronomer"
    ],
    "hop": 1,
    "qid": "WebQTest-582",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034ks)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034ks ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what does julian lennon do",
    "question_entity": "m.01k4jy3",
    "question_entity_name": "Julian Lennon",
    "answer_entities": [
      "m.016z4k",
      "m.02hrh1q",
      "m.039v1",
      "m.04l1gwb",
      "m.09jwl",
      "m.09l65",
      "m.0cbd2",
      "m.0dz3r",
      "m.0lgw7"
    ],
    "answer_entity_names": [
      "Singer-songwriter",
      "Actor",
      "Guitarist",
      "Film Score Composer",
      "Musician",
      "Singer",
      "Writer",
      "Record producer",
      "Photographer"
    ],
    "hop": 1,
    "qid": "WebQTest-533",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01k4jy3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01k4jy3 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where is the seychelles on world map",
    "question_entity": "m.06sw9",
    "question_entity_name": "Seychelles",
    "answer_entities": [
      "m.0dg3n1"
    ],
    "answer_entity_names": [
      "Africa"
    ],
    "hop": 1,
    "qid": "WebQTest-222",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06sw9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06sw9 ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  },
  {
    "question": "when did the philadelphia flyers win the cup",
    "question_entity": "m.0hn2q",
    "question_entity_name": "Philadelphia Flyers",
    "answer_entities": [
      "m.03by14v",
      "m.03by156"
    ],
    "answer_entity_names": [
      "1975 Stanley Cup Finals",
      "1974 Stanley Cup Finals"
    ],
    "hop": 1,
    "qid": "WebQTest-896",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hn2q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hn2q ns:sports.sports_team.championships ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.championships"
    ]
  },
  {
    "question": "what countries are in the euro dollar",
    "question_entity": "m.02l6h",
    "question_entity_name": "Euro",
    "answer_entities": [
      "m.014mxp",
      "m.0154j",
      "m.01ppq",
      "m.02kmm",
      "m.02phy_9",
      "m.02vzc",
      "m.0345h",
      "m.035qy",
      "m.037nm",
      "m.03rjj",
      "m.03rt9",
      "m.049nq",
      "m.04dfw1",
      "m.04fh3",
      "m.04g5k",
      "m.04g61",
      "m.04gzd",
      "m.04v3q",
      "m.04vg8",
      "m.04vws",
      "m.04w58",
      "m.056vv",
      "m.059j2",
      "m.05r4w",
      "m.06mkj",
      "m.06npd",
      "m.06s4c",
      "m.06sff",
      "m.06t8v",
      "m.07ytt",
      "m.088q4",
      "m.0bwhs8r",
      "m.0f8l9c",
      "m.0ggt2",
      "m.0h7f9",
      "m.0h7x",
      "m.0hg5"
    ],
    "answer_entity_names": [
      "Åland Islands",
      "Belgium",
      "Cyprus",
      "Estonia",
      "Collectivity of Saint Martin",
      "Finland",
      "Germany",
      "Greece",
      "Guadeloupe",
      "Italy",
      "Republic of Ireland",
      "Kingdom of the Netherlands",
      "Province of Varese",
      "Republic of Kosovo",
      "Latvia",
      "Luxembourg",
      "Lithuania",
      "Malta",
      "Martinique",
      "Mayotte",
      "Monaco",
      "Montenegro",
      "Netherlands",
      "Portugal",
      "Spain",
      "Slovakia",
      "Saint Pierre and Miquelon",
      "San Marino",
      "Slovenia",
      "Vatican City",
      "Zimbabwe",
      "Caribbean special municipalities of the Netherlands",
      "France",
      "Varese",
      "Saint Barthélemy",
      "Austria",
      "Andorra"
    ],
    "hop": 1,
    "qid": "WebQTest-1245",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02l6h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02l6h ns:finance.currency.countries_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "finance.currency.countries_used"
    ]
  },
  {
    "question": "where was shakespeare born at",
    "question_entity": "m.081k8",
    "question_entity_name": "William Shakespeare",
    "answer_entities": [
      "m.0g251"
    ],
    "answer_entity_names": [
      "Stratford-upon-Avon"
    ],
    "hop": 1,
    "qid": "WebQTest-1910",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what is the sacred text of daoism",
    "question_entity": "m.07gvx",
    "question_entity_name": "Taoism",
    "answer_entities": [
      "m.0164zy",
      "m.02czn",
      "m.03ydb",
      "m.05blr4"
    ],
    "answer_entity_names": [
      "Zhuang Zhou",
      "Tao Te Ching",
      "I Ching",
      "Daozang"
    ],
    "hop": 1,
    "qid": "WebQTest-1603",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gvx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gvx ns:religion.religion.texts ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "religion.religion.texts"
    ]
  },
  {
    "question": "what type of government does france use",
    "question_entity": "m.0f8l9c",
    "question_entity_name": "France",
    "answer_entities": [
      "m.01dw03",
      "m.01fpfn",
      "m.0c9rw5"
    ],
    "answer_entity_names": [
      "Semi-presidential system",
      "Unitary state",
      "Constitutional republic"
    ],
    "hop": 1,
    "qid": "WebQTest-185",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what language do people speak in the bahamas",
    "question_entity": "m.0160w",
    "question_entity_name": "Bahamas",
    "answer_entities": [
      "m.026qjbs",
      "m.02h40lc"
    ],
    "answer_entity_names": [
      "Bahamas Creole English Language",
      "English Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1191",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where did robert downey jr go to jail",
    "question_entity": "m.016z2j",
    "question_entity_name": "Robert Downey Jr.",
    "answer_entities": [
      "m.02621l5"
    ],
    "answer_entity_names": [
      "California Substance Abuse Treatment Facility and State Prison, Corcoran"
    ],
    "hop": 2,
    "qid": "WebQTest-1883",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016z2j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016z2j ns:base.prison.prisoner.imprisoned ?y .\n?y ns:base.prison.imprisonment.prison ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.prison.prisoner.imprisoned",
      "base.prison.imprisonment.prison"
    ]
  },
  {
    "question": "what characters does matt stone do",
    "question_entity": "m.01_x6d",
    "question_entity_name": "Matt Stone",
    "answer_entities": [
      "m.013z1n",
      "m.01lgj0",
      "m.021r0s",
      "m.0bthgtk",
      "m.0bthgtn",
      "m.0bthgtr",
      "m.0bzk1qh",
      "m.0bzk1r1",
      "m.0bzk1rh",
      "m.0bzk1s0",
      "m.0dnc0h",
      "m.0g1jfp",
      "m.0h0z47h",
      "m.0h0z47s",
      "m.0h0z48_",
      "m.0h0z481",
      "m.0h0z488",
      "m.0h0z48k",
      "m.0h0z48s",
      "m.0h0z4dl",
      "m.0vnkcxn"
    ],
    "answer_entity_names": [
      "Kenny McCormick",
      "Kyle Broflovski",
      "Wizard of Oz",
      "Terrance Henry Stoot",
      "Gerald Broflovski",
      "Bill Gates",
      "Ethan Hawke",
      "Chris",
      "George Clooney",
      "Danny Glover",
      "Jimbo Kearn",
      "Saddam Hussein",
      "James Humphries",
      "Former Columbine Student",
      "Doug Remer",
      "Hermaphrodite",
      "Taper Guy",
      "Kyle / Kenny / Jesus",
      "Dave the Lighting Guy",
      "Man toasting drinks at MCA outdoor bar",
      "Ticket Taker"
    ],
    "hop": 2,
    "qid": "WebQTest-635",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_x6d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_x6d ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.character"
    ]
  },
  {
    "question": "what language do they speak in sweden yahoo",
    "question_entity": "m.0d0vqn",
    "question_entity_name": "Sweden",
    "answer_entities": [
      "m.012psb",
      "m.01gp_d",
      "m.02z5h0",
      "m.02zb99n",
      "m.04lmb2",
      "m.06mp7",
      "m.0880p"
    ],
    "answer_entity_names": [
      "Romani language",
      "Finnish Language",
      "Meänkieli",
      "Swedish Sign Language",
      "Turoyo Language",
      "Swedish Language",
      "Yiddish Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1422",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0vqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0vqn ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where did the iroquois indians come from",
    "question_entity": "m.03x1x",
    "question_entity_name": "Iroquois",
    "answer_entities": [
      "m.05kr_",
      "m.0694j"
    ],
    "answer_entity_names": [
      "Ontario",
      "Québec"
    ],
    "hop": 1,
    "qid": "WebQTest-194",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03x1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03x1x ns:people.ethnicity.geographic_distribution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.geographic_distribution"
    ]
  },
  {
    "question": "what are staffordshire terriers",
    "question_entity": "m.01kv93",
    "question_entity_name": "Staffordshire Bull Terrier",
    "answer_entities": [
      "m.0bt9lr"
    ],
    "answer_entity_names": [
      "Dog"
    ],
    "hop": 1,
    "qid": "WebQTest-1510",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kv93)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kv93 ns:biology.animal_breed.breed_of ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "biology.animal_breed.breed_of"
    ]
  },
  {
    "question": "where is dwayne johnson ethnicity",
    "question_entity": "m.014g_s",
    "question_entity_name": "Dwayne Johnson",
    "answer_entities": [
      "m.07j80c",
      "m.0x67"
    ],
    "answer_entity_names": [
      "Samoan American",
      "African American"
    ],
    "hop": 1,
    "qid": "WebQTest-2022",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014g_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014g_s ns:people.person.ethnicity ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.ethnicity"
    ]
  },
  {
    "question": "what language do most italians speak",
    "question_entity": "m.03rjj",
    "question_entity_name": "Italy",
    "answer_entities": [
      "m.02bjrlw"
    ],
    "answer_entity_names": [
      "Italian Language"
    ],
    "hop": 1,
    "qid": "WebQTest-552",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rjj ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what countries does the panama canal go through",
    "question_entity": "m.066rl",
    "question_entity_name": "Panama Canal",
    "answer_entities": [
      "m.05qx1"
    ],
    "answer_entity_names": [
      "Panama"
    ],
    "hop": 1,
    "qid": "WebQTest-234",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.066rl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.066rl ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what countries speak english natively",
    "question_entity": "m.02h40lc",
    "question_entity_name": "English Language",
    "answer_entities": [
      "m.014tss",
      "m.03rt9",
      "m.07ssc",
      "m.09c7w0",
      "m.0chghy",
      "m.0ctw_b",
      "m.0d060g"
    ],
    "answer_entity_names": [
      "Kingdom of Great Britain",
      "Republic of Ireland",
      "United Kingdom",
      "United States of America",
      "Australia",
      "New Zealand",
      "Canada"
    ],
    "hop": 1,
    "qid": "WebQTest-1604",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h40lc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h40lc ns:language.human_language.main_country ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.main_country"
    ]
  },
  {
    "question": "where did thomas hobbes live",
    "question_entity": "m.07c37",
    "question_entity_name": "Thomas Hobbes",
    "answer_entities": [
      "m.05qtj"
    ],
    "answer_entity_names": [
      "Paris"
    ],
    "hop": 2,
    "qid": "WebQTest-1370",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07c37)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07c37 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "what is the parliament of nepal called",
    "question_entity": "m.0c5yqk",
    "question_entity_name": "Parliament of Nepal",
    "answer_entities": [
      "Parliament of Nepal"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1555",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c5yqk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c5yqk ns:type.object.name ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "type.object.name"
    ]
  },
  {
    "question": "what other movies has tom hardy played in",
    "question_entity": "m.05xf75",
    "question_entity_name": "Tom Hardy",
    "answer_entities": [
      "m.010b8p1w",
      "m.010s_rgr",
      "m.012vy2c1",
      "m.014lc_",
      "m.02852xd",
      "m.02d3wv",
      "m.02vvwqg",
      "m.02w90vl",
      "m.03g_b58",
      "m.03m6sts",
      "m.03tyb3",
      "m.0413tm",
      "m.04cwpt9",
      "m.04f2_t4",
      "m.04j0l1s",
      "m.04j1_st",
      "m.04z_tyl",
      "m.05szl93",
      "m.05t1gh",
      "m.0661ql3",
      "m.0681f6",
      "m.07yvsn",
      "m.0b62y7",
      "m.0bpm4yw",
      "m.0ck3fq1",
      "m.0d6_8r",
      "m.0dll_t2",
      "m.0f_j1n",
      "m.0gfh84d",
      "m.0ggbhy7",
      "m.0gp4pz",
      "m.0gx8_b7",
      "m.0gxmc0c",
      "m.0h4ymqz",
      "m.0nh514x",
      "m.0qm8b",
      "m.0tkj5w3",
      "m.0v3gp6q",
      "m.0vv7fv2",
      "m.0w7ptqf"
    ],
    "answer_entity_names": [
      "The Revenant",
      "Legend",
      "London Road",
      "Star Trek Nemesis",
      "Scenes of a Sexual Nature",
      "Mad Max: Fury Road",
      "RocknRolla",
      "Flood",
      "Thick as Thieves",
      "WΔZ",
      "The Virgin Queen",
      "Layer Cake",
      "Colditz",
      "The Inheritance",
      "Sweeney Todd",
      "Lethal Dose",
      "Bronson",
      "Warrior",
      "Minotaur",
      "Inception",
      "Gideon's Daughter",
      "Marie Antoinette",
      "Dot the I",
      "The Dark Knight Rises",
      "Deserter",
      "The Reckoning",
      "This Means War",
      "Splinter Cell",
      "Lawless",
      "Tinker Tailor Soldier Spy",
      "EMR",
      "Perfect",
      "Sergeant Slaughter, My Big Brother",
      "Sucker Punch",
      "Everest",
      "Black Hawk Down",
      "The Drop",
      "Locke",
      "The Outsider",
      "Child 44"
    ],
    "hop": 2,
    "qid": "WebQTest-1322",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05xf75)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05xf75 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  }
]