[
  {
    "question": "what is the name of sonia gandhi daughter",
    "question_entity": "m.016rwt",
    "question_entity_name": "Sonia Gandhi",
    "answer_entities": [
      "m.02n207"
    ],
    "answer_entity_names": [
      "Priyanka Gandhi"
    ],
    "hop": 1,
    "qid": "WebQTest-877",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016rwt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016rwt ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what style of music does john mayer play",
    "question_entity": "m.01s21dg",
    "question_entity_name": "John Mayer",
    "answer_entities": [
      "m.01243b",
      "m.0155w",
      "m.016clz",
      "m.016jny",
      "m.01lyv",
      "m.027pgn0",
      "m.02k_kn",
      "m.02qdgx",
      "m.02w4v",
      "m.02yv6b",
      "m.05bt6j",
      "m.064t9",
      "m.06by7",
      "m.09qxq7",
      "m.0gywn",
      "m.0mhfr"
    ],
    "answer_entity_names": [
      "Indie rock",
      "Blues",
      "Alternative rock",
      "Folk rock",
      "Country",
      "Soul rock",
      "Soft rock",
      "Blue-eyed soul",
      "Folk music",
      "Blues rock",
      "Pop rock",
      "Pop music",
      "Rock music",
      "Acoustic music",
      "Soul music",
      "Country rock"
    ],
    "hop": 1,
    "qid": "WebQTest-597",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s21dg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s21dg ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what is the zip code for schenectady new york",
    "question_entity": "m.0fdpd",
    "question_entity_name": "Schenectady",
    "answer_entities": [
      "m.020g9r_",
      "m.020g9r0",
      "m.020g9sv",
      "m.020g9vb",
      "m.020g9yp",
      "m.02kxqvh",
      "m.03dv1_1",
      "m.03dv1_v",
      "m.03dv1zn",
      "m.07nrp8x",
      "m.07nrp93"
    ],
    "answer_entity_names": [
      "12306",
      "12305",
      "12308",
      "12309",
      "12302",
      "12345",
      "12304",
      "12307",
      "12303",
      "12325",
      "12301"
    ],
    "hop": 1,
    "qid": "WebQTest-748",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fdpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fdpd ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what is the holy book of the buddhist religion",
    "question_entity": "m.092bf5",
    "question_entity_name": "Buddhism",
    "answer_entities": [
      "m.01hnwm",
      "m.01nv3q",
      "m.01r1g7",
      "m.01rky9",
      "m.02k1bj",
      "m.02l3dj",
      "m.036z9c",
      "m.04_13vt",
      "m.04k1b0",
      "m.05_m24",
      "m.05mwk22",
      "m.0c00_gk",
      "m.0c4pcl",
      "m.0fs6g7"
    ],
    "answer_entity_names": [
      "Pāli Canon",
      "Dhammapada",
      "Mahāyāna sūtras",
      "Vimalakirti Sutra",
      "Tibetan Buddhist canon",
      "Chinese Buddhist canon",
      "Śrīmālādevī Siṃhanāda Sūtra",
      "Mahāvastu",
      "Amitabha Sutra",
      "Āgama",
      "Gangōji Garan Engi",
      "Uṣṇīṣa Vijaya Dhāraṇī Sūtra",
      "Longchen Nyingthig",
      "Nīlakaṇṭha Dhāraṇī"
    ],
    "hop": 1,
    "qid": "WebQTest-788",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.092bf5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.092bf5 ns:religion.religion.texts ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "religion.religion.texts"
    ]
  },
  {
    "question": "what business did andrew carnegie dominate",
    "question_entity": "m.0vdk",
    "question_entity_name": "Andrew Carnegie",
    "answer_entities": [
      "financier",
      "steel"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1234",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vdk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vdk ns:base.kwebbase.kwtopic.disciplines ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.kwebbase.kwtopic.disciplines"
    ]
  },
  {
    "question": "who was kate chopin",
    "question_entity": "m.0d8pw",
    "question_entity_name": "Kate Chopin",
    "answer_entities": [
      "m.012t_z",
      "m.02xhgwq",
      "m.0cbd2",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Businessperson",
      "Novelist",
      "Writer",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-1507",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d8pw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d8pw ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where does the celtics practice",
    "question_entity": "m.0bwjj",
    "question_entity_name": "Boston Celtics",
    "answer_entities": [
      "m.02hqj2",
      "m.05tbsj"
    ],
    "answer_entity_names": [
      "TD Garden",
      "XL Center"
    ],
    "hop": 1,
    "qid": "WebQTest-870",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bwjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bwjj ns:sports.sports_team.arena_stadium ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.arena_stadium"
    ]
  },
  {
    "question": "which countries speak arabic language",
    "question_entity": "m.0jzc",
    "question_entity_name": "Arabic Language",
    "answer_entities": [
      "m.0161c",
      "m.01z215",
      "m.01z88t",
      "m.01znc_",
      "m.027jk",
      "m.02k54",
      "m.02z62v1",
      "m.03__y",
      "m.035hr8",
      "m.03shp",
      "m.03spz",
      "m.047yc",
      "m.04gqr",
      "m.04hqz",
      "m.04vjh",
      "m.04wgh",
      "m.05l8y",
      "m.0697s",
      "m.06tw8",
      "m.06vbd",
      "m.07dzf",
      "m.07fj_",
      "m.0d05q4",
      "m.0d060g",
      "m.0h3y",
      "m.0h44w",
      "m.0hzlz",
      "m.0j1z8"
    ],
    "answer_entity_names": [
      "Bahrain",
      "Saudi Arabia",
      "Yemen",
      "Turkey",
      "Djibouti",
      "Egypt",
      "Seljuk Empire",
      "Jordan",
      "South Yemen",
      "Iran",
      "Israel",
      "Kuwait",
      "Libya",
      "Lebanon",
      "Mauritania",
      "Morocco",
      "Oman",
      "Qatar",
      "Sudan",
      "Syria",
      "Tanzania",
      "Tunisia",
      "Iraq",
      "Canada",
      "Algeria",
      "Mandatory Palestine",
      "South Africa",
      "United Arab Emirates"
    ],
    "hop": 1,
    "qid": "WebQTest-2008",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jzc ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "what kind of products does nike sell",
    "question_entity": "m.0lwkh",
    "question_entity_name": "Nike, Inc.",
    "answer_entities": [
      "m.02kztmt",
      "m.03q9xp9",
      "m.0463sg",
      "m.05y5lj",
      "m.09j2d",
      "m.09j5n"
    ],
    "answer_entity_names": [
      "Athletic Shoes & Apparel",
      "Footwear Manufacturing",
      "Fashion accessory",
      "Sports equipment",
      "Clothing",
      "Footwear"
    ],
    "hop": 1,
    "qid": "WebQTest-1597",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lwkh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lwkh ns:business.business_operation.industry ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "business.business_operation.industry"
    ]
  },
  {
    "question": "what are egyptian money called",
    "question_entity": "m.02k54",
    "question_entity_name": "Egypt",
    "answer_entities": [
      "m.04phzg"
    ],
    "answer_entity_names": [
      "Egyptian pound"
    ],
    "hop": 1,
    "qid": "WebQTest-654",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what happened at benghazi",
    "question_entity": "m.01czt9",
    "question_entity_name": "Benghazi",
    "answer_entities": [
      "m.0136_03w",
      "m.0136zn1t",
      "m.0gg5z_1",
      "m.0gj8wbw",
      "m.0m1x86k",
      "m.0n4bfmd",
      "m.0w1f1vz"
    ],
    "answer_entity_names": [
      "Operation Dignity Battle",
      "Battle of Benina Airport",
      "First Battle of Benghazi",
      "Second Battle of Benghazi",
      "2012 U.S. diplomatic missions attacks",
      "2012 Benghazi attack",
      "2013 Benghazi conflict"
    ],
    "hop": 1,
    "qid": "WebQTest-1021",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01czt9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01czt9 ns:location.location.events ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.events"
    ]
  },
  {
    "question": "what did andy irons die from",
    "question_entity": "m.03xn54",
    "question_entity_name": "Andy Irons",
    "answer_entities": [
      "m.0gk4g"
    ],
    "answer_entity_names": [
      "heart attack"
    ],
    "hop": 1,
    "qid": "WebQTest-1668",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03xn54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03xn54 ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what school did wilfred owen go to",
    "question_entity": "m.0ckwt",
    "question_entity_name": "Wilfred Owen",
    "answer_entities": [
      "m.02f46y",
      "m.03qjj55"
    ],
    "answer_entity_names": [
      "University of Reading",
      "Wakeman School"
    ],
    "hop": 2,
    "qid": "WebQTest-1493",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ckwt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ckwt ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what movies has carmen electra been in",
    "question_entity": "m.01lbp",
    "question_entity_name": "Carmen Electra",
    "answer_entities": [
      "m.0110g35j",
      "m.01265cw2",
      "m.01hjwf",
      "m.01pj_5",
      "m.026hxwx",
      "m.02ntb8",
      "m.02pjfgv",
      "m.02q5hqz",
      "m.02q674n",
      "m.02qdrjx",
      "m.03ck20l",
      "m.03cn85q",
      "m.03qhxn_",
      "m.03ywfs",
      "m.040_ypz",
      "m.0479qny",
      "m.04gbj8",
      "m.04j08hn",
      "m.04j0wxq",
      "m.04j1hm9",
      "m.04j2m_x",
      "m.04rk7s",
      "m.056p3k",
      "m.05nd09x",
      "m.066b_n",
      "m.072txz",
      "m.07h9gp",
      "m.07zm5t",
      "m.080kmxp",
      "m.08pqpg",
      "m.09t10b",
      "m.0b5mw7",
      "m.0b64qt1",
      "m.0bh8xz2",
      "m.0c02882",
      "m.0cr_bqp",
      "m.0crrvj7",
      "m.0crv9zg",
      "m.0crvchf",
      "m.0crw06",
      "m.0d042l",
      "m.0d2l2_",
      "m.0d9z_7",
      "m.0f0sjn",
      "m.0gxsyb5",
      "m.0h3w444",
      "m.0h944f1",
      "m.0tl8nwg",
      "m.0tl8ql6",
      "m.0tl8srv",
      "m.0tl8vtw"
    ],
    "answer_entity_names": [
      "Dragula",
      "Chocolate City",
      "Good Burger",
      "Scary Movie",
      "Epic Movie",
      "Starsky & Hutch",
      "Full of It",
      "I Want Candy",
      "Lil' Pimp",
      "Bedtime Stories",
      "Meet the Spartans",
      "Christmas in Wonderland",
      "Perfume",
      "Mr. 3000",
      "Sol Goode",
      "Disaster Movie",
      "Baywatch: Hawaiian Wedding",
      "Naked Movie",
      "Hot Tamale",
      "30 Days Until I'm Famous",
      "Whacked!",
      "Uptown Girls",
      "Get Over It",
      "Searching for Bobby D",
      "Cheaper by the Dozen 2",
      "National Lampoon's Pledge This!",
      "Scary Movie 4",
      "The Chosen One: Legend of the Raven",
      "Oy Vey! My Son Is Gay!!",
      "Date Movie",
      "American Dreamz",
      "Dirty Love",
      "Starstruck",
      "Barry Munday",
      "American Vampire",
      "Carmen Electra's Fit to Strip",
      "Rent Control",
      "BThere Dvd Magazine",
      "We Are Family",
      "Monster Island",
      "Max Havoc: Curse of the Dragon",
      "My Boss's Daughter",
      "Getting Played",
      "The Mating Habits of the Earthbound Human",
      "The Back Nine",
      "2-Headed Shark Attack",
      "Mardi Gras: Spring Break",
      "Lap Dance",
      "Book of Fire",
      "The Axe Boat",
      "Lolo's Cafe"
    ],
    "hop": 2,
    "qid": "WebQTest-287",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lbp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lbp ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what type of money do they use in costa rica",
    "question_entity": "m.01p8s",
    "question_entity_name": "Costa Rica",
    "answer_entities": [
      "m.04wccn"
    ],
    "answer_entity_names": [
      "Costa Rican colón"
    ],
    "hop": 1,
    "qid": "WebQTest-518",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p8s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p8s ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what places are in the west midlands",
    "question_entity": "m.0dyjz",
    "question_entity_name": "West Midlands",
    "answer_entities": [
      "m.01ycxx",
      "m.0257kt",
      "m.02z8_s",
      "m.0c5_3",
      "m.0k33p"
    ],
    "answer_entity_names": [
      "Sandwell",
      "Metropolitan Borough of Dudley",
      "Metropolitan Borough of Solihull",
      "Coventry",
      "Birmingham"
    ],
    "hop": 1,
    "qid": "WebQTest-1432",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dyjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dyjz ns:base.aareas.schema.administrative_area.administrative_children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.aareas.schema.administrative_area.administrative_children"
    ]
  },
  {
    "question": "what did alice paul accomplish",
    "question_entity": "m.02lp71",
    "question_entity_name": "Alice Stokes Paul",
    "answer_entities": [
      "m.02_77lg"
    ],
    "answer_entity_names": [
      "Organization founder"
    ],
    "hop": 1,
    "qid": "WebQTest-451",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lp71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lp71 ns:common.topic.notable_types ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "common.topic.notable_types"
    ]
  },
  {
    "question": "what type of government was formed when italy unified",
    "question_entity": "m.03rjj",
    "question_entity_name": "Italy",
    "answer_entities": [
      "m.01fpfn",
      "m.0c9rw5",
      "m.0glnsx"
    ],
    "answer_entity_names": [
      "Unitary state",
      "Constitutional republic",
      "Parliamentary republic"
    ],
    "hop": 1,
    "qid": "WebQTest-329",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rjj ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where is denmark south carolina",
    "question_entity": "m.0_kl9",
    "question_entity_name": "Denmark",
    "answer_entities": [
      "m.0mw39"
    ],
    "answer_entity_names": [
      "Bamberg County"
    ],
    "hop": 1,
    "qid": "WebQTest-1257",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_kl9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_kl9 ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what is the capital of australia victoria state",
    "question_entity": "m.0chgr2",
    "question_entity_name": "Victoria",
    "answer_entities": [
      "m.0chgzm"
    ],
    "answer_entity_names": [
      "Melbourne"
    ],
    "hop": 1,
    "qid": "WebQTest-699",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chgr2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chgr2 ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.aareas.schema.administrative_area.capital"
    ]
  },
  {
    "question": "what was benedict arnold most famous for",
    "question_entity": "m.025_0c",
    "question_entity_name": "Benedict Arnold",
    "answer_entities": [
      "m.07y2zxd"
    ],
    "answer_entity_names": [
      "Traitor"
    ],
    "hop": 1,
    "qid": "WebQTest-1706",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025_0c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025_0c ns:base.honouriam.dishonoured_person.dishonor_bestowed ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.honouriam.dishonoured_person.dishonor_bestowed"
    ]
  },
  {
    "question": "what else has jennifer lawrence played in",
    "question_entity": "m.02x0dzw",
    "question_entity_name": "Jennifer Lawrence",
    "answer_entities": [
      "m.0_4654w",
      "m.010sqq_d",
      "m.02vm7h8",
      "m.03cqk46",
      "m.03grp5m",
      "m.07cgsg_",
      "m.093dqjy",
      "m.09v71cj",
      "m.0bg9xm6",
      "m.0cd2vh9",
      "m.0fpmrlv",
      "m.0gkz15s",
      "m.0gydg4g",
      "m.0gyn8bv",
      "m.0h95927",
      "m.0n40qmp",
      "m.0ngvsvk",
      "m.0ngvtb_",
      "m.0r3r5jz",
      "m.0r8p2ll",
      "m.0ryt9m1",
      "m.0y4y7jj",
      "m.0yvlk0t",
      "m.0yvm5dh"
    ],
    "answer_entity_names": [
      "X-Men: Apocalypse",
      "Joy",
      "Not Another High School Show",
      "The Burning Plain",
      "Garden Party",
      "Company Town",
      "Winter’s Bone",
      "The Beaver",
      "The Poker House",
      "X-Men: First Class",
      "Like Crazy",
      "The Hunger Games",
      "House at the End of the Street",
      "Devil You Know",
      "Silver Linings Playbook",
      "The Hunger Games: Catching Fire",
      "The Hunger Games: Mockingjay, Part 1",
      "The Hunger Games: Mockingjay, Part 2",
      "X-Men: Days of Future Past",
      "Serena",
      "American Hustle",
      "East of Eden",
      "Burial Rites",
      "The Glass Castle"
    ],
    "hop": 2,
    "qid": "WebQTest-867",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02x0dzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02x0dzw ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what kind of hispanic is selena gomez",
    "question_entity": "m.0gs6vr",
    "question_entity_name": "Selena Gomez",
    "answer_entities": [
      "m.09k5jvk",
      "m.0xnvg"
    ],
    "answer_entity_names": [
      "Mexicans",
      "Italian American"
    ],
    "hop": 1,
    "qid": "WebQTest-652",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:people.person.ethnicity ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.ethnicity"
    ]
  },
  {
    "question": "what to see in christchurch new zealand",
    "question_entity": "m.02yc5b",
    "question_entity_name": "Christchurch",
    "answer_entities": [
      "m.02qld5z",
      "m.03vzw6",
      "m.04bgpr",
      "m.05zrshr",
      "m.061hdn",
      "m.06drcd",
      "m.06nnvz",
      "m.06srm9",
      "m.0d902k",
      "m.0gh8h3s"
    ],
    "answer_entity_names": [
      "International Antarctic Centre",
      "Ferrymead Heritage Park",
      "Cathedral Square, Christchurch",
      "Willowbank Wildlife Reserve, Christchurch",
      "Christchurch Botanic Gardens",
      "Christchurch Arts Centre",
      "Air Force Museum of New Zealand",
      "Canterbury Museum, Christchurch",
      "TranzAlpine",
      "Lyttelton Timeball Station"
    ],
    "hop": 1,
    "qid": "WebQTest-1230",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02yc5b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02yc5b ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what schools did anders celsius attend",
    "question_entity": "m.010nm",
    "question_entity_name": "Anders Celsius",
    "answer_entities": [
      "m.07tjf"
    ],
    "answer_entity_names": [
      "Uppsala University"
    ],
    "hop": 2,
    "qid": "WebQTest-1826",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.010nm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.010nm ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what kind of government is south korea",
    "question_entity": "m.06qd3",
    "question_entity_name": "South Korea",
    "answer_entities": [
      "m.01d9r3",
      "m.01fpfn",
      "m.0c9rw5"
    ],
    "answer_entity_names": [
      "Presidential system",
      "Unitary state",
      "Constitutional republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1465",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06qd3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06qd3 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what did st augustine do",
    "question_entity": "m.0w6w",
    "question_entity_name": "Augustine of Hippo",
    "answer_entities": [
      "m.02h6fbs",
      "m.05t4q",
      "m.0cbd2"
    ],
    "answer_entity_names": [
      "Philosopher",
      "Physician",
      "Writer"
    ],
    "hop": 1,
    "qid": "WebQTest-20",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0w6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0w6w ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what was gregor mendel contribution",
    "question_entity": "m.039c5",
    "question_entity_name": "Gregor Mendel",
    "answer_entities": [
      "m.0266rh",
      "m.02h6p1f",
      "m.06q2q"
    ],
    "answer_entity_names": [
      "Monk",
      "Botanist",
      "Scientist"
    ],
    "hop": 1,
    "qid": "WebQTest-1460",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.039c5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.039c5 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "in what country do people speak danish",
    "question_entity": "m.0295r",
    "question_entity_name": "Danish Language",
    "answer_entities": [
      "m.0k6nt"
    ],
    "answer_entity_names": [
      "Denmark"
    ],
    "hop": 1,
    "qid": "WebQTest-1312",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0295r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0295r ns:language.human_language.main_country ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.main_country"
    ]
  },
  {
    "question": "what did jesus do for living",
    "question_entity": "m.045m1_",
    "question_entity_name": "Jesus Christ",
    "answer_entities": [
      "m.019x4f",
      "m.066dv",
      "m.067nv"
    ],
    "answer_entity_names": [
      "Carpentry",
      "Prophet",
      "Preacher"
    ],
    "hop": 1,
    "qid": "WebQTest-1865",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045m1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045m1_ ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what airport do you fly into to get to destin fl",
    "question_entity": "m.0rp8x",
    "question_entity_name": "Destin",
    "answer_entities": [
      "m.01q6d0",
      "m.02qzm7_"
    ],
    "answer_entity_names": [
      "Destin–Fort Walton Beach Airport",
      "Destin Executive Airport"
    ],
    "hop": 1,
    "qid": "WebQTest-171",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rp8x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rp8x ns:location.location.nearby_airports ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.nearby_airports"
    ]
  },
  {
    "question": "what are the sights to see in madrid",
    "question_entity": "m.056_y",
    "question_entity_name": "Madrid",
    "answer_entities": [
      "m.01bc9m",
      "m.01hlq3",
      "m.01jcyh",
      "m.02r9yg7",
      "m.03chy63",
      "m.03rmzx",
      "m.04m3yk",
      "m.053llq",
      "m.05bvn8g",
      "m.06_l58",
      "m.06cgmf",
      "m.06j2nj",
      "m.06nd2f",
      "m.073z19",
      "m.07f__f",
      "m.07mpc7",
      "m.09s07b",
      "m.0bwg9f0",
      "m.0cd2rc",
      "m.0fphvtq",
      "m.0h3lmf1",
      "m.0h3tjjc"
    ],
    "answer_entity_names": [
      "El Escorial",
      "Museo Nacional Del Prado",
      "Museo Nacional Centro de Arte Reina Sofía",
      "Summercase",
      "Festimad",
      "Buen Retiro Park",
      "Royal Palace of Madrid",
      "Almudena Cathedral",
      "Sorolla Museum",
      "Plaza de Cibeles",
      "Madrid Arena",
      "Paseo del Prado",
      "Parque Warner Madrid",
      "Thyssen-Bornemisza Museum",
      "Temple of Debod",
      "Puerta del Sol",
      "Gran Vía",
      "Madrid Marathon",
      "Plaza Mayor, Madrid",
      "La Vaguada",
      "Museum of Lázaro Galdiano",
      "Palace of la Bolsa de Madrid"
    ],
    "hop": 1,
    "qid": "WebQTest-153",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.056_y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.056_y ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what art did wassily kandinsky do",
    "question_entity": "m.0856z",
    "question_entity_name": "Wassily Kandinsky",
    "answer_entities": [
      "m.05qdh"
    ],
    "answer_entity_names": [
      "Painting"
    ],
    "hop": 1,
    "qid": "WebQTest-1309",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0856z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0856z ns:visual_art.visual_artist.art_forms ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.art_forms"
    ]
  },
  {
    "question": "what political party was hitler in",
    "question_entity": "m.07_m9_",
    "question_entity_name": "Adolf Hitler",
    "answer_entities": [
      "m.05g9h",
      "m.0dl13"
    ],
    "answer_entity_names": [
      "Nazi Party",
      "German Workers' Party"
    ],
    "hop": 2,
    "qid": "WebQTest-1673",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.politician.party",
      "government.political_party_tenure.party"
    ]
  },
  {
    "question": "what did ferdinand magellan do",
    "question_entity": "m.033ky",
    "question_entity_name": "Ferdinand Magellan",
    "answer_entities": [
      "m.016wtf",
      "m.023nrw",
      "m.040vc4s"
    ],
    "answer_entity_names": [
      "Sailor",
      "Navigator",
      "Explorer"
    ],
    "hop": 1,
    "qid": "WebQTest-1696",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033ky)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033ky ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  }
]