[
  {
    "question": "what celebrities has brody jenner dated",
    "question_entity": "m.026_dq6",
    "question_entity_name": "Brody Jenner",
    "answer_entities": [
      "m.014v6x",
      "m.0227vl",
      "m.04nvm8f",
      "m.08wv1j",
      "m.0dq9wx",
      "m.0hhr1fv"
    ],
    "answer_entity_names": [
      "Haylie Duff",
      "Paris Hilton",
      "Ryan J. Parker",
      "Kristin Cavallari",
      "Lauren Conrad",
      "Cora Skinner"
    ],
    "hop": 2,
    "qid": "WebQTest-765",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026_dq6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026_dq6 ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.popstra.celebrity.dated",
      "base.popstra.dated.participant"
    ]
  },
  {
    "question": "what type government does mexico have",
    "question_entity": "m.0b90_r",
    "question_entity_name": "Mexico",
    "answer_entities": [
      "m.01d9r3",
      "m.0c9rw5",
      "m.0j729"
    ],
    "answer_entity_names": [
      "Presidential system",
      "Constitutional republic",
      "Federal republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1628",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b90_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b90_r ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "when was the printing press invented by gutenberg",
    "question_entity": "m.05sxt",
    "question_entity_name": "Printing press",
    "answer_entities": [
      "1440"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1791",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sxt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sxt ns:law.invention.date_of_invention ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "law.invention.date_of_invention"
    ]
  },
  {
    "question": "who did kurt warner play 4",
    "question_entity": "m.025j0c",
    "question_entity_name": "Kurt Warner",
    "answer_entities": [
      "m.02y5f_",
      "m.03m3x9z",
      "m.05bd9b5",
      "m.05gg4",
      "m.06x76",
      "m.0ws7"
    ],
    "answer_entity_names": [
      "Amsterdam Admirals",
      "Northern Iowa Panthers football",
      "Iowa Barnstormers",
      "New York Giants",
      "St. Louis Rams",
      "Arizona Cardinals"
    ],
    "hop": 2,
    "qid": "WebQTest-1435",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025j0c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025j0c ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what did hitler use to kill himself",
    "question_entity": "m.07_m9_",
    "question_entity_name": "Adolf Hitler",
    "answer_entities": [
      "m.02qnd1b",
      "m.06z5s"
    ],
    "answer_entity_names": [
      "Ballistic trauma",
      "Suicide"
    ],
    "hop": 1,
    "qid": "WebQTest-967",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "who has played lex luthor",
    "question_entity": "m.04q78",
    "question_entity_name": "Alexander Luthor",
    "answer_entities": [
      "m.01f9mq",
      "m.02p7_k",
      "m.0301bq",
      "m.039bp",
      "m.03wy70",
      "m.048lv",
      "m.04cf09",
      "m.057176",
      "m.079jd_"
    ],
    "answer_entity_names": [
      "James Marsters",
      "Powers Boothe",
      "Anthony LaPaglia",
      "Gene Hackman",
      "Clancy Brown",
      "Kevin Spacey",
      "Chris Noth",
      "Jesse Eisenberg",
      "William Hootkins"
    ],
    "hop": 2,
    "qid": "WebQTest-433",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q78)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q78 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "when did shays rebellion start",
    "question_entity": "m.0x284",
    "question_entity_name": "Shays' Rebellion",
    "answer_entities": [
      "1786"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-592",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x284)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x284 ns:time.event.start_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.start_date"
    ]
  },
  {
    "question": "what ocean is around hawaii",
    "question_entity": "m.0jbt3",
    "question_entity_name": "Hawaii",
    "answer_entities": [
      "m.05rgl"
    ],
    "answer_entity_names": [
      "Pacific Ocean"
    ],
    "hop": 1,
    "qid": "WebQTest-1622",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jbt3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jbt3 ns:geography.island.body_of_water ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "geography.island.body_of_water"
    ]
  },
  {
    "question": "what did coretta scott king died from",
    "question_entity": "m.0289jv",
    "question_entity_name": "Coretta Scott King",
    "answer_entities": [
      "m.019dmc"
    ],
    "answer_entity_names": [
      "Respiratory failure"
    ],
    "hop": 1,
    "qid": "WebQTest-1132",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0289jv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0289jv ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "who was the vice president under ronald reagan",
    "question_entity": "m.06c0j",
    "question_entity_name": "Ronald Reagan",
    "answer_entities": [
      "m.034ls"
    ],
    "answer_entity_names": [
      "George H. W. Bush"
    ],
    "hop": 1,
    "qid": "WebQTest-975",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.us_president.vice_president"
    ]
  },
  {
    "question": "who will play mr gray in the film",
    "question_entity": "m.0nfjvrm",
    "question_entity_name": "Christian Grey",
    "answer_entities": [
      "m.0fs4kv"
    ],
    "answer_entity_names": [
      "Jamie Dornan"
    ],
    "hop": 2,
    "qid": "WebQTest-51",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nfjvrm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nfjvrm ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "what race is vanessa carlton",
    "question_entity": "m.02sj66",
    "question_entity_name": "Vanessa Carlton",
    "answer_entities": [
      "m.05t0ydg",
      "m.0g6ff"
    ],
    "answer_entity_names": [
      "Scandinavians",
      "Russian"
    ],
    "hop": 1,
    "qid": "WebQTest-2006",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02sj66)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02sj66 ns:people.person.ethnicity ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.ethnicity"
    ]
  },
  {
    "question": "what is colorado technical university",
    "question_entity": "m.0c_5g9",
    "question_entity_name": "Colorado Technical University",
    "answer_entities": [
      "m.01y2hnl"
    ],
    "answer_entity_names": [
      "College/University"
    ],
    "hop": 1,
    "qid": "WebQTest-1119",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c_5g9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c_5g9 ns:common.topic.notable_types ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "common.topic.notable_types"
    ]
  },
  {
    "question": "where is audrey hepburn from",
    "question_entity": "m.0dqcm",
    "question_entity_name": "Audrey Hepburn",
    "answer_entities": [
      "m.06nz8h"
    ],
    "answer_entity_names": [
      "Ixelles"
    ],
    "hop": 1,
    "qid": "WebQTest-1063",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dqcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dqcm ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what did shakespeare become famous for",
    "question_entity": "m.081k8",
    "question_entity_name": "William Shakespeare",
    "answer_entities": [
      "m.025352",
      "m.02hrh1q",
      "m.02hv44_",
      "m.05z96",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Lyricist",
      "Actor",
      "Playwright",
      "Poet",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-316",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who were the children of king solomon",
    "question_entity": "m.070h3",
    "question_entity_name": "Solomon",
    "answer_entities": [
      "m.01qn77",
      "m.06h5t"
    ],
    "answer_entity_names": [
      "Menelik I",
      "Rehoboam"
    ],
    "hop": 1,
    "qid": "WebQTest-1667",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.070h3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.070h3 ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what city and state is yale located in",
    "question_entity": "m.08815",
    "question_entity_name": "University Yale",
    "answer_entities": [
      "m.0f2nf"
    ],
    "answer_entity_names": [
      "New Haven"
    ],
    "hop": 2,
    "qid": "WebQTest-1502",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08815)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08815 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "who founded the kkk",
    "question_entity": "m.048qr",
    "question_entity_name": "Ku Klux Klan",
    "answer_entities": [
      "m.0wl1pl9",
      "m.0wl1ptw",
      "m.0wl1py6",
      "m.0wl1pzb",
      "m.0wl1q51",
      "m.0wl1q81"
    ],
    "answer_entity_names": [
      "John C. Lester",
      "John B. Kennedy",
      "James R. Crowe",
      "Frank O. McCord",
      "Richard R. Reed",
      "J. Calvin Jones"
    ],
    "hop": 1,
    "qid": "WebQTest-929",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.048qr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.048qr ns:organization.organization.founders ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.founders"
    ]
  },
  {
    "question": "what was the cause of death for huell howser",
    "question_entity": "m.02kddt",
    "question_entity_name": "Huell Howser",
    "answer_entities": [
      "m.0m32h"
    ],
    "answer_entity_names": [
      "Prostate cancer"
    ],
    "hop": 1,
    "qid": "WebQTest-921",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02kddt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02kddt ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what is san francisco zip code",
    "question_entity": "m.0d6lp",
    "question_entity_name": "San Francisco",
    "answer_entities": [
      "m.01zn_8s",
      "m.01zn0_v",
      "m.01zn01v",
      "m.01zn02t",
      "m.01zn03_",
      "m.01zn064",
      "m.01zn0dr",
      "m.01zn0g6",
      "m.01zn0jc",
      "m.01zn0k5",
      "m.01zn0qt",
      "m.01zn0rn",
      "m.01zn0z_",
      "m.01zn119",
      "m.01zn15r",
      "m.01zn177",
      "m.01zn18q",
      "m.01zn1kn",
      "m.01zn1px",
      "m.01zn2b4",
      "m.01zn37j",
      "m.01zn4sl",
      "m.01zn6d7",
      "m.01zn6fx",
      "m.01zncnw",
      "m.01znt3g",
      "m.01znttd",
      "m.01zp0ds",
      "m.022r0__",
      "m.02hqw2g",
      "m.02hqwhk",
      "m.03dnjvp",
      "m.03dnjw2",
      "m.07nq03w",
      "m.07nq042",
      "m.07nq049",
      "m.07nq04j",
      "m.07nq04r",
      "m.07nq04z",
      "m.07nq055",
      "m.07nq05d",
      "m.07nq05m",
      "m.07nq05v",
      "m.07nq061",
      "m.07nq068",
      "m.07nq06h",
      "m.07nq06q",
      "m.07nq06y",
      "m.07nq074",
      "m.07nq07c",
      "m.07nq07l",
      "m.07nq07t",
      "m.07nq080",
      "m.07nq087",
      "m.07nq08g",
      "m.07nq08p",
      "m.07nq08x",
      "m.07nq093",
      "m.07nq09b",
      "m.07nq09k",
      "m.0gtjrnv",
      "m.0wrh466"
    ],
    "answer_entity_names": [
      "94119",
      "94108",
      "94133",
      "94103",
      "94107",
      "94114",
      "94104",
      "94118",
      "94102",
      "94122",
      "94110",
      "94123",
      "94124",
      "94115",
      "94101",
      "94121",
      "94117",
      "94111",
      "94131",
      "94112",
      "94105",
      "94146",
      "94132",
      "94127",
      "94128",
      "94118-3208",
      "94116",
      "94134",
      "94109",
      "94102-4733",
      "94158",
      "94129",
      "94130",
      "94199",
      "94188",
      "94177",
      "94172",
      "94171",
      "94164",
      "94163",
      "94162",
      "94161",
      "94160",
      "94159",
      "94156",
      "94154",
      "94153",
      "94151",
      "94147",
      "94145",
      "94144",
      "94143",
      "94142",
      "94141",
      "94140",
      "94139",
      "94137",
      "94126",
      "94125",
      "94120",
      "94117-2212",
      "94107-7621"
    ],
    "hop": 1,
    "qid": "WebQTest-761",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6lp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6lp ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what year was kenya moore crowned miss usa",
    "question_entity": "m.03lp2g",
    "question_entity_name": "Miss USA",
    "answer_entities": [
      "m.02vmzrl"
    ],
    "answer_entity_names": [
      "Miss USA 1993"
    ],
    "hop": 1,
    "qid": "WebQTest-683",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03lp2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03lp2g ns:time.recurring_event.instances ?x .\n?x ns:award.competition.winner ns:m.08cpnf .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.recurring_event.instances"
    ]
  },
  {
    "question": "what degree did martin luther king earn",
    "question_entity": "m.051cc",
    "question_entity_name": "Martin Luther King, Jr.",
    "answer_entities": [
      "m.014mlp",
      "m.04zx3q1",
      "m.05vjnk",
      "m.079h0"
    ],
    "answer_entity_names": [
      "Bachelor of Arts",
      "PhD",
      "Bachelor of Divinity",
      "Secondary education"
    ],
    "hop": 2,
    "qid": "WebQTest-1343",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.degree ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.degree"
    ]
  },
  {
    "question": "what are the school colors for harvard university",
    "question_entity": "m.03ksy",
    "question_entity_name": "Harvard University",
    "answer_entities": [
      "m.01jnf1"
    ],
    "answer_entity_names": [
      "Crimson"
    ],
    "hop": 1,
    "qid": "WebQTest-397",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ksy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ksy ns:education.educational_institution.colors ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "education.educational_institution.colors"
    ]
  },
  {
    "question": "where did eleanor roosevelt die",
    "question_entity": "m.02n9k",
    "question_entity_name": "Eleanor Roosevelt",
    "answer_entities": [
      "m.0cc56"
    ],
    "answer_entity_names": [
      "Manhattan"
    ],
    "hop": 1,
    "qid": "WebQTest-60",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02n9k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02n9k ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where did abraham and his descendants live",
    "question_entity": "m.0pwb",
    "question_entity_name": "Abraham",
    "answer_entities": [
      "m.0524v",
      "m.0d9f2"
    ],
    "answer_entity_names": [
      "Mesopotamia",
      "Canaan"
    ],
    "hop": 2,
    "qid": "WebQTest-1080",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pwb ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "what timezone is tucson arizona in right now",
    "question_entity": "m.0fr0t",
    "question_entity_name": "Tucson",
    "answer_entities": [
      "m.02hczc"
    ],
    "answer_entity_names": [
      "Mountain Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-717",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fr0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fr0t ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what is there to see in sydney australia",
    "question_entity": "m.06y57",
    "question_entity_name": "Sydney",
    "answer_entities": [
      "m.0_ymvs4",
      "m.01rfyc",
      "m.01xlnqr",
      "m.020772",
      "m.0261k3j",
      "m.02kwln",
      "m.02q0lr",
      "m.02x0jgm",
      "m.02x7mq",
      "m.040sd3",
      "m.04dxfg",
      "m.05115h",
      "m.06_nm",
      "m.0701q",
      "m.0b8fsx",
      "m.0cj82q",
      "m.0hddw",
      "m.0j2r2w2",
      "m.0j65cht",
      "m.0pnrn"
    ],
    "answer_entity_names": [
      "Oatley Park, New South Wales",
      "Port Jackson",
      "Rose Seidler House",
      "Bondi Beach",
      "Wild Life Sydney",
      "Sydney Film Festival",
      "The Rocks",
      "Sydney Markets",
      "Powerhouse Museum",
      "Luna Park Sydney",
      "City2Surf",
      "St Mary's Cathedral, Sydney",
      "Sydney Opera House",
      "Sydney Harbour Bridge",
      "North Head Quarantine Station",
      "Hillsong Church",
      "Darling Harbour",
      "Australian National Maritime Museum",
      "Featherdale Wildlife Park",
      "Kamay Botany Bay National Park"
    ],
    "hop": 1,
    "qid": "WebQTest-723",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06y57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06y57 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what year does hitler die",
    "question_entity": "m.07_m9_",
    "question_entity_name": "Adolf Hitler",
    "answer_entities": [
      "1945-04-30"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-379",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:people.deceased_person.date_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.date_of_death"
    ]
  },
  {
    "question": "where did queensland get its name from",
    "question_entity": "m.0g39h",
    "question_entity_name": "Queensland",
    "answer_entities": [
      "m.0cw10"
    ],
    "answer_entity_names": [
      "Queen Victoria"
    ],
    "hop": 1,
    "qid": "WebQTest-167",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g39h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g39h ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "symbols.namesake.named_after"
    ]
  },
  {
    "question": "what did general robert e lee die from",
    "question_entity": "m.06f5j",
    "question_entity_name": "Robert E. Lee",
    "answer_entities": [
      "m.0dq9p"
    ],
    "answer_entity_names": [
      "Pneumonia"
    ],
    "hop": 1,
    "qid": "WebQTest-709",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06f5j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06f5j ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  }
]