[
  {
    "question": "what has kristen stewart acted in",
    "question_entity": "m.07swvb",
    "question_entity_name": "Kristen Stewart",
    "answer_entities": [
      "m.0_g812d",
      "m.0_vl_q6",
      "m.0133dmyj",
      "m.0295m6",
      "m.029xhb",
      "m.02nhxs",
      "m.02rj2v7",
      "m.02rx2m5",
      "m.02wgbb",
      "m.02z8bfh",
      "m.03c7twt",
      "m.03nm_fh",
      "m.04q86tb",
      "m.04ynd_",
      "m.05b3kq9",
      "m.05p5m5f",
      "m.05pdh86",
      "m.05q7874",
      "m.06wjwv",
      "m.075wx7_",
      "m.075wx89",
      "m.08ldl8",
      "m.09bw4_",
      "m.09qs_s",
      "m.0b6hmnc",
      "m.0cp0t91",
      "m.0cty5n",
      "m.0d5jxc",
      "m.0djz0rc",
      "m.0fjckn",
      "m.0g5qs2k",
      "m.0n4n1y_",
      "m.0w06pqf",
      "m.0w06rkh",
      "m.0w1zl9t",
      "m.0ywy_65",
      "m.0ywy9pl"
    ],
    "answer_entity_names": [
      "Still Alice",
      "Equals",
      "Billy Lynn's Long Halftime Walk",
      "Catch That Kid",
      "Panic Room",
      "Speak",
      "What Just Happened",
      "Into the Wild",
      "The Flintstones in Viva Rock Vegas",
      "Fierce People",
      "Adventureland",
      "Twilight",
      "Welcome to the Rileys",
      "Cold Creek Manor",
      "Cutlass",
      "The Cake Eaters",
      "The Twilight Saga: New Moon",
      "The Runaways",
      "The Thirteenth Year",
      "Eclipse",
      "The Twilight Saga: Breaking Dawn - Part 1",
      "Undertow",
      "Jumper",
      "Zathura",
      "The Yellow Handkerchief",
      "On the Road",
      "The Safety of Objects",
      "The Messengers",
      "The Twilight Saga: Breaking Dawn - Part 2",
      "In the Land of Women",
      "Snow White and the Huntsman",
      "Snow White and the Huntsman 2",
      "The Big Shoe",
      "Clouds of Sils Maria",
      "Camp X-Ray",
      "American Ultra",
      "Anesthesia"
    ],
    "hop": 2,
    "qid": "WebQTest-668",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07swvb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07swvb ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what language do they in ghana",
    "question_entity": "m.035dk",
    "question_entity_name": "Ghana",
    "answer_entities": [
      "m.01_lfh",
      "m.01kphj",
      "m.02h40lc",
      "m.02hw_03",
      "m.02hwm3m",
      "m.02hx8z6",
      "m.02j199",
      "m.02vkpsr",
      "m.04wm85",
      "m.05781j",
      "m.05n7jk",
      "m.08r4hf"
    ],
    "answer_entity_names": [
      "Asante dialect",
      "Ga Language",
      "English Language",
      "Akan Language",
      "Kasem Language",
      "Nzema Language",
      "Éwé Language",
      "Dagaare language",
      "Dagbani Language",
      "Dangme Language",
      "Fula language",
      "Gonja Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1335",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035dk ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where did kate gosselin grew up",
    "question_entity": "m.05qbc_9",
    "question_entity_name": "Kate Gosselin",
    "answer_entities": [
      "m.0dclg"
    ],
    "answer_entity_names": [
      "Philadelphia"
    ],
    "hop": 1,
    "qid": "WebQTest-1281",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qbc_9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qbc_9 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where is the time zone line in south dakota",
    "question_entity": "m.06mz5",
    "question_entity_name": "South Dakota",
    "answer_entities": [
      "m.02fqwt",
      "m.02hczc"
    ],
    "answer_entity_names": [
      "Central Time Zone",
      "Mountain Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-439",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mz5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mz5 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "which island is kailua on",
    "question_entity": "m.0r_x0",
    "question_entity_name": "Kailua",
    "answer_entities": [
      "m.0dfcn"
    ],
    "answer_entity_names": [
      "Oahu"
    ],
    "hop": 1,
    "qid": "WebQTest-1992",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r_x0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r_x0 ns:location.location.containedby ?x .\n?x ns:geography.island.island_group ns:m.014wxc .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where does name pennsylvania come from",
    "question_entity": "m.05tbn",
    "question_entity_name": "Pennsylvania",
    "answer_entities": [
      "m.03br25"
    ],
    "answer_entity_names": [
      "William Penn"
    ],
    "hop": 1,
    "qid": "WebQTest-480",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tbn ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "symbols.namesake.named_after"
    ]
  },
  {
    "question": "where are the gobi desert located on a map",
    "question_entity": "m.0ff0d",
    "question_entity_name": "Gobi Desert",
    "answer_entities": [
      "m.04w8f"
    ],
    "answer_entity_names": [
      "Mongolia"
    ],
    "hop": 1,
    "qid": "WebQTest-216",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ff0d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ff0d ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where was franz ferdinand from",
    "question_entity": "m.02ft60",
    "question_entity_name": "Franz Ferdinand",
    "answer_entities": [
      "m.0hyxv"
    ],
    "answer_entity_names": [
      "Glasgow"
    ],
    "hop": 1,
    "qid": "WebQTest-1705",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ft60)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ft60 ns:music.artist.origin ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.origin"
    ]
  },
  {
    "question": "who wrote st trinians",
    "question_entity": "m.01nxmb",
    "question_entity_name": "St Trinian's School",
    "answer_entities": [
      "m.01v2jh"
    ],
    "answer_entity_names": [
      "Ronald Searle"
    ],
    "hop": 1,
    "qid": "WebQTest-1626",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01nxmb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01nxmb ns:fictional_universe.fictional_universe.created_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "fictional_universe.fictional_universe.created_by"
    ]
  },
  {
    "question": "what nationality is rihanna",
    "question_entity": "m.06mt91",
    "question_entity_name": "Rihanna",
    "answer_entities": [
      "m.0162v"
    ],
    "answer_entity_names": [
      "Barbados"
    ],
    "hop": 1,
    "qid": "WebQTest-1219",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "what are the 7 countries that are part of central america",
    "question_entity": "m.01tzh",
    "question_entity_name": "Central America",
    "answer_entities": [
      "m.0164b",
      "m.01p8s",
      "m.02k8k",
      "m.0345_",
      "m.03h2c",
      "m.05qx1",
      "m.0dkz7x"
    ],
    "answer_entity_names": [
      "Belize",
      "Costa Rica",
      "El Salvador",
      "Guatemala",
      "Honduras",
      "Panama",
      "Gran Colombia"
    ],
    "hop": 1,
    "qid": "WebQTest-576",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tzh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.contains"
    ]
  },
  {
    "question": "what is the best currency to take to turkey",
    "question_entity": "m.01znc_",
    "question_entity_name": "Turkey",
    "answer_entities": [
      "m.04dq0w"
    ],
    "answer_entity_names": [
      "Turkish lira"
    ],
    "hop": 1,
    "qid": "WebQTest-508",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01znc_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01znc_ ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what type of art did pablo picasso paint",
    "question_entity": "m.060_7",
    "question_entity_name": "Pablo Picasso",
    "answer_entities": [
      "m.015r61",
      "m.070vcg",
      "m.071bmq",
      "m.072333",
      "m.073_6",
      "m.07hm5p",
      "m.07pcpz",
      "m.09ff3"
    ],
    "answer_entity_names": [
      "Modern art",
      "Analytic cubism",
      "Picasso's Rose Period",
      "Picasso's Blue Period",
      "Surrealism",
      "Picasso's African Period",
      "Synthetic cubism",
      "Cubism"
    ],
    "hop": 1,
    "qid": "WebQTest-939",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060_7 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "where did the taliban began",
    "question_entity": "m.07jqh",
    "question_entity_name": "Taliban",
    "answer_entities": [
      "m.0jdd"
    ],
    "answer_entity_names": [
      "Afghanistan"
    ],
    "hop": 1,
    "qid": "WebQTest-622",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07jqh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07jqh ns:organization.organization.geographic_scope ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.geographic_scope"
    ]
  },
  {
    "question": "when was abe lincoln president",
    "question_entity": "m.0gzh",
    "question_entity_name": "Abraham Lincoln",
    "answer_entities": [
      "m.05brd51",
      "m.05brd5c"
    ],
    "answer_entity_names": [
      "Abraham Lincoln 1861 presidential inauguration",
      "Abraham Lincoln 1865 presidential inauguration"
    ],
    "hop": 1,
    "qid": "WebQTest-561",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:base.inaugurations.inauguration_speaker.inauguration ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.inaugurations.inauguration_speaker.inauguration"
    ]
  },
  {
    "question": "who was tupac signed to",
    "question_entity": "m.07pzc",
    "question_entity_name": "Tupac Shakur",
    "answer_entities": [
      "m.01n2m6",
      "m.01trtc",
      "m.076702"
    ],
    "answer_entity_names": [
      "Death Row Records",
      "Interscope Records",
      "Amaru Entertainment"
    ],
    "hop": 1,
    "qid": "WebQTest-744",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:music.artist.label ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.label"
    ]
  },
  {
    "question": "what is the milwaukee brewers mascot",
    "question_entity": "m.051vz",
    "question_entity_name": "Milwaukee Brewers",
    "answer_entities": [
      "m.0100sszz",
      "m.049kl_",
      "m.0blvgb"
    ],
    "answer_entity_names": [
      "Hank",
      "Bernie Brewer",
      "Bonnie Brewer"
    ],
    "hop": 1,
    "qid": "WebQTest-534",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051vz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051vz ns:sports.sports_team.team_mascot ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.team_mascot"
    ]
  },
  {
    "question": "what style of music does michael jackson perform",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.021_z5",
      "m.025sc50",
      "m.026z9",
      "m.02bqnt",
      "m.02lkt",
      "m.02lnbg",
      "m.02vjzr",
      "m.02x8m",
      "m.03c34yl",
      "m.05bt6j",
      "m.064t9",
      "m.06by7",
      "m.06j6l",
      "m.0ggx5q",
      "m.0gywn"
    ],
    "answer_entity_names": [
      "New jack swing",
      "Contemporary R&B",
      "Disco",
      "Motown Sound",
      "Electronic music",
      "Dance-pop",
      "Adult contemporary music",
      "Funk",
      "Post-disco",
      "Pop rock",
      "Pop music",
      "Rock music",
      "Rhythm and blues",
      "Dance music",
      "Soul music"
    ],
    "hop": 1,
    "qid": "WebQTest-531",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what did vera ellen die from",
    "question_entity": "m.022sm6",
    "question_entity_name": "Vera-Ellen",
    "answer_entities": [
      "m.0qcr0"
    ],
    "answer_entity_names": [
      "Cancer"
    ],
    "hop": 1,
    "qid": "WebQTest-850",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.022sm6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.022sm6 ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what county is st paul minnesota in",
    "question_entity": "m.0b2lw",
    "question_entity_name": "Saint Paul",
    "answer_entities": [
      "m.0nh57"
    ],
    "answer_entity_names": [
      "Ramsey County"
    ],
    "hop": 1,
    "qid": "WebQTest-1701",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b2lw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b2lw ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpym_ .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "who was anakin skywalker",
    "question_entity": "g.125_cxx77",
    "question_entity_name": "Anakin Skywalker",
    "answer_entities": [
      "m.0jzmgh"
    ],
    "answer_entity_names": [
      "Ted Bracewell"
    ],
    "hop": 2,
    "qid": "WebQTest-521",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:g.125_cxx77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:g.125_cxx77 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "who played on the jeffersons",
    "question_entity": "m.02f8jf",
    "question_entity_name": "The Jeffersons",
    "answer_entities": [
      "m.02_yyp",
      "m.02_z06",
      "m.0279gxy",
      "m.0279gyz",
      "m.03h436",
      "m.03k25c",
      "m.03zwg4",
      "m.06b_nc",
      "m.0c6b4y",
      "m.0clm34",
      "m.0gydmc"
    ],
    "answer_entity_names": [
      "Sherman Hemsley",
      "Isabel Sanford",
      "Damon Evans",
      "Berlinda Tolbert",
      "Roxie Roker",
      "Zara Cully",
      "Marla Gibbs",
      "Franklin Cover",
      "Paul Benedict",
      "Mike Evans",
      "Jay Hammer"
    ],
    "hop": 2,
    "qid": "WebQTest-90",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02f8jf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02f8jf ns:tv.tv_program.regular_cast ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_program.regular_cast",
      "tv.regular_tv_appearance.actor"
    ]
  },
  {
    "question": "what was firefox programmed in",
    "question_entity": "m.01dyhm",
    "question_entity_name": "Firefox",
    "answer_entities": [
      "m.011y70",
      "m.015tjh",
      "m.02p97",
      "m.03cjm6",
      "m.0jgqg"
    ],
    "answer_entity_names": [
      "XUL",
      "Cascading Style Sheets",
      "JavaScript",
      "XBL",
      "C++"
    ],
    "hop": 1,
    "qid": "WebQTest-664",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dyhm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dyhm ns:computer.software.languages_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "computer.software.languages_used"
    ]
  },
  {
    "question": "what team did drogba play for",
    "question_entity": "m.03_y2f",
    "question_entity_name": "Didier Drogba",
    "answer_entities": [
      "m.023fb",
      "m.02gys2",
      "m.040pyq",
      "m.04kd5d",
      "m.05nwfr",
      "m.0690ct",
      "m.06zpgb2"
    ],
    "answer_entity_names": [
      "Chelsea F.C.",
      "Olympique de Marseille",
      "Ivory Coast national football team",
      "Shanghai Greenland Shenhua F.C.",
      "En Avant de Guingamp",
      "Le Mans FC",
      "Galatasaray S.K."
    ],
    "hop": 2,
    "qid": "WebQTest-1976",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_y2f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_y2f ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what language do people from bosnia speak",
    "question_entity": "m.0166b",
    "question_entity_name": "Bosnia and Herzegovina",
    "answer_entities": [
      "m.06x8y",
      "m.0k0sb"
    ],
    "answer_entity_names": [
      "Serbo-Croatian Language",
      "Serbian language"
    ],
    "hop": 1,
    "qid": "WebQTest-874",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what tv shows did shawnee smith play in",
    "question_entity": "m.06t3nj",
    "question_entity_name": "Shawnee Smith",
    "answer_entities": [
      "m.012kcrc2",
      "m.033d80",
      "m.04yc_fw",
      "m.051yg69",
      "m.07cdxwj",
      "m.07chqg3",
      "m.09fc83",
      "m.0gvvdpf",
      "m.0j635r0"
    ],
    "answer_entity_names": [
      "Brand New Life",
      "Becker",
      "Scream Queens",
      "30 Days of Night: Dust to Dust",
      "The Tom Show",
      "All is Forgiven",
      "The Stand",
      "Arsenio",
      "Anger Management"
    ],
    "hop": 2,
    "qid": "WebQTest-262",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t3nj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t3nj ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_actor.starring_roles",
      "tv.regular_tv_appearance.series"
    ]
  },
  {
    "question": "where is the arizona cardinals stadium located",
    "question_entity": "m.0ws7",
    "question_entity_name": "Arizona Cardinals",
    "answer_entities": [
      "m.0vmt"
    ],
    "answer_entity_names": [
      "Arizona"
    ],
    "hop": 1,
    "qid": "WebQTest-1570",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ws7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ws7 ns:sports.sports_team.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.location"
    ]
  },
  {
    "question": "where is tupac from originally",
    "question_entity": "m.07pzc",
    "question_entity_name": "Tupac Shakur",
    "answer_entities": [
      "m.02cx_2"
    ],
    "answer_entity_names": [
      "East Harlem"
    ],
    "hop": 1,
    "qid": "WebQTest-1178",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what school does james franco go to",
    "question_entity": "m.05bnp0",
    "question_entity_name": "James Franco",
    "answer_entities": [
      "m.01vg13",
      "m.025rrjh",
      "m.02s62q",
      "m.03ysv6",
      "m.04b_46",
      "m.04lh_5",
      "m.08815",
      "m.09f2j"
    ],
    "answer_entity_names": [
      "Brooklyn College",
      "Columbia University School of the Arts",
      "Rhode Island School of Design",
      "Warren Wilson College",
      "Tisch School of the Arts",
      "Palo Alto High School",
      "University Yale",
      "University of California, Los Angeles"
    ],
    "hop": 2,
    "qid": "WebQTest-1542",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bnp0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bnp0 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what was nikola tesla inventions",
    "question_entity": "m.05d1y",
    "question_entity_name": "Nikola Tesla",
    "answer_entities": [
      "m.01s499",
      "m.02p196m",
      "m.08262",
      "m.09pf_",
      "m.09rh1",
      "m.0bt33",
      "m.0qjjc"
    ],
    "answer_entity_names": [
      "Neon lamp",
      "Induction motor",
      "Wireless telegraphy",
      "Three-phase electric power",
      "Tesla coil",
      "Alternating current",
      "Remote control"
    ],
    "hop": 1,
    "qid": "WebQTest-246",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05d1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05d1y ns:law.inventor.inventions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "law.inventor.inventions"
    ]
  },
  {
    "question": "who was the son of king leonidas",
    "question_entity": "m.0nb2t",
    "question_entity_name": "Leonidas I",
    "answer_entities": [
      "m.063sr6"
    ],
    "answer_entity_names": [
      "Pleistarchus"
    ],
    "hop": 1,
    "qid": "WebQTest-1773",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nb2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nb2t ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what language did the ancient babylonians speak",
    "question_entity": "m.0cn3b",
    "question_entity_name": "Babylonia",
    "answer_entities": [
      "m.0dc0d"
    ],
    "answer_entity_names": [
      "Akkadian language"
    ],
    "hop": 1,
    "qid": "WebQTest-1876",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cn3b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cn3b ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what city was michael jackson born in",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.03b12"
    ],
    "answer_entity_names": [
      "Gary"
    ],
    "hop": 1,
    "qid": "WebQTest-1796",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "who are serena williams parents",
    "question_entity": "m.015z4j",
    "question_entity_name": "Serena Williams",
    "answer_entities": [
      "m.05p91sl",
      "m.067rnv"
    ],
    "answer_entity_names": [
      "Oracene Price",
      "Richard Williams"
    ],
    "hop": 1,
    "qid": "WebQTest-919",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015z4j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015z4j ns:people.person.parents ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what type of books did agatha christie wrote",
    "question_entity": "m.0ldd",
    "question_entity_name": "Agatha Christie",
    "answer_entities": [
      "m.02hv44_",
      "m.02xhgwq",
      "m.05z96",
      "m.0cbd2",
      "m.0dxtg"
    ],
    "answer_entity_names": [
      "Playwright",
      "Novelist",
      "Poet",
      "Writer",
      "Screenwriter"
    ],
    "hop": 1,
    "qid": "WebQTest-134",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ldd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ldd ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what did charles babbage discover",
    "question_entity": "m.01qmz",
    "question_entity_name": "Charles Babbage",
    "answer_entities": [
      "m.029wv",
      "m.0nf_"
    ],
    "answer_entity_names": [
      "Difference engine",
      "Analytical Engine"
    ],
    "hop": 1,
    "qid": "WebQTest-1917",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qmz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qmz ns:law.inventor.inventions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "law.inventor.inventions"
    ]
  },
  {
    "question": "what did romo do",
    "question_entity": "m.04cyz8g",
    "question_entity_name": "Sergio Romo",
    "answer_entities": [
      "m.02h664g"
    ],
    "answer_entity_names": [
      "Baseball player"
    ],
    "hop": 1,
    "qid": "WebQTest-1266",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04cyz8g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04cyz8g ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what did lincoln steffens wrote",
    "question_entity": "m.01bw1c",
    "question_entity_name": "Lincoln Steffens",
    "answer_entities": [
      "m.068tvkv",
      "m.069h7f0",
      "m.06bhsc3",
      "m.06bsl_5",
      "m.06f67r1",
      "m.06gqt1t",
      "m.06lr_pz",
      "m.06mv_gp",
      "m.06t_tbs",
      "m.06tdgyp",
      "m.06vgjfz",
      "m.0c1xh9z",
      "m.0l6bpv3"
    ],
    "answer_entity_names": [
      "Die Geschichte meines Lebens",
      "The Shame of the Cities",
      "The autobiography of Lincoln Steffens",
      "John Reed",
      "The struggle for self-government",
      "Lincoln Steffens speaking",
      "The world of Lincoln Steffens",
      "Into Mexico and out",
      "Moses in red",
      "The Least Of These",
      "Upbuilders",
      "Boy on horseback",
      "The Old Jim Horse"
    ],
    "hop": 1,
    "qid": "WebQTest-1825",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bw1c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bw1c ns:book.author.works_written ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.author.works_written"
    ]
  },
  {
    "question": "where is mission san buenaventura located",
    "question_entity": "m.0gbsb",
    "question_entity_name": "Mission San Buenaventura",
    "answer_entities": [
      "m.01zs2h_",
      "m.0l38x"
    ],
    "answer_entity_names": [
      "93001",
      "Ventura County"
    ],
    "hop": 1,
    "qid": "WebQTest-157",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbsb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbsb ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  }
]