[
  {
    "question": "where did jay moriarty die",
    "question_entity": "m.04jswm8",
    "question_entity_name": "Jay Moriarty",
    "answer_entities": [
      "m.04ty8"
    ],
    "answer_entity_names": [
      "Maldives"
    ],
    "hop": 1,
    "qid": "WebQTest-1268",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jswm8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jswm8 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what does australia use for currency",
    "question_entity": "m.0chghy",
    "question_entity_name": "Australia",
    "answer_entities": [
      "m.0kz1h"
    ],
    "answer_entity_names": [
      "Australian dollar"
    ],
    "hop": 1,
    "qid": "WebQTest-264",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what does kim kardashian work as",
    "question_entity": "m.0261x8t",
    "question_entity_name": "Kim Kardashian",
    "answer_entities": [
      "m.012t_z",
      "m.02hqyhw",
      "m.02hrh1q",
      "m.03gjzk",
      "m.03gkb0",
      "m.09x_r",
      "m.0d1pc",
      "m.0dypbr"
    ],
    "answer_entity_names": [
      "Businessperson",
      "Fashion designer",
      "Actor",
      "Television producer",
      "Socialite",
      "Entrepreneur",
      "Model",
      "TV Personality"
    ],
    "hop": 1,
    "qid": "WebQTest-1199",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261x8t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261x8t ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where is mt st helens located",
    "question_entity": "m.094xz",
    "question_entity_name": "Mount St. Helens",
    "answer_entities": [
      "m.059g4",
      "m.081yw",
      "m.09c7w0",
      "m.0k3nk",
      "m.0mly4"
    ],
    "answer_entity_names": [
      "North America",
      "Washington",
      "United States of America",
      "Cascade Range",
      "Skamania County"
    ],
    "hop": 1,
    "qid": "WebQTest-1700",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.094xz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.094xz ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where was martin luther king jr buried",
    "question_entity": "m.051cc",
    "question_entity_name": "Martin Luther King, Jr.",
    "answer_entities": [
      "m.050my1"
    ],
    "answer_entity_names": [
      "Martin Luther King, Jr. National Historic Site"
    ],
    "hop": 1,
    "qid": "WebQTest-1767",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.deceased_person.place_of_burial ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_burial"
    ]
  },
  {
    "question": "what other movies has ryan gosling been in",
    "question_entity": "m.03m6_z",
    "question_entity_name": "Ryan Gosling",
    "answer_entities": [
      "g.11by0vcm_y",
      "m.01262msv",
      "m.023gxx",
      "m.026k37r",
      "m.02x0fs9",
      "m.02x18l",
      "m.043k1_h",
      "m.047tsx3",
      "m.04j1bgz",
      "m.0583wk",
      "m.05ft32",
      "m.08gv6s",
      "m.093d8j0",
      "m.0cyn0z",
      "m.0d78m2r",
      "m.0ddf2bm",
      "m.0dgrqg",
      "m.0dryx2",
      "m.0g4vmj8",
      "m.0gg5qcw",
      "m.0gx997r",
      "m.0gx999d",
      "m.0gx99m8",
      "m.0nh4bl2",
      "m.0v_c6kv",
      "m.0y4qznp",
      "m.0z8ngl9"
    ],
    "answer_entity_names": [
      "The Big Short",
      "The Nice Guys",
      "Remember the Titans",
      "Fracture",
      "Lars and the Real Girl",
      "Murder by Numbers",
      "All Good Things",
      "The Notebook",
      "Nothing Too Good for a Cowboy",
      "The United States of Leland",
      "The Believer",
      "Stay",
      "Blue Valentine",
      "The Slaughter Rule",
      "I'm Still Here: Real Diaries of Young People Who Lived During the Holocaust",
      "Crazy, Stupid, Love.",
      "Half Nelson",
      "Logan's Run",
      "Drive",
      "The Ides of March",
      "Gangster Squad",
      "The Place Beyond the Pines",
      "Only God Forgives",
      "Weightless",
      "Drunk History Christmas - Feat. Ryan Gosling, Jim Carrey & Eva Mendes",
      "The Unbelievables",
      "Touch of Evil"
    ],
    "hop": 2,
    "qid": "WebQTest-649",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03m6_z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03m6_z ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what language is spoken in greek",
    "question_entity": "m.035qy",
    "question_entity_name": "Greece",
    "answer_entities": [
      "m.012v8",
      "m.0349s"
    ],
    "answer_entity_names": [
      "Albanian language",
      "Greek Language"
    ],
    "hop": 1,
    "qid": "WebQTest-726",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where did theodor schwann get his education",
    "question_entity": "m.040000",
    "question_entity_name": "Theodor Schwann",
    "answer_entities": [
      "m.01stzp",
      "m.03563j",
      "m.0m7yh"
    ],
    "answer_entity_names": [
      "Humboldt University of Berlin",
      "University of Würzburg",
      "University of Bonn"
    ],
    "hop": 2,
    "qid": "WebQTest-1732",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040000)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040000 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "where do the appalachian mountains run",
    "question_entity": "m.0lm0n",
    "question_entity_name": "Appalachian Mountains",
    "answer_entities": [
      "m.059g4"
    ],
    "answer_entity_names": [
      "North America"
    ],
    "hop": 1,
    "qid": "WebQTest-1619",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lm0n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lm0n ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what state is mount st. helens in",
    "question_entity": "m.094xz",
    "question_entity_name": "Mount St. Helens",
    "answer_entities": [
      "m.081yw"
    ],
    "answer_entity_names": [
      "Washington"
    ],
    "hop": 1,
    "qid": "WebQTest-225",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.094xz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.094xz ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what is the zip code for newark california",
    "question_entity": "m.0qx_6",
    "question_entity_name": "Newark",
    "answer_entities": [
      "m.01zjg6s"
    ],
    "answer_entity_names": [
      "94560"
    ],
    "hop": 1,
    "qid": "WebQTest-797",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qx_6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qx_6 ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "where is the seat of the african union",
    "question_entity": "m.0gkjy",
    "question_entity_name": "African Union",
    "answer_entities": [
      "m.0dttf"
    ],
    "answer_entity_names": [
      "Addis Ababa"
    ],
    "hop": 2,
    "qid": "WebQTest-1784",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gkjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gkjy ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what makes elvis presley famous",
    "question_entity": "m.02jq1",
    "question_entity_name": "Elvis Presley",
    "answer_entities": [
      "m.02hrh1q",
      "m.099md",
      "m.09jwl",
      "m.09l65"
    ],
    "answer_entity_names": [
      "Actor",
      "Soldier",
      "Musician",
      "Singer"
    ],
    "hop": 1,
    "qid": "WebQTest-367",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what is the national language of iran",
    "question_entity": "m.03shp",
    "question_entity_name": "Iran",
    "answer_entities": [
      "m.032f6"
    ],
    "answer_entity_names": [
      "Persian Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1754",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03shp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03shp ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what language do most australians speak",
    "question_entity": "m.0chghy",
    "question_entity_name": "Australia",
    "answer_entities": [
      "m.02h40lc",
      "m.02jcw",
      "m.04gd7"
    ],
    "answer_entity_names": [
      "English Language",
      "Esperanto Language",
      "Lojban"
    ],
    "hop": 1,
    "qid": "WebQTest-513",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where are the sahara desert located",
    "question_entity": "m.01w1vt",
    "question_entity_name": "Sahara",
    "answer_entities": [
      "m.05g2v"
    ],
    "answer_entity_names": [
      "North Africa"
    ],
    "hop": 1,
    "qid": "WebQTest-1776",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w1vt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w1vt ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what did jesse owens won",
    "question_entity": "m.0cmr3",
    "question_entity_name": "Jesse Owens",
    "answer_entities": [
      "m.04kc5dv"
    ],
    "answer_entity_names": [
      "Associated Press Male Athlete of the Year"
    ],
    "hop": 2,
    "qid": "WebQTest-1350",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmr3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmr3 ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "award.award_winner.awards_won",
      "award.award_honor.award"
    ]
  },
  {
    "question": "who invented islamic religion",
    "question_entity": "m.0flw86",
    "question_entity_name": "Islam",
    "answer_entities": [
      "m.04s9n"
    ],
    "answer_entity_names": [
      "Muhammad in Islam"
    ],
    "hop": 1,
    "qid": "WebQTest-1524",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.founding_figures ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "religion.religion.founding_figures"
    ]
  },
  {
    "question": "who was queen isabella 's mother",
    "question_entity": "m.0jd6m",
    "question_entity_name": "Isabella I of Castile",
    "answer_entities": [
      "m.0d18m0"
    ],
    "answer_entity_names": [
      "Isabella of Portugal, Queen of Castile"
    ],
    "hop": 1,
    "qid": "WebQTest-1586",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jd6m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jd6m ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what county is san diego ca",
    "question_entity": "m.071vr",
    "question_entity_name": "San Diego",
    "answer_entities": [
      "m.0l2rj"
    ],
    "answer_entity_names": [
      "San Diego County"
    ],
    "hop": 1,
    "qid": "WebQTest-962",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.071vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.071vr ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what shows are shot in new york",
    "question_entity": "m.02_286",
    "question_entity_name": "New York City",
    "answer_entities": [
      "m.02rkkn1",
      "m.07chq93",
      "m.09fc83",
      "m.0n3k5nh"
    ],
    "answer_entity_names": [
      "Flight of the Conchords",
      "Both Sides",
      "The Stand",
      "Trial Heat"
    ],
    "hop": 1,
    "qid": "WebQTest-381",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02_286)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02_286 ns:tv.tv_location.tv_shows_filmed_here ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_location.tv_shows_filmed_here"
    ]
  },
  {
    "question": "what position did lebron james play",
    "question_entity": "m.01jz6d",
    "question_entity_name": "LeBron James",
    "answer_entities": [
      "m.01pv51",
      "m.0355dz",
      "m.03ww62"
    ],
    "answer_entity_names": [
      "Power forward",
      "Small forward",
      "Point forward"
    ],
    "hop": 1,
    "qid": "WebQTest-1806",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jz6d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jz6d ns:basketball.basketball_player.position_s ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "basketball.basketball_player.position_s"
    ]
  },
  {
    "question": "what kind of disease does montel williams have",
    "question_entity": "m.018ptv",
    "question_entity_name": "Montel Williams",
    "answer_entities": [
      "m.0dcqh"
    ],
    "answer_entity_names": [
      "Multiple sclerosis"
    ],
    "hop": 1,
    "qid": "WebQTest-593",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.018ptv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.018ptv ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "medicine.notable_person_with_medical_condition.condition"
    ]
  },
  {
    "question": "what was the cause of death for bruce lee",
    "question_entity": "m.099d4",
    "question_entity_name": "Bruce Lee",
    "answer_entities": [
      "m.0219bz"
    ],
    "answer_entity_names": [
      "Cerebral edema"
    ],
    "hop": 1,
    "qid": "WebQTest-249",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.099d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.099d4 ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what kind of government is mali",
    "question_entity": "m.04v09",
    "question_entity_name": "Mali",
    "answer_entities": [
      "m.01dw03",
      "m.01fpfn",
      "m.06cx9"
    ],
    "answer_entity_names": [
      "Semi-presidential system",
      "Unitary state",
      "Republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1043",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v09)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v09 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where did spencer pratt go to school",
    "question_entity": "m.02z3d24",
    "question_entity_name": "Spencer Pratt",
    "answer_entities": [
      "m.065y4w7"
    ],
    "answer_entity_names": [
      "University of Southern California"
    ],
    "hop": 2,
    "qid": "WebQTest-1712",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02z3d24)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02z3d24 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "who was the leader of the first communist party of china",
    "question_entity": "m.02189",
    "question_entity_name": "Communist Party of China",
    "answer_entities": [
      "m.02d42c",
      "m.04xzm",
      "m.0dbk8",
      "m.0n10q"
    ],
    "answer_entity_names": [
      "Li Dazhao",
      "Mao Zedong",
      "Zhou Enlai",
      "Chen Duxiu"
    ],
    "hop": 1,
    "qid": "WebQTest-891",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02189)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02189 ns:organization.organization.founders ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.founders"
    ]
  },
  {
    "question": "where did charles darwin and his wife live",
    "question_entity": "m.01lwx",
    "question_entity_name": "Charles Darwin",
    "answer_entities": [
      "m.0235n9",
      "m.02jx1",
      "m.030r7l4",
      "m.04jpl"
    ],
    "answer_entity_names": [
      "Shrewsbury",
      "England",
      "Downe, Kent",
      "London"
    ],
    "hop": 2,
    "qid": "WebQTest-1151",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwx ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "what type of music did vivaldi compose",
    "question_entity": "m.0pth",
    "question_entity_name": "Antonio Vivaldi",
    "answer_entities": [
      "m.01fsz",
      "m.0ggq0m"
    ],
    "answer_entity_names": [
      "Baroque music",
      "Classical music"
    ],
    "hop": 1,
    "qid": "WebQTest-1982",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pth)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pth ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what did nicholas copernicus discover",
    "question_entity": "m.01vvm4",
    "question_entity_name": "Nicolaus Copernicus",
    "answer_entities": [
      "m.01kf8z",
      "m.027lfyz",
      "m.02p6y2z"
    ],
    "answer_entity_names": [
      "Heliocentrism",
      "Copernican heliocentrism",
      "Copernican Revolution"
    ],
    "hop": 1,
    "qid": "WebQTest-1617",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vvm4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vvm4 ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.argumentmaps.innovator.original_ideas"
    ]
  },
  {
    "question": "what year did the la kings win the cup",
    "question_entity": "m.0jnq8",
    "question_entity_name": "Los Angeles Kings",
    "answer_entities": [
      "m.010fdzhp",
      "m.0jt52pz"
    ],
    "answer_entity_names": [
      "2014 Stanley Cup Finals",
      "2012 Stanley Cup Finals"
    ],
    "hop": 1,
    "qid": "WebQTest-1892",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jnq8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jnq8 ns:sports.sports_team.championships ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.championships"
    ]
  },
  {
    "question": "what are the sports in spain",
    "question_entity": "m.06mkj",
    "question_entity_name": "Spain",
    "answer_entities": [
      "m.026p7n3",
      "m.02w64f",
      "m.03c1fqp",
      "m.03d3f5r",
      "m.03d3y56",
      "m.04lht1r",
      "m.04lhy9w",
      "m.051zfgq",
      "m.05s9mb",
      "m.06w8y2x",
      "m.07kfw9h",
      "m.08_r59",
      "m.08dv_k",
      "m.093fgz",
      "m.09ctgt",
      "m.0b7611s",
      "m.0bkk7d",
      "m.0bkln2",
      "m.0bklw1",
      "m.0bklzm",
      "m.0ddl_r",
      "m.0dl843",
      "m.0fbjwn"
    ],
    "answer_entity_names": [
      "Spain national beach handball team",
      "Spain national football team",
      "Spain men's national volleyball team",
      "Basket Zaragoza 2002",
      "CB 1939 Canarias",
      "Spain women's national volleyball team",
      "CB Sant Josep",
      "Spain women's national handball team",
      "Saski Baskonia",
      "Obradoiro CAB",
      "CB Avenida",
      "CB Estudiantes",
      "Baloncesto Málaga",
      "Real Madrid Baloncesto",
      "Joventut Badalona",
      "Ros Casares Valencia",
      "CB Sevilla",
      "CB Breogán",
      "Valencia BC",
      "Bàsquet Manresa",
      "San Sebastián Gipuzkoa BC",
      "CB Murcia",
      "Spain national handball team"
    ],
    "hop": 1,
    "qid": "WebQTest-1082",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mkj ns:sports.sports_team_location.teams ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team_location.teams"
    ]
  },
  {
    "question": "who were mary shelley",
    "question_entity": "m.04_by",
    "question_entity_name": "Mary Shelley",
    "answer_entities": [
      "m.02h6676",
      "m.02h6nsx",
      "m.02hv44_",
      "m.02kvk_g",
      "m.02xhgwq",
      "m.0cbd2",
      "m.0f1hr",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Editor",
      "Biographer",
      "Playwright",
      "Travel writer",
      "Novelist",
      "Writer",
      "Essayist",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-512",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_by)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_by ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what type of government does iraq have now",
    "question_entity": "m.0d05q4",
    "question_entity_name": "Iraq",
    "answer_entities": [
      "m.018wl5",
      "m.06cx9",
      "m.0glnsx",
      "m.0j729"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Republic",
      "Parliamentary republic",
      "Federal republic"
    ],
    "hop": 1,
    "qid": "WebQTest-199",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05q4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05q4 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where are ike and tina turner 's children",
    "question_entity": "m.01vwyqp",
    "question_entity_name": "Tina Turner",
    "answer_entities": [
      "m.0ggl36p",
      "m.0j5dh53"
    ],
    "answer_entity_names": [
      "Ronnie Turner",
      "Raymond Craig Turner"
    ],
    "hop": 1,
    "qid": "WebQTest-1655",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vwyqp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vwyqp ns:people.person.children ?x .\n?x ns:people.person.parents ns:m.0dbzg .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "where is roswell area 51",
    "question_entity": "m.0yjq",
    "question_entity_name": "Area 51",
    "answer_entities": [
      "m.059_c",
      "m.0n6ps"
    ],
    "answer_entity_names": [
      "Nevada",
      "Lincoln County"
    ],
    "hop": 1,
    "qid": "WebQTest-2030",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yjq ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what are the names of michael jackson 's kids",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.0598rm4",
      "m.0598rmb",
      "m.065qbyj"
    ],
    "answer_entity_names": [
      "Paris-Michael Katherine Jackson",
      "Michael Joseph Jackson, Jr.",
      "Prince Michael Jackson II"
    ],
    "hop": 1,
    "qid": "WebQTest-2002",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what year was the first miss america pageant held",
    "question_entity": "m.01bk3n",
    "question_entity_name": "Miss America",
    "answer_entities": [
      "1921-09"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-245",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bk3n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bk3n ns:time.recurring_event.date_of_first_occurance ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.recurring_event.date_of_first_occurance"
    ]
  },
  {
    "question": "what kind of language do they speak in iran",
    "question_entity": "m.03shp",
    "question_entity_name": "Iran",
    "answer_entities": [
      "m.01bcw_",
      "m.01m3f7",
      "m.032f6",
      "m.03gg_5",
      "m.03h871",
      "m.040blg",
      "m.04w042",
      "m.07k3wd",
      "m.09hn84",
      "m.09k7n_",
      "m.0b1g2",
      "m.0bqk9s",
      "m.0fq4jq",
      "m.0fqmnr",
      "m.0gl97",
      "m.0jzc",
      "m.0swlx",
      "m.0xrg"
    ],
    "answer_entity_names": [
      "Azerbaijani language",
      "Turkmen Language",
      "Persian Language",
      "Qashqa'i Language",
      "Luri language",
      "Kumzari Language",
      "Assyrian Neo-Aramaic Language",
      "Khalaj, Turkic Language",
      "Mazanderani Language",
      "Gilaki Language",
      "Kurdish languages",
      "Talysh language",
      "Afshar language",
      "Khorasani Turkish Language",
      "Balochi language",
      "Arabic Language",
      "Pashto language",
      "Armenian Language"
    ],
    "hop": 1,
    "qid": "WebQTest-688",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03shp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03shp ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where did edgar allan poe died",
    "question_entity": "m.02lt8",
    "question_entity_name": "Edgar Allan Poe",
    "answer_entities": [
      "m.094jv"
    ],
    "answer_entity_names": [
      "Baltimore"
    ],
    "hop": 1,
    "qid": "WebQTest-24",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lt8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lt8 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where does dave ramsey live",
    "question_entity": "m.03zf9h",
    "question_entity_name": "Dave Ramsey",
    "answer_entities": [
      "m.05jbn"
    ],
    "answer_entity_names": [
      "Nashville"
    ],
    "hop": 2,
    "qid": "WebQTest-1858",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03zf9h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03zf9h ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  }
]