[
  {
    "question": "what to visit in london city",
    "question_entity": "m.04jpl",
    "question_entity_name": "London",
    "answer_entities": [
      "m.012vvtp_",
      "m.0136mc",
      "m.013y0_",
      "m.013yrz",
      "m.017_lw",
      "m.018g60",
      "m.018yyl",
      "m.0198g",
      "m.019k9x",
      "m.01d_0p",
      "m.01hb3",
      "m.01hc38",
      "m.01k804",
      "m.01lpg6",
      "m.01t372",
      "m.01tp60",
      "m.01w0yg",
      "m.01x3nm",
      "m.01x6xn",
      "m.01xrzb",
      "m.01xzg6",
      "m.021mgt",
      "m.022pjp",
      "m.026v7z",
      "m.026ydc",
      "m.0270g5",
      "m.0272nt3",
      "m.02mg5r",
      "m.02mv8x",
      "m.02q6xg0",
      "m.02sfxg",
      "m.02yfnd",
      "m.03825f",
      "m.03gm6z",
      "m.03l0pt",
      "m.03m401",
      "m.0414y7c",
      "m.043mxr",
      "m.045ffb",
      "m.04d1hw7",
      "m.04dn_hk",
      "m.04jgv",
      "m.04mmgh",
      "m.04ttyf",
      "m.04vflw",
      "m.055whd",
      "m.05f3pf0",
      "m.05fl7q",
      "m.05pq2k",
      "m.05q3_3",
      "m.05r48r",
      "m.05s6ns",
      "m.05t7yp",
      "m.05xz1j",
      "m.060yf",
      "m.06w3j7k",
      "m.07gyc",
      "m.07n8hk",
      "m.07nb5",
      "m.07nqn",
      "m.0bll4mn",
      "m.0bnlz5j",
      "m.0bnlz9r",
      "m.0bvqq",
      "m.0d0rj",
      "m.0dplh",
      "m.0fg05k",
      "m.0ggp4",
      "m.0gjv_",
      "m.0gl6x",
      "m.0gsxw",
      "m.0hsb3",
      "m.0j2g8sh",
      "m.0j32g13",
      "m.0j32kvf",
      "m.0j53x",
      "m.0jx0nq8",
      "m.0k2c9hx",
      "m.0m6q6",
      "m.0nb1f",
      "m.0nblr",
      "m.0nc61",
      "m.0ncpy",
      "m.0ncv_",
      "m.0ncy4",
      "m.0p0jt",
      "m.0p1tx",
      "m.0p77g",
      "m.0pdb059",
      "m.0pwzt",
      "m.0w1d3n8",
      "m.0z8h65p"
    ],
    "answer_entity_names": [
      "Travefy",
      "Tate Gallery, Britain",
      "London Paddington station",
      "Science Museum, London",
      "British Museum Reading Room",
      "Royal Albert Hall, London",
      "Euston railway station",
      "Buckingham Palace",
      "Smithfield, London",
      "Hyde Park",
      "British Museum",
      "Apsley House",
      "London Palladium",
      "Regent's Park",
      "Natural History Museum, London",
      "Strand, London",
      "Sir John Soane's Museum",
      "Royal Institution",
      "National Maritime Museum",
      "London Victoria station",
      "Queen's House",
      "Museum of London",
      "St. James's Park",
      "Central London",
      "Big Ben",
      "London Charterhouse",
      "Tramp",
      "City University London",
      "National Portrait Gallery, London",
      "Polish Institute and Sikorski Museum",
      "Wallace Collection",
      "Wasps RFC",
      "Horniman Museum",
      "Diana, Princess of Wales Memorial Fountain",
      "Henman Hill",
      "Olympia",
      "Wellcome Collection",
      "Serpentine Galleries",
      "The Clink",
      "The Building Centre",
      "New London Architecture",
      "London Underground",
      "Chessington World of Adventures",
      "Museum of London Docklands",
      "Hippodrome, London",
      "G-A-Y",
      "Madame Tussauds London",
      "V&A Museum of Childhood",
      "Design Museum",
      "Bank of England Museum",
      "Churchill War Rooms",
      "Jewish Museum London",
      "Earls Court Exhibition Centre",
      "National Police Memorial",
      "Palace of Westminster",
      "Chinawhite",
      "London Eye",
      "Leighton House Museum",
      "Tate Modern, London",
      "Tower of London",
      "Chokushi-Mon",
      "Waterlily House",
      "The Nash Conservatory",
      "Westminster Abbey",
      "London Marathon",
      "University College London",
      "Duke of York's Headquarters",
      "Tower Bridge",
      "University of London",
      "Imperial College London",
      "Trafalgar Square",
      "London School of Economics and Political Science",
      "Imperial War Museum London",
      "William Wilkins's Building",
      "Sainsbury Wing",
      "London Zoo",
      "Victoria and Albert Museum",
      "RAF Bomber Command Memorial",
      "Barbican Centre",
      "Holloway",
      "Newington, London",
      "Southgate, London",
      "Wallington, London",
      "Whetstone, London",
      "Wimbledon",
      "Liverpool Street station",
      "Victoria and Albert Museum",
      "London Bridge",
      "Selfridges, Oxford Street",
      "St Paul's Cathedral",
      "Crystal Palace Park",
      "Sutcliffe Park"
    ],
    "hop": 1,
    "qid": "WebQTest-1632",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jpl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jpl ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "where was auschwitz concentration camp located",
    "question_entity": "m.0v_x",
    "question_entity_name": "Auschwitz concentration camp",
    "answer_entities": [
      "m.021p2p",
      "m.05mtdhz",
      "m.05qhw"
    ],
    "answer_entity_names": [
      "Oświęcim",
      "Auschwitz-Birkenau State Museum",
      "Poland"
    ],
    "hop": 1,
    "qid": "WebQTest-1905",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0v_x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0v_x ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where was theodore roosevelt buried",
    "question_entity": "m.07hyk",
    "question_entity_name": "Theodore Roosevelt",
    "answer_entities": [
      "m.05230qz"
    ],
    "answer_entity_names": [
      "Youngs Memorial Cemetery"
    ],
    "hop": 1,
    "qid": "WebQTest-177",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hyk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hyk ns:people.deceased_person.place_of_burial ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_burial"
    ]
  },
  {
    "question": "what was nikola tesla known for",
    "question_entity": "m.05d1y",
    "question_entity_name": "Nikola Tesla",
    "answer_entities": [
      "m.02xhgx0",
      "m.03sbb",
      "m.04q69_",
      "m.05snw",
      "m.06q2q",
      "m.07s7r2"
    ],
    "answer_entity_names": [
      "Electrical engineer",
      "Inventor",
      "Futurist",
      "Physicist",
      "Scientist",
      "Mechanical Engineer"
    ],
    "hop": 1,
    "qid": "WebQTest-1380",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05d1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05d1y ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what type of music did mozart composed",
    "question_entity": "m.082db",
    "question_entity_name": "Wolfgang Amadeus Mozart",
    "answer_entities": [
      "m.021dvj",
      "m.05lls",
      "m.06q6jz",
      "m.0ggq0m",
      "m.0l8gh"
    ],
    "answer_entity_names": [
      "Ballet",
      "Opera",
      "Art song",
      "Classical music",
      "Chamber music"
    ],
    "hop": 1,
    "qid": "WebQTest-1289",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082db)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082db ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "how many kids were there in the kennedy family",
    "question_entity": "m.01qlg1",
    "question_entity_name": "Joseph P. Kennedy, Sr.",
    "answer_entities": [
      "m.0194xc",
      "m.01kyns",
      "m.020t1x",
      "m.028qh_",
      "m.04f1nm",
      "m.04f1qs",
      "m.06hx2",
      "m.0bt9c",
      "m.0d3k14"
    ],
    "answer_entity_names": [
      "Ted Kennedy",
      "Rosemary Kennedy",
      "Joseph P. Kennedy, Jr.",
      "Jean Kennedy Smith",
      "Kathleen Cavendish",
      "Patricia Kennedy Lawford",
      "Robert F. Kennedy",
      "Eunice Kennedy Shriver",
      "John F. Kennedy"
    ],
    "hop": 1,
    "qid": "WebQTest-1291",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qlg1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qlg1 ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what is the main language spoken in mexico",
    "question_entity": "m.0b90_r",
    "question_entity_name": "Mexico",
    "answer_entities": [
      "m.01_0ct",
      "m.025_3fs",
      "m.0265vht",
      "m.026cthd",
      "m.026cttd",
      "m.026kljv",
      "m.026klts",
      "m.026rbw2",
      "m.027mp4j",
      "m.027s7fc",
      "m.02bjrlw",
      "m.02hw_kw",
      "m.02hwfv0",
      "m.02hwjvf",
      "m.02hwrvs",
      "m.02hwt81",
      "m.02hww6w",
      "m.02hwy5n",
      "m.02hx1c7",
      "m.02hx45z",
      "m.02hx6hm",
      "m.02hx7z3",
      "m.02hxcp6",
      "m.02hxcxw",
      "m.02hxls_",
      "m.02hxp72",
      "m.02hxq91",
      "m.02hxqk4",
      "m.02hxsxz",
      "m.02hxtxy",
      "m.02hxvwd",
      "m.02hxx7m",
      "m.02hxyc2",
      "m.02hxzhl",
      "m.02mz30",
      "m.03525r",
      "m.03vsxc",
      "m.0431w7",
      "m.04h3_d",
      "m.04h3z9",
      "m.04n9hn",
      "m.05hjc",
      "m.06nm1",
      "m.06yvsp",
      "m.08z862",
      "m.0952_d",
      "m.09r_m7",
      "m.0c_30_",
      "m.0cd3rq",
      "m.0ct7sh",
      "m.0ct88h",
      "m.0czdxk",
      "m.0dg033",
      "m.0fx0n6",
      "m.0gnknr",
      "m.0h2bky",
      "m.0h3_l3",
      "m.0h54_g"
    ],
    "answer_entity_names": [
      "Chinantecan languages",
      "Huave language",
      "Tarahumara language",
      "Tepehuan, Southeastern Language",
      "Pima Bajo Language",
      "Pame language",
      "Chichimeca Jonaz language",
      "Matlatzinca language",
      "Tepehua languages",
      "Mazahua language",
      "Italian Language",
      "Kiliwa Language",
      "Cuicatec, Teutila Language",
      "Tataltepec Chatino Language",
      "Mocho Language",
      "Guerrero Amuzgo language",
      "Huastec, Veracruz Language",
      "Paipai Language",
      "Texistepec language",
      "Chochotec Language",
      "Jakaltek language",
      "Cocopah Language",
      "Cochimi Language",
      "Seri Language",
      "Lacandon Language",
      "Q’anjob’al language",
      "Kickapoo Language",
      "Totonac, Highland Language",
      "Cora, El Nayar Language",
      "Ixcatec Language",
      "Ixil, San Juan Cotzal Language",
      "Huamelula Language",
      "Huarijio Language",
      "Kumiai Language",
      "O'odham language",
      "K'iche' language",
      "Maya, Yucatán Language",
      "Ch’ol language",
      "Tzotzil language",
      "Tzeltal language",
      "Yaqui Language",
      "Nahuatl languages",
      "Spanish Language",
      "Mazatecan languages",
      "Mayo Language",
      "Q'eqchi' Language",
      "Chuj language",
      "Huichol Language",
      "Chontal, Tabasco Language",
      "Awakateko Language",
      "Tojolabal Language",
      "Chicomuceltec Language",
      "Mixtecan languages",
      "Otomi language",
      "Purépecha language",
      "Tlapanec, Azoyú Language",
      "Trique language",
      "Mixe languages"
    ],
    "hop": 1,
    "qid": "WebQTest-1029",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b90_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b90_r ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "who was philip in acts chapter 8",
    "question_entity": "m.012tjy",
    "question_entity_name": "Philip the Apostle",
    "answer_entities": [
      "m.075pg8m"
    ],
    "answer_entity_names": [
      "Apostle Philip"
    ],
    "hop": 1,
    "qid": "WebQTest-504",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012tjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012tjy ns:fictional_universe.person_in_fiction.representations_in_fiction ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "fictional_universe.person_in_fiction.representations_in_fiction"
    ]
  },
  {
    "question": "what does helen flanagan do",
    "question_entity": "m.087k1_",
    "question_entity_name": "Helen Flanagan",
    "answer_entities": [
      "m.02hrh1q"
    ],
    "answer_entity_names": [
      "Actor"
    ],
    "hop": 1,
    "qid": "WebQTest-1275",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.087k1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.087k1_ ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what language they speak in scotland",
    "question_entity": "m.06q1r",
    "question_entity_name": "Scotland",
    "answer_entities": [
      "m.02h40lc"
    ],
    "answer_entity_names": [
      "English Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1652",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q1r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q1r ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "where turkish people originate",
    "question_entity": "m.0hb7h_z",
    "question_entity_name": "Turkish people",
    "answer_entities": [
      "m.0154j",
      "m.015qh",
      "m.0166b",
      "m.01nx28",
      "m.01znc_",
      "m.0345h",
      "m.047lj",
      "m.04fh3",
      "m.059j2",
      "m.05b4w",
      "m.06vbd",
      "m.07ssc",
      "m.09c7w0",
      "m.0d05q4",
      "m.0d060g",
      "m.0d0vqn",
      "m.0f8l9c",
      "m.0h3y",
      "m.0h7x",
      "m.0jhd",
      "m.0jt3tjf",
      "m.0k6nt"
    ],
    "answer_entity_names": [
      "Belgium",
      "Bulgaria",
      "Bosnia and Herzegovina",
      "Northern Cyprus",
      "Turkey",
      "Germany",
      "Kazakhstan",
      "Republic of Kosovo",
      "Netherlands",
      "Norway",
      "Syria",
      "United Kingdom",
      "United States of America",
      "Iraq",
      "Canada",
      "Sweden",
      "France",
      "Algeria",
      "Austria",
      "Azerbaijan",
      "Kyrgyzstan",
      "Denmark"
    ],
    "hop": 1,
    "qid": "WebQTest-903",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hb7h_z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hb7h_z ns:people.ethnicity.geographic_distribution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.geographic_distribution"
    ]
  },
  {
    "question": "what kind of government does peru",
    "question_entity": "m.016wzw",
    "question_entity_name": "Peru",
    "answer_entities": [
      "m.01d9r3",
      "m.01fpfn",
      "m.06cx9",
      "m.0c9rw5"
    ],
    "answer_entity_names": [
      "Presidential system",
      "Unitary state",
      "Republic",
      "Constitutional republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1941",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016wzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016wzw ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "when did roth ira originate",
    "question_entity": "m.023_lp",
    "question_entity_name": "Roth IRA",
    "answer_entities": [
      "m.023xsb"
    ],
    "answer_entity_names": [
      "William V. Roth, Jr."
    ],
    "hop": 1,
    "qid": "WebQTest-792",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.023_lp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.023_lp ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "symbols.namesake.named_after"
    ]
  },
  {
    "question": "what kind of monarchy does japan have",
    "question_entity": "m.03_3d",
    "question_entity_name": "Japan",
    "answer_entities": [
      "m.018wl5",
      "m.01fpfn",
      "m.01q20"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Unitary state",
      "Constitutional monarchy"
    ],
    "hop": 1,
    "qid": "WebQTest-270",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_3d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_3d ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where was barack hussein obama sr born",
    "question_entity": "m.03qccxj",
    "question_entity_name": "Barack Obama, Sr.",
    "answer_entities": [
      "m.04f2ymq"
    ],
    "answer_entity_names": [
      "Nyang'oma Kogelo"
    ],
    "hop": 1,
    "qid": "WebQTest-1504",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03qccxj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03qccxj ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what type of guitar does johnny depp play",
    "question_entity": "m.0jfx1",
    "question_entity_name": "Johnny Depp",
    "answer_entities": [
      "m.0342h",
      "m.06w7v"
    ],
    "answer_entity_names": [
      "Guitar",
      "Slide guitar"
    ],
    "hop": 1,
    "qid": "WebQTest-1475",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jfx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jfx1 ns:music.group_member.instruments_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.group_member.instruments_played"
    ]
  },
  {
    "question": "what is the zip code of syracuse ny",
    "question_entity": "m.071cn",
    "question_entity_name": "Syracuse",
    "answer_entities": [
      "m.020gbdx",
      "m.020gbfx",
      "m.020gbhg",
      "m.020gbj8",
      "m.020gbl7",
      "m.020gbq8",
      "m.020gbtz",
      "m.03dv6mg",
      "m.03dv6mw",
      "m.03dv6n8",
      "m.03dv6np",
      "m.03dv6p2",
      "m.03dv6ph",
      "m.03dv6px",
      "m.03dv6qh",
      "m.03dv6qx",
      "m.03dv6rh",
      "m.03dv6s2",
      "m.07nrnm_",
      "m.07nrnmb",
      "m.07nrnmk",
      "m.07nrnms",
      "m.07nrnn6",
      "m.07nrnnf",
      "m.07nrnnn",
      "m.07nrnnw",
      "m.07nrnp2",
      "m.07nrnp9",
      "m.0h7bww4"
    ],
    "answer_entity_names": [
      "13261",
      "13220",
      "13211",
      "13224",
      "13215",
      "13203",
      "13202",
      "13204",
      "13205",
      "13206",
      "13207",
      "13208",
      "13209",
      "13210",
      "13212",
      "13214",
      "13219",
      "13290",
      "13244",
      "13252",
      "13251",
      "13250",
      "13235",
      "13225",
      "13221",
      "13218",
      "13217",
      "13201",
      "13244-1020"
    ],
    "hop": 1,
    "qid": "WebQTest-982",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.071cn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.071cn ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "what state is barack obama from",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.03gh4"
    ],
    "answer_entity_names": [
      "Hawaii"
    ],
    "hop": 1,
    "qid": "WebQTest-904",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.02mjmr ns:people.person.place_of_birth ?y .\n\t?y ns:location.location.containedby ?x .\n\t?x ns:common.topic.notable_types ns:m.0kpys4 .  #US State\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "what has shannen doherty played in",
    "question_entity": "m.039crh",
    "question_entity_name": "Shannen Doherty",
    "answer_entities": [
      "g.12214l9tm",
      "m.01jc1h",
      "m.02mh4b",
      "m.02pynz",
      "m.02vl04p",
      "m.02vykg0",
      "m.03h5yly",
      "m.03m3j",
      "m.0408ch5",
      "m.04j2ff5",
      "m.04j2rgh",
      "m.04jvls",
      "m.04q0k5p",
      "m.04q1w97",
      "m.04q37f6",
      "m.04q3m0j",
      "m.04q7c_s",
      "m.04q8bmc",
      "m.04q8njq",
      "m.04q9znk",
      "m.04y6khs",
      "m.04ycptv",
      "m.04yhc6q",
      "m.05dkr3l",
      "m.06r7r1",
      "m.08rczt",
      "m.0bhccky",
      "m.0crttzw",
      "m.0dg3g14",
      "m.0gks9h_",
      "m.0prrm",
      "m.0v1zdx4",
      "m.0w66b4r"
    ],
    "answer_entity_names": [
      "Another Day",
      "Mallrats",
      "Night Shift",
      "The Secret of NIMH",
      "Gone in the Night",
      "Christmas Caper",
      "Friends 'Til the End",
      "Heathers",
      "Satan's School for Girls",
      "The Rendering",
      "Striking Poses",
      "Nowhere",
      "Obsessed",
      "Blindfold: Acts of Obsession",
      "Freeze Frame",
      "Nightlight",
      "The Other Lover",
      "Jailbreakers",
      "Hell on Heels: The Battle of Mary Kay",
      "Sleeping with the Devil",
      "A Burning Passion: The Margaret Mitchell Story",
      "Burning Palms",
      "The Lost Treasure of the Grand Canyon",
      "Bless All the Dear Children",
      "Girls Just Want to Have Fun",
      "Category 7: The End of the World",
      "The Delphi Effect",
      "Growing the Big One",
      "Almost Dead",
      "The Ticket",
      "Jay and Silent Bob Strike Back",
      "Bukowski",
      "Witchslayer Gretl"
    ],
    "hop": 2,
    "qid": "WebQTest-1220",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.039crh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.039crh ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "when was father chris riley born",
    "question_entity": "m.03d8_d9",
    "question_entity_name": "Chris Riley",
    "answer_entities": [
      "m.0h3p0"
    ],
    "answer_entity_names": [
      "Echuca"
    ],
    "hop": 1,
    "qid": "WebQTest-2031",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d8_d9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d8_d9 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what countries have spanish as the national language",
    "question_entity": "m.06nm1",
    "question_entity_name": "Spanish Language",
    "answer_entities": [
      "m.0162v",
      "m.0164b",
      "m.0165v",
      "m.016wzw",
      "m.01ls2",
      "m.01p1v",
      "m.01p8s",
      "m.027rn",
      "m.02k1b",
      "m.02k8k",
      "m.02kcz",
      "m.02srrt",
      "m.0345_",
      "m.034m8",
      "m.035hm",
      "m.03h2c",
      "m.05c74",
      "m.05cnr",
      "m.05qx1",
      "m.05r7t",
      "m.05v10",
      "m.06mkj",
      "m.06s0l",
      "m.07twz",
      "m.07ylj",
      "m.07ytt",
      "m.082qk",
      "m.09c7w0",
      "m.0b90_r",
      "m.0d04z6",
      "m.0d060g",
      "m.0hbgh",
      "m.0hg5",
      "m.0jgd"
    ],
    "answer_entity_names": [
      "Barbados",
      "Belize",
      "Bolivia",
      "Peru",
      "Colombia",
      "Chile",
      "Costa Rica",
      "Dominican Republic",
      "Ecuador",
      "El Salvador",
      "Equatorial Guinea",
      "Kingdom of Aragon",
      "Guatemala",
      "Guyana",
      "Gibraltar",
      "Honduras",
      "Nicaragua",
      "Northern Mariana Islands",
      "Panama",
      "Puerto Rico",
      "Paraguay",
      "Spain",
      "Saint Lucia",
      "Uruguay",
      "Venezuela",
      "Vatican City",
      "Western Sahara",
      "United States of America",
      "Mexico",
      "Cuba",
      "Canada",
      "Curaçao",
      "Andorra",
      "Argentina"
    ],
    "hop": 1,
    "qid": "WebQTest-232",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06nm1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06nm1 ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "what teams has manny ramirez played for",
    "question_entity": "m.06tjlc",
    "question_entity_name": "Manny Ramirez",
    "answer_entities": [
      "m.01d5z",
      "m.01slc",
      "m.01yhm",
      "m.01yjl",
      "m.04mjl",
      "m.05m_8",
      "m.07l8f",
      "m.07l8x",
      "m.08tdk2"
    ],
    "answer_entity_names": [
      "Boston Red Sox",
      "Chicago White Sox",
      "Cleveland Indians",
      "Chicago Cubs",
      "Los Angeles Dodgers",
      "Oakland Athletics",
      "Tampa Bay Rays",
      "Texas Rangers",
      "EDA Rhinos"
    ],
    "hop": 2,
    "qid": "WebQTest-1618",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06tjlc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06tjlc ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what capital of austria",
    "question_entity": "m.0h7x",
    "question_entity_name": "Austria",
    "answer_entities": [
      "m.0fhp9"
    ],
    "answer_entity_names": [
      "Vienna"
    ],
    "hop": 1,
    "qid": "WebQTest-77",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h7x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h7x ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "who did scarlett johansson date",
    "question_entity": "m.02114t",
    "question_entity_name": "Scarlett Johansson",
    "answer_entities": [
      "m.01g0jn",
      "m.01kgv4",
      "m.028r4y",
      "m.02fybl",
      "m.036hf4",
      "m.055zkh",
      "m.0j1yf"
    ],
    "answer_entity_names": [
      "nm1157013",
      "Josh Hartnett",
      "Topher Grace",
      "Jared Leto",
      "Ryan Reynolds",
      "Patrick Wilson",
      "Justin Timberlake"
    ],
    "hop": 2,
    "qid": "WebQTest-213",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02114t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02114t ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.popstra.celebrity.dated",
      "base.popstra.dated.participant"
    ]
  },
  {
    "question": "what is the clemson mascot name",
    "question_entity": "m.012vwb",
    "question_entity_name": "Clemson University",
    "answer_entities": [
      "m.02nv3yz",
      "m.05h9xpr"
    ],
    "answer_entity_names": [
      "Clemson University The Tiger",
      "The Tiger and the Cub"
    ],
    "hop": 1,
    "qid": "WebQTest-1161",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012vwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012vwb ns:education.educational_institution.mascot ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "education.educational_institution.mascot"
    ]
  },
  {
    "question": "what are abraham sons names",
    "question_entity": "m.0pwb",
    "question_entity_name": "Abraham",
    "answer_entities": [
      "m.01ghr4",
      "m.02pv75j",
      "m.02w6dpm",
      "m.03xqw",
      "m.08flgy",
      "m.0b__3p",
      "m.0c05cp",
      "m.0ch5jk5"
    ],
    "answer_entity_names": [
      "Ishmael",
      "Ishbak",
      "Shuah",
      "Isaac",
      "Zimran",
      "Jokshan",
      "Medan",
      "Midian"
    ],
    "hop": 1,
    "qid": "WebQTest-125",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pwb ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what did nicolas cage name his son",
    "question_entity": "m.01vvb4m",
    "question_entity_name": "Nicolas Cage",
    "answer_entities": [
      "m.03jnwc9",
      "m.0gfhlgk"
    ],
    "answer_entity_names": [
      "Kal-El Coppola Cage",
      "Weston Coppola Cage"
    ],
    "hop": 1,
    "qid": "WebQTest-1359",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vvb4m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vvb4m ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what do people in czech republic speak",
    "question_entity": "m.01mjq",
    "question_entity_name": "Czech Republic",
    "answer_entities": [
      "m.012psb",
      "m.013hyy",
      "m.01bkv",
      "m.01wgr",
      "m.02ztjwg",
      "m.0349s",
      "m.04306rv",
      "m.05qqm",
      "m.06b_j",
      "m.06zvx",
      "m.0cjk9",
      "m.0k0sb",
      "m.0k0sv"
    ],
    "answer_entity_names": [
      "Romani language",
      "Rusyn Language",
      "Bulgarian Language",
      "Czech Language",
      "Hungarian language",
      "Greek Language",
      "German Language",
      "Polish Language",
      "Russian Language",
      "Slovak Language",
      "Ukrainian Language",
      "Serbian language",
      "Croatian language"
    ],
    "hop": 1,
    "qid": "WebQTest-2007",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mjq ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  }
]