[
  {
    "question": "where did martin luther king got shot at",
    "question_entity": "m.051cc",
    "question_entity_name": "Martin Luther King, Jr.",
    "answer_entities": [
      "m.0c_m3"
    ],
    "answer_entity_names": [
      "Memphis"
    ],
    "hop": 1,
    "qid": "WebQTest-657",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what was sir isaac newton 's inventions",
    "question_entity": "m.03s9v",
    "question_entity_name": "Isaac Newton",
    "answer_entities": [
      "m.01nhc9",
      "m.079vqm"
    ],
    "answer_entity_names": [
      "Reflecting telescope",
      "Pet door"
    ],
    "hop": 1,
    "qid": "WebQTest-1235",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03s9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03s9v ns:law.inventor.inventions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "law.inventor.inventions"
    ]
  },
  {
    "question": "what to do with kids in asheville nc",
    "question_entity": "m.0ydpd",
    "question_entity_name": "Asheville",
    "answer_entities": [
      "m.01vnqb",
      "m.02rtgcx",
      "m.03d2gy",
      "m.03qhg3_",
      "m.03qknx1",
      "m.06_g_2g",
      "m.07pc_b",
      "m.08gz6r",
      "m.0fhdb5",
      "m.0k5mxqg"
    ],
    "answer_entity_names": [
      "Blue Ridge Parkway",
      "The Omni Grove Park Inn",
      "Biltmore Estate",
      "Thomas Wolfe House",
      "Folk Art Center",
      "Smith-McDowell House",
      "Carl Sandburg Home National Historic Site",
      "Pisgah National Forest",
      "Bele Chere",
      "Asheville Art Museum"
    ],
    "hop": 1,
    "qid": "WebQTest-1433",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ydpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ydpd ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what kind of guitar did george harrison use",
    "question_entity": "m.03bnv",
    "question_entity_name": "George Harrison",
    "answer_entities": [
      "m.02m873",
      "m.02pqjvz"
    ],
    "answer_entity_names": [
      "Fender Stratocaster",
      "Rickenbacker 360/12"
    ],
    "hop": 1,
    "qid": "WebQTest-195",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bnv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bnv ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.guitarist.guitars_played"
    ]
  },
  {
    "question": "where did george w bush live as a child",
    "question_entity": "m.09b6zr",
    "question_entity_name": "George W. Bush",
    "answer_entities": [
      "m.0f2nf"
    ],
    "answer_entity_names": [
      "New Haven"
    ],
    "hop": 1,
    "qid": "WebQTest-243",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6zr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6zr ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what to do san jose ca",
    "question_entity": "m.0f04v",
    "question_entity_name": "San Jose",
    "answer_entities": [
      "m.01nmrx",
      "m.0255__",
      "m.02ryz1",
      "m.03bwp6",
      "m.03gyhcp",
      "m.03rvy1",
      "m.04_y_d",
      "m.04zrqk",
      "m.053j1_",
      "m.05b8gm",
      "m.05cm97",
      "m.072p67",
      "m.099ltq",
      "m.0cm9hhr",
      "m.0fcd8p"
    ],
    "answer_entity_names": [
      "Winchester Mystery House",
      "Rosicrucian Egyptian Museum",
      "The Tech Museum of Innovation",
      "Alum Rock Park",
      "San Jose Museum of Quilts & Textiles",
      "Japantown",
      "San Jose Museum of Art",
      "Kelley Park",
      "Happy Hollow Park & Zoo",
      "Cinequest Film Festival",
      "Downtown San Jose",
      "Santana Row",
      "San Jose Municipal Rose Garden",
      "Rock ‘n’ Roll San Jose Half Marathon",
      "Children's Discovery Museum of San Jose"
    ],
    "hop": 1,
    "qid": "WebQTest-1559",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f04v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f04v ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what was the cause of death for laci peterson",
    "question_entity": "m.01f6vb",
    "question_entity_name": "Laci Peterson",
    "answer_entities": [
      "m.051_y"
    ],
    "answer_entity_names": [
      "Murder"
    ],
    "hop": 1,
    "qid": "WebQTest-1968",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f6vb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f6vb ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what do you call the chinese writing system",
    "question_entity": "m.01r2l",
    "question_entity_name": "Chinese language",
    "answer_entities": [
      "m.014lbg",
      "m.01mw7r",
      "m.01nf5z",
      "m.050fyz",
      "m.0mmzb"
    ],
    "answer_entity_names": [
      "Nüshu script",
      "Simplified Chinese character",
      "Traditional Chinese characters",
      "'Phags-pa script",
      "Chinese characters"
    ],
    "hop": 1,
    "qid": "WebQTest-89",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r2l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r2l ns:language.human_language.writing_system ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.writing_system"
    ]
  },
  {
    "question": "what were the names of henry viii 's three children",
    "question_entity": "m.03p77",
    "question_entity_name": "Henry VIII of England",
    "answer_entities": [
      "m.02rg_",
      "m.02s82",
      "m.02sx6f",
      "m.056j9",
      "m.0hn9rc9"
    ],
    "answer_entity_names": [
      "Elizabeth I of England",
      "Edward VI of England",
      "Henry FitzRoy, 1st Duke of Richmond and Somerset",
      "Mary I of England",
      "Henry, Duke of Cornwall"
    ],
    "hop": 1,
    "qid": "WebQTest-615",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p77 ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "what is the main language used in china",
    "question_entity": "m.0d05w3",
    "question_entity_name": "China",
    "answer_entities": [
      "m.0653m"
    ],
    "answer_entity_names": [
      "Standard Chinese"
    ],
    "hop": 1,
    "qid": "WebQTest-833",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what works of art did leonardo da vinci produce",
    "question_entity": "m.04lg6",
    "question_entity_name": "Leonardo da Vinci",
    "answer_entities": [
      "g.120p4__x",
      "g.120vt1gz",
      "g.1213jb_b",
      "g.1215vxrd",
      "g.1219sb0g",
      "g.121wt37c",
      "g.121yh91r",
      "g.12215rxg",
      "g.1224tf0c",
      "g.12314dm1",
      "g.1239jd9p",
      "g.1s05nsvbj",
      "m.0_l9d86",
      "m.01222klx",
      "m.026qg59",
      "m.02815wd",
      "m.0298d9",
      "m.03d34_0",
      "m.03d3d1n",
      "m.03djdc",
      "m.04ls11",
      "m.04tyvk",
      "m.05k3fq",
      "m.05m4n7",
      "m.05m4tw",
      "m.05v184",
      "m.05wk8l",
      "m.05zqfwq",
      "m.060bxw",
      "m.07_jvg",
      "m.079x2_",
      "m.07dkzk",
      "m.07ljj3",
      "m.08060s",
      "m.0806t_w",
      "m.08s4wm",
      "m.09kjrxf",
      "m.0bh7s8p",
      "m.0ch45ty",
      "m.0dk3hj",
      "m.0drwnr7",
      "m.0h53304",
      "m.0hgmf7n",
      "m.0j42qsf",
      "m.0jbg2",
      "m.0jnz3"
    ],
    "answer_entity_names": [
      "Portrait of Isabella d'Este",
      "Madonna and Child with St Joseph",
      "Virgin of the Rocks",
      "Horse and Rider",
      "Sala delle Asse",
      "Medusa",
      "The Holy Infants Embracing",
      "Vitruvian Man",
      "St. Jerome in the Wilderness",
      "Madonna of the Carnation",
      "Ginevra de' Benci",
      "Virgin of the Rocks",
      "La belle ferronnière",
      "The Virgin and Child with St. Anne",
      "Benois Madonna",
      "Annunciation",
      "Lady with an Ermine",
      "Madonna Litta",
      "Leonardo's horse",
      "Adoration of the Magi",
      "Bacchus",
      "Portrait of a Musician",
      "The Virgin and Child with St Anne and St John the Baptist",
      "St. John the Baptist",
      "Madonna of the Yarnwinder",
      "Portrait of a Young Fiancée",
      "The Baptism of Christ",
      "Drapery for a Seated Figure",
      "Portrait of a man in red chalk",
      "Madonna of Laroque",
      "The Battle of Anghiari",
      "Lucan portrait of Leonardo da Vinci",
      "Head of a Woman",
      "Salvator Mundi",
      "Leda and the Swan",
      "Mona Lisa",
      "The Last Supper"
    ],
    "hop": 1,
    "qid": "WebQTest-76",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:visual_art.visual_artist.artworks ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.artworks"
    ]
  },
  {
    "question": "what movies is omar epps in",
    "question_entity": "m.02_tv5",
    "question_entity_name": "Omar Epps",
    "answer_entities": [
      "m.02v5_g",
      "m.033gkt",
      "m.03820v",
      "m.03qhxn_",
      "m.040btp",
      "m.0456zg",
      "m.04j0jtp",
      "m.04j2hqm",
      "m.04jdgq",
      "m.04zx33c",
      "m.05pr8b",
      "m.06q_hx",
      "m.06zl2q4",
      "m.08487v",
      "m.08r27j",
      "m.08tw1f",
      "m.08w51z",
      "m.08yf3q",
      "m.08zjv6",
      "m.09fgyt",
      "m.09glbk",
      "m.0c5dgvg",
      "m.0cvcdtm"
    ],
    "answer_entity_names": [
      "Scream 2",
      "Higher Learning",
      "Brother",
      "Perfume",
      "Against the Ropes",
      "Alfie",
      "Deadly Voyage",
      "Conviction",
      "Dracula 2000",
      "First Time Felon",
      "Big Trouble",
      "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
      "A Day in the Life",
      "Love & Basketball",
      "The Wood",
      "In Too Deep",
      "Juice",
      "The Mod Squad",
      "Breakfast of Champions",
      "The Program",
      "Major League II",
      "Daybreak",
      "MTV 20: Jams"
    ],
    "hop": 2,
    "qid": "WebQTest-1006",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02_tv5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02_tv5 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what city does fulham play in",
    "question_entity": "m.02_lt",
    "question_entity_name": "Fulham F.C.",
    "answer_entities": [
      "m.0126hc"
    ],
    "answer_entity_names": [
      "Fulham"
    ],
    "hop": 1,
    "qid": "WebQTest-1300",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02_lt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02_lt ns:sports.sports_team.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.location"
    ]
  },
  {
    "question": "what school did mark zuckerberg attend",
    "question_entity": "m.086dny",
    "question_entity_name": "Mark Zuckerberg",
    "answer_entities": [
      "m.01cyd5",
      "m.038133",
      "m.03ksy",
      "m.08nm4j"
    ],
    "answer_entity_names": [
      "Phillips Exeter Academy",
      "Mercy College",
      "Harvard University",
      "Ardsley High School"
    ],
    "hop": 2,
    "qid": "WebQTest-1486",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.086dny)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.086dny ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "where did anne frank go to school",
    "question_entity": "m.03d9rk",
    "question_entity_name": "Anne Frank",
    "answer_entities": [
      "m.03wf8d8",
      "m.074600n"
    ],
    "answer_entity_names": [
      "Montessori Lyceum Amsterdam",
      "Jewish Lyceum"
    ],
    "hop": 2,
    "qid": "WebQTest-965",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d9rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d9rk ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what to do for fun in houston",
    "question_entity": "m.03l2n",
    "question_entity_name": "Houston",
    "answer_entities": [
      "m.01_nc_",
      "m.0182y2",
      "m.019r17",
      "m.01tx3t",
      "m.01v9bf",
      "m.0263t14",
      "m.026fxz",
      "m.02nqnj",
      "m.02z52c3",
      "m.03c98h6",
      "m.03y8vk2",
      "m.03ynr2",
      "m.05170t",
      "m.063g1w",
      "m.076v_2",
      "m.09q54f",
      "m.09vjh0",
      "m.0cc7kjq",
      "m.0cfztb",
      "m.0dhl0g",
      "m.0fy56_"
    ],
    "answer_entity_names": [
      "Houston Zoo",
      "Lyndon B. Johnson Space Center",
      "USS Texas (BB-35)",
      "Toyota Center",
      "The Galleria",
      "Houston Arboretum and Nature Center",
      "Rothko Chapel",
      "Lakewood Church",
      "Sam Houston Race Park",
      "Children's Museum of Houston",
      "Bayou Bend Collection and Gardens",
      "Kemah Boardwalk",
      "George R. Brown Convention Center",
      "Wet'n'Wild SplashTown",
      "Gerald D. Hines Waterwall Park",
      "Houston Marathon",
      "Houston Museum of Natural Science",
      "Downtown Aquarium, Houston",
      "Museum of Fine Arts, Houston",
      "Hanna–Barbera Land",
      "Space Center Houston"
    ],
    "hop": 1,
    "qid": "WebQTest-865",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03l2n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03l2n ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what does gm make",
    "question_entity": "m.035nm",
    "question_entity_name": "General Motors",
    "answer_entities": [
      "m.015smg",
      "m.03qtfw8"
    ],
    "answer_entity_names": [
      "Automotive industry",
      "Motor Vehicles and Passenger Car Bodies"
    ],
    "hop": 1,
    "qid": "WebQTest-1803",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035nm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035nm ns:business.business_operation.industry ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "business.business_operation.industry"
    ]
  },
  {
    "question": "when did william mckinley died",
    "question_entity": "m.083p7",
    "question_entity_name": "William McKinley",
    "answer_entities": [
      "1901-09-14"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-385",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083p7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083p7 ns:people.deceased_person.date_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.date_of_death"
    ]
  },
  {
    "question": "what movies did ron howard director",
    "question_entity": "m.0g2lq",
    "question_entity_name": "Ron Howard",
    "answer_entities": [
      "m.011yd2",
      "m.0134tnr7",
      "m.01hw5kk",
      "m.01xvjb",
      "m.02_1sj",
      "m.02mh4b",
      "m.02t9_q",
      "m.02vqsll",
      "m.02yf34",
      "m.034bm_",
      "m.03r58n",
      "m.03xx0x",
      "m.047nfz",
      "m.04ynx7",
      "m.050gkf",
      "m.05h3bcc",
      "m.065dc4",
      "m.06xz7w",
      "m.09_rkp7",
      "m.09hfyy",
      "m.09m6kg",
      "m.0c3_662",
      "m.0cc5m07",
      "m.0crrc8",
      "m.0f4_2k",
      "m.0gmdpnm",
      "m.0gy75pd",
      "m.0ngnf3x",
      "m.0xnx1p3"
    ],
    "answer_entity_names": [
      "Apollo 13",
      "Inferno",
      "Willow",
      "Splash",
      "EDtv",
      "Night Shift",
      "Backdraft",
      "Frost/Nixon",
      "Grand Theft Auto",
      "Far and Away",
      "Cocoon",
      "Ransom",
      "Parenthood",
      "The Missing",
      "Cinderella Man",
      "The Dark Tower",
      "The Da Vinci Code",
      "The Paper",
      "Cotton Candy",
      "Gung Ho",
      "A Beautiful Mind",
      "The Dilemma",
      "The Lost Symbol",
      "Dr. Seuss' How the Grinch Stole Christmas",
      "Angels & Demons",
      "Presidential Reunion",
      "Rush",
      "Jay-Z: Made in America",
      "In the Heart of the Sea"
    ],
    "hop": 1,
    "qid": "WebQTest-323",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.director.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.director.film"
    ]
  },
  {
    "question": "what other movies is josh hutcherson in",
    "question_entity": "m.08wjf4",
    "question_entity_name": "Josh Hutchersonm",
    "answer_entities": [
      "g.11b7k0v3hq",
      "m.0135_65p",
      "m.026gt8b",
      "m.0270k40",
      "m.02q02ql",
      "m.02qd6h2",
      "m.047qh9b",
      "m.04f8ttb",
      "m.04j0_gm",
      "m.04j1g18",
      "m.04j1phy",
      "m.05spvb",
      "m.07sbq6c",
      "m.07y296",
      "m.09qs_s",
      "m.09tqkv2",
      "m.09v9dsq",
      "m.09w6br",
      "m.0bcs_f",
      "m.0crnh6",
      "m.0ds2_k2",
      "m.0dzz6g",
      "m.0g4tknw",
      "m.0gkp_k",
      "m.0gkz15s",
      "m.0gy8kqb",
      "m.0gy8kv2",
      "m.0hhgh69",
      "m.0n40qmp",
      "m.0ngvsvk",
      "m.0ngvtb_",
      "m.0x1xc_w"
    ],
    "answer_entity_names": [
      "In Dubious Battle",
      "The Long Home",
      "Bridge to Terabithia",
      "Cirque du Freak: The Vampire's Assistant",
      "Firehouse Dog",
      "Winged Creatures",
      "Party Wagon",
      "Journey to the Center of the Earth",
      "One Last Ride",
      "Wilder Days",
      "Miracle Dogs",
      "Kicking & Screaming",
      "Red Dawn",
      "Motocross Kids",
      "Zathura",
      "The Kids Are All Right",
      "The Forger",
      "The Polar Express",
      "RV",
      "Little Manhattan",
      "Journey 2: The Mysterious Island",
      "American Splendor",
      "Detention",
      "House Blend",
      "The Hunger Games",
      "7 Days in Havana",
      "The Third Rule",
      "Epic",
      "The Hunger Games: Catching Fire",
      "The Hunger Games: Mockingjay, Part 1",
      "The Hunger Games: Mockingjay, Part 2",
      "Escobar: Paradise Lost"
    ],
    "hop": 2,
    "qid": "WebQTest-1303",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08wjf4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08wjf4 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "where is denmark situated",
    "question_entity": "m.0k6nt",
    "question_entity_name": "Denmark",
    "answer_entities": [
      "m.0140mf",
      "m.06mx8"
    ],
    "answer_entity_names": [
      "Nordic countries",
      "Scandinavia"
    ],
    "hop": 1,
    "qid": "WebQTest-514",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6nt ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what do people speak in canada",
    "question_entity": "m.0d060g",
    "question_entity_name": "Canada",
    "answer_entities": [
      "m.0121sr",
      "m.01r2l",
      "m.02g5qs",
      "m.02h40lc",
      "m.02hwhyv",
      "m.02hx6h7",
      "m.02hxc3j",
      "m.02hxcvy",
      "m.02kdw56",
      "m.02pmtdt",
      "m.02syd6",
      "m.02t692",
      "m.02tfbg",
      "m.02w36s",
      "m.0322q8",
      "m.032f6",
      "m.0349s",
      "m.04306rv",
      "m.04gd7",
      "m.05qqm",
      "m.05zjd",
      "m.0688f",
      "m.06b_j",
      "m.06jdbv",
      "m.06nm1",
      "m.07c9s",
      "m.07qv_",
      "m.07zrf",
      "m.0dqhd",
      "m.0jzc"
    ],
    "answer_entity_names": [
      "Gujarati Language",
      "Chinese language",
      "Slavey language",
      "English Language",
      "Korean Language",
      "Western Canadian Inuktitut Language",
      "Romanian Language",
      "Urdu Language",
      "Canadian English",
      "Abenaki language",
      "Chipewyan Language",
      "Gwich'in Language",
      "Dogrib Language",
      "Inuinnaqtun",
      "Inuktitut",
      "Persian Language",
      "Greek Language",
      "German Language",
      "Lojban",
      "Polish Language",
      "Portuguese Language",
      "Punjabi language",
      "Russian Language",
      "Upper Midwest American English",
      "Spanish Language",
      "Tamil Language",
      "Tagalog language",
      "Vietnamese Language",
      "Cree language",
      "Arabic Language"
    ],
    "hop": 1,
    "qid": "WebQTest-517",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what sport is popular in italy",
    "question_entity": "m.03rjj",
    "question_entity_name": "Italy",
    "answer_entities": [
      "g.11x7vhqcx",
      "m.01_lhg",
      "m.026pr5r",
      "m.026r5sg",
      "m.026xx_g",
      "m.026yzx0",
      "m.02py_ct",
      "m.02r4hv4",
      "m.02wcqls",
      "m.02x8htg",
      "m.02x92lv",
      "m.02yjv4",
      "m.02yjwb",
      "m.02z136v",
      "m.02z68lf",
      "m.03c622g",
      "m.03t962",
      "m.03y9nqh",
      "m.041bcz",
      "m.04n2m87",
      "m.04tgph",
      "m.05yxjr",
      "m.06_8_s",
      "m.06s6pr",
      "m.0746dd",
      "m.07lwfq",
      "m.07v93_",
      "m.09bl55",
      "m.09d34d",
      "m.09zc0d",
      "m.0b_2gr",
      "m.0bwf1x",
      "m.0f0tjt",
      "m.0f0vc8",
      "m.0f0vk_",
      "m.0j289d9"
    ],
    "answer_entity_names": [
      "Italy national football team",
      "Italy women's national beach handball team",
      "Italy women's national volleyball team",
      "Italy men's national volleyball team",
      "Italy national handball team",
      "Italy Davis Cup team",
      "Italy Fed Cup team",
      "Italy national futsal team",
      "Dinamo Basket Sassari",
      "Partenope Napoli",
      "Fortitudo Pallacanestro Bologna",
      "Virtus Pallacanestro Bologna",
      "Juvecaserta Basket",
      "Italy women's national rugby union team",
      "Italy men's national pitch and putt team",
      "Italy national rugby union team",
      "Italy women's national water polo team",
      "Olimpia Milano",
      "Italy national speedway team",
      "Victoria Libertas Pesaro",
      "Italy national basketball team",
      "Italy national rugby league team",
      "Italy women's national football team",
      "Mens Sana 1871 Basket",
      "Italy national cricket team",
      "Team Liquigas-Cannondale",
      "Pallacanestro Varese",
      "Pallacanestro Treviso",
      "Italy men's national ice hockey team",
      "Italy women's national ice hockey team",
      "Italy national baseball team",
      "Pallacanestro Cantù",
      "S.S. Felice Scandone",
      "Pallacanestro Virtus Roma",
      "AS Vicenza"
    ],
    "hop": 1,
    "qid": "WebQTest-776",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rjj ns:sports.sports_team_location.teams ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team_location.teams"
    ]
  },
  {
    "question": "what time zone is chicago in right now",
    "question_entity": "m.01_d4",
    "question_entity_name": "Chicago",
    "answer_entities": [
      "m.02fqwt"
    ],
    "answer_entity_names": [
      "Central Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-973",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what county is st. louis park in",
    "question_entity": "m.0xdhj",
    "question_entity_name": "St. Louis Park",
    "answer_entities": [
      "m.0nhmw"
    ],
    "answer_entity_names": [
      "Hennepin County"
    ],
    "hop": 1,
    "qid": "WebQTest-713",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xdhj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xdhj ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "where do they speak afrikaans",
    "question_entity": "m.0x82",
    "question_entity_name": "Afrikaans Language",
    "answer_entities": [
      "m.0166v",
      "m.016p5p",
      "m.04tr1",
      "m.05bmq",
      "m.065skb",
      "m.088vb"
    ],
    "answer_entity_names": [
      "Botswana",
      "Transkei",
      "Malawi",
      "Namibia",
      "Gazankulu",
      "Zambia"
    ],
    "hop": 1,
    "qid": "WebQTest-1758",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x82)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x82 ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "what county is utica ny in",
    "question_entity": "m.0lpk3",
    "question_entity_name": "Utica",
    "answer_entities": [
      "m.0fc_9"
    ],
    "answer_entity_names": [
      "Oneida County"
    ],
    "hop": 1,
    "qid": "WebQTest-1916",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lpk3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lpk3 ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what is jamie oliver children names",
    "question_entity": "m.01myph",
    "question_entity_name": "Jamie Oliver",
    "answer_entities": [
      "m.0b7m2p0",
      "m.0b7m2p7",
      "m.0b7m2pg",
      "m.0gyd_td"
    ],
    "answer_entity_names": [
      "Petal Blossom Rainbow Oliver",
      "Daisy Boo Pamela Oliver",
      "Poppy Honey Rosie Oliver",
      "Buddy Bear Maurice Oliver"
    ],
    "hop": 1,
    "qid": "WebQTest-304",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01myph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01myph ns:people.person.children ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  }
]