[
  {
    "question": "where did richard arkwright grow up",
    "question_entity": "m.01tglh",
    "question_entity_name": "Richard Arkwright",
    "answer_entities": [
      "m.0m7dd"
    ],
    "answer_entity_names": [
      "Preston, Lancashire"
    ],
    "hop": 1,
    "qid": "WebQTest-790",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tglh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tglh ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where is victoria british columbia",
    "question_entity": "m.07ypt",
    "question_entity_name": "Victoria",
    "answer_entities": [
      "m.015jr",
      "m.0d060g"
    ],
    "answer_entity_names": [
      "British Columbia",
      "Canada"
    ],
    "hop": 1,
    "qid": "WebQTest-1102",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ypt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ypt ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where was jesus after he died on the cross",
    "question_entity": "m.045m1_",
    "question_entity_name": "Jesus Christ",
    "answer_entities": [
      "m.065sh7"
    ],
    "answer_entity_names": [
      "Judea"
    ],
    "hop": 1,
    "qid": "WebQTest-884",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045m1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045m1_ ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what kind of writing is nikolai gogol famous for",
    "question_entity": "m.0113sg",
    "question_entity_name": "Nikolai Gogol",
    "answer_entities": [
      "m.02hv44_",
      "m.02xhgwq",
      "m.0cbd2"
    ],
    "answer_entity_names": [
      "Playwright",
      "Novelist",
      "Writer"
    ],
    "hop": 1,
    "qid": "WebQTest-1799",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0113sg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0113sg ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where were greek temples built",
    "question_entity": "m.03f34_",
    "question_entity_name": "Ancient Greek temple",
    "answer_entities": [
      "m.01swlf",
      "m.02p8r",
      "m.04f_hwc",
      "m.04ygm3",
      "m.09lgkz",
      "m.0n2z"
    ],
    "answer_entity_names": [
      "Olympia",
      "Ephesus",
      "Shahhat",
      "Kuşadası",
      "Corfu",
      "Athens"
    ],
    "hop": 1,
    "qid": "WebQTest-936",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.03f34_ ns:architecture.building_function.buildings ?y .\n\t?y ns:travel.tourist_attraction.near_travel_destination ?x .\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "what is the current time in bangalore india",
    "question_entity": "m.09c17",
    "question_entity_name": "Bangalore",
    "answer_entities": [
      "m.02k8gd"
    ],
    "answer_entity_names": [
      "India Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-809",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09c17)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09c17 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what country is nicki minaj from",
    "question_entity": "m.047sxrj",
    "question_entity_name": "Nicki Minaj",
    "answer_entities": [
      "m.09c7w0"
    ],
    "answer_entity_names": [
      "United States of America"
    ],
    "hop": 1,
    "qid": "WebQTest-1001",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.047sxrj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.047sxrj ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "where is glastonbury england",
    "question_entity": "m.0g78h",
    "question_entity_name": "Glastonbury",
    "answer_entities": [
      "m.01pgbg",
      "m.07ssc"
    ],
    "answer_entity_names": [
      "Mendip",
      "United Kingdom"
    ],
    "hop": 1,
    "qid": "WebQTest-1367",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g78h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g78h ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what degrees does romney have",
    "question_entity": "m.0271_s",
    "question_entity_name": "Mitt Romney",
    "answer_entities": [
      "m.013zdg",
      "m.014mlp",
      "m.07s6fsf"
    ],
    "answer_entity_names": [
      "Juris Doctor",
      "Bachelor of Arts",
      "MBA"
    ],
    "hop": 2,
    "qid": "WebQTest-2010",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0271_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0271_s ns:people.person.education ?y .\n?y ns:education.education.degree ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.degree"
    ]
  },
  {
    "question": "what sri lanka capital",
    "question_entity": "m.06m_5",
    "question_entity_name": "Sri Lanka",
    "answer_entities": [
      "m.02r9rz",
      "m.0fn7r"
    ],
    "answer_entity_names": [
      "Sri Jayawardenepura Kotte",
      "Colombo"
    ],
    "hop": 1,
    "qid": "WebQTest-1468",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06m_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06m_5 ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "what artistic style did henri rousseau work in",
    "question_entity": "m.02rdf6",
    "question_entity_name": "Henri Rousseau",
    "answer_entities": [
      "m.015r61",
      "m.015xrq",
      "m.01b8q0",
      "m.06s0d7"
    ],
    "answer_entity_names": [
      "Modern art",
      "Post-Impressionism",
      "Naïve art",
      "Primitivism"
    ],
    "hop": 1,
    "qid": "WebQTest-1788",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rdf6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rdf6 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "who is vancouver canucks coach",
    "question_entity": "m.0jnnx",
    "question_entity_name": "Vancouver Canucks",
    "answer_entities": [
      "m.030q_6",
      "m.06qy2y",
      "m.08j98h",
      "m.0g4n7q"
    ],
    "answer_entity_names": [
      "John Tortorella",
      "Alain Vigneault",
      "Willie Desjardins",
      "Doug Lidster"
    ],
    "hop": 2,
    "qid": "WebQTest-1714",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jnnx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jnnx ns:sports.sports_team.coaches ?y .\n?y ns:sports.sports_team_coach_tenure.coach ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.coaches",
      "sports.sports_team_coach_tenure.coach"
    ]
  },
  {
    "question": "where was john f kennedy when he got shot",
    "question_entity": "m.0d3k14",
    "question_entity_name": "John F. Kennedy",
    "answer_entities": [
      "m.0f2rq"
    ],
    "answer_entity_names": [
      "Dallas"
    ],
    "hop": 1,
    "qid": "WebQTest-1373",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what position does brandon roy play",
    "question_entity": "m.0cf_p_",
    "question_entity_name": "Brandon Roy",
    "answer_entities": [
      "m.02sf_r",
      "m.03558l",
      "m.0355dz"
    ],
    "answer_entity_names": [
      "Point guard",
      "Shooting guard",
      "Small forward"
    ],
    "hop": 1,
    "qid": "WebQTest-206",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cf_p_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cf_p_ ns:basketball.basketball_player.position_s ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "basketball.basketball_player.position_s"
    ]
  },
  {
    "question": "what the zip code for seattle washington",
    "question_entity": "m.0d9jr",
    "question_entity_name": "Seattle",
    "answer_entities": [
      "m.020b572",
      "m.020r3kv",
      "m.021g5dm",
      "m.021ghmz",
      "m.021ghs6",
      "m.021gkmr",
      "m.021gykc",
      "m.021hbk1",
      "m.021hbty",
      "m.021hbzb",
      "m.021hc0f",
      "m.021hc2t",
      "m.021hc4m",
      "m.021hc9v",
      "m.021hcmf",
      "m.021hcn7",
      "m.021hcpd",
      "m.021hcw9",
      "m.021hcx9",
      "m.021hd2k",
      "m.021hdy8",
      "m.021hfsp",
      "m.021hfvn",
      "m.021hgpc",
      "m.021hh6h",
      "m.021hjjq",
      "m.021hkxk",
      "m.021hmgb",
      "m.021hnt8",
      "m.021hqp9",
      "m.021j58x",
      "m.021j5jr",
      "m.021j82v",
      "m.021jn8d",
      "m.021jq79",
      "m.021jtyl",
      "m.02wrtkc",
      "m.03dyr4r",
      "m.03dyr54",
      "m.03dyr6h",
      "m.05bdr2t",
      "m.07npw_4",
      "m.07npw_l",
      "m.07npw_t",
      "m.07npwzq",
      "m.07npwzy",
      "m.07npx00",
      "m.07npx07",
      "m.07npx0g",
      "m.07npx0p",
      "m.07npx0x",
      "m.07npx1_",
      "m.07npx13",
      "m.07npx1b",
      "m.07npx1k",
      "m.07npx1s",
      "m.07npx26",
      "m.07npx2f",
      "m.07npx2n",
      "m.07npx2w",
      "m.07npx32",
      "m.07npx3j",
      "m.09sm_9r"
    ],
    "answer_entity_names": [
      "98109",
      "98131",
      "98122",
      "98166",
      "98168",
      "98198",
      "98155",
      "98188",
      "98105",
      "98112",
      "98103",
      "98104",
      "98115",
      "98101",
      "98102",
      "98116",
      "98108",
      "98121",
      "98144",
      "98107",
      "98125",
      "98117",
      "98133",
      "98134",
      "98199",
      "98119",
      "98136",
      "98106",
      "98118",
      "98126",
      "98154",
      "98164",
      "98161",
      "98178",
      "98113",
      "98177",
      "98195",
      "98146",
      "98148",
      "98174",
      "98185",
      "98190",
      "98184",
      "98181",
      "98194",
      "98191",
      "98175",
      "98171",
      "98170",
      "98165",
      "98160",
      "98138",
      "98158",
      "98145",
      "98141",
      "98139",
      "98132",
      "98129",
      "98127",
      "98124",
      "98114",
      "98111",
      "98119-4114"
    ],
    "hop": 1,
    "qid": "WebQTest-87",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d9jr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d9jr ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "where was the first microsoft headquarters located",
    "question_entity": "m.04sv4",
    "question_entity_name": "Microsoft Corporation",
    "answer_entities": [
      "m.06m7v"
    ],
    "answer_entity_names": [
      "Redmond"
    ],
    "hop": 2,
    "qid": "WebQTest-1535",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sv4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sv4 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what the time zone in england",
    "question_entity": "m.02jx1",
    "question_entity_name": "England",
    "answer_entities": [
      "m.03bdv"
    ],
    "answer_entity_names": [
      "Greenwich Mean Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-506",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jx1 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "where did thomas paine die",
    "question_entity": "m.07kwl",
    "question_entity_name": "Thomas Paine",
    "answer_entities": [
      "m.02_286"
    ],
    "answer_entity_names": [
      "New York City"
    ],
    "hop": 1,
    "qid": "WebQTest-1503",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07kwl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07kwl ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where did adolf hitler die",
    "question_entity": "m.07_m9_",
    "question_entity_name": "Adolf Hitler",
    "answer_entities": [
      "m.0156q"
    ],
    "answer_entity_names": [
      "Berlin"
    ],
    "hop": 1,
    "qid": "WebQTest-522",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what movies has miley cyrus been in",
    "question_entity": "m.0bdxs5",
    "question_entity_name": "Miley Cyrus",
    "answer_entities": [
      "m.010ls0tb",
      "m.027pfg",
      "m.02x3lt7",
      "m.03ck042",
      "m.042w0v2",
      "m.05h43ls",
      "m.064qvcw",
      "m.06fcqw",
      "m.07ykkx5",
      "m.080gfc8",
      "m.0bc5ny",
      "m.0cmddrx",
      "m.0crsmk2",
      "m.0cs2t3x",
      "m.0g56xqy",
      "m.0swngjg",
      "m.0w1x037"
    ],
    "answer_entity_names": [
      "Miley Cyrus: Tongue Tied",
      "Big Fish",
      "Hannah Montana: The Movie",
      "Hannah Montana and Miley Cyrus: Best of Both Worlds Concert",
      "Sonic the Hedgehog",
      "Sex and the City 2",
      "Wizards on Deck with Hannah Montana",
      "Bolt",
      "The Last Song",
      "Super Rhino",
      "High School Musical 2",
      "LOL",
      "Radio Disney Party Jams: The Concert",
      "The World According to Miley Cyrus",
      "So Undercover",
      "Family Bond",
      "Rock Mafia Presents: The Big Bang"
    ],
    "hop": 2,
    "qid": "WebQTest-1923",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdxs5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdxs5 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what was augustus caesar famous for",
    "question_entity": "m.0ngg",
    "question_entity_name": "Augustus",
    "answer_entities": [
      "m.01g14w",
      "m.0fj9f"
    ],
    "answer_entity_names": [
      "Roman emperor",
      "Politician"
    ],
    "hop": 1,
    "qid": "WebQTest-745",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ngg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ngg ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what is the political structure of china",
    "question_entity": "m.0d05w3",
    "question_entity_name": "China",
    "answer_entities": [
      "m.01fkst",
      "m.025tbxf",
      "m.0py4y"
    ],
    "answer_entity_names": [
      "Communist state",
      "Socialist state",
      "Single-party state"
    ],
    "hop": 1,
    "qid": "WebQTest-464",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where do they speak tibetan",
    "question_entity": "m.064r7fk",
    "question_entity_name": "Standard Tibetan",
    "answer_entities": [
      "m.0d05w3",
      "m.0f8nf"
    ],
    "answer_entity_names": [
      "China",
      "Tibet"
    ],
    "hop": 1,
    "qid": "WebQTest-1011",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.064r7fk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.064r7fk ns:language.human_language.main_country ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.main_country"
    ]
  },
  {
    "question": "what position did vince lombardi play",
    "question_entity": "m.07_xf",
    "question_entity_name": "Vince Lombardi",
    "answer_entities": [
      "m.06v_1nj"
    ],
    "answer_entity_names": [
      "Right guard"
    ],
    "hop": 1,
    "qid": "WebQTest-1963",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_xf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_xf ns:american_football.football_player.position_s ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "american_football.football_player.position_s"
    ]
  },
  {
    "question": "what inspired michael jackson to become a singer",
    "question_entity": "m.09889g",
    "question_entity_name": "Michael Jackson",
    "answer_entities": [
      "m.01b9db",
      "m.01lc5",
      "m.0407f",
      "m.04ct6p",
      "m.081nh"
    ],
    "answer_entity_names": [
      "Redd Foxx",
      "Charlie Chaplin",
      "James Brown",
      "Nipsey Russell",
      "Walt Disney"
    ],
    "hop": 1,
    "qid": "WebQTest-1630",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "what currency does france accept",
    "question_entity": "m.0f8l9c",
    "question_entity_name": "France",
    "answer_entities": [
      "m.01qyjx",
      "m.02l6h"
    ],
    "answer_entity_names": [
      "CFP franc",
      "Euro"
    ],
    "hop": 1,
    "qid": "WebQTest-1828",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what type of currency do they use in england",
    "question_entity": "m.02jx1",
    "question_entity_name": "England",
    "answer_entities": [
      "m.01nv4h"
    ],
    "answer_entity_names": [
      "Pound sterling"
    ],
    "hop": 1,
    "qid": "WebQTest-251",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jx1 ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what country did buddha come from",
    "question_entity": "m.015k7",
    "question_entity_name": "Gautama Buddha",
    "answer_entities": [
      "m.016zwt"
    ],
    "answer_entity_names": [
      "Nepal"
    ],
    "hop": 1,
    "qid": "WebQTest-79",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015k7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015k7 ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "what does matt damon play in",
    "question_entity": "m.0169dl",
    "question_entity_name": "Matt Damon",
    "answer_entities": [
      "m.01149vs4",
      "m.0114bqb3",
      "m.011ypx",
      "m.01295z79",
      "m.01b195",
      "m.01dw49",
      "m.01j5ql",
      "m.01s1wm",
      "m.02b5wk",
      "m.02hvyj",
      "m.02mpyh",
      "m.02q88q8",
      "m.02qzh2",
      "m.02x3y41",
      "m.034c5l",
      "m.037j_8",
      "m.03k8th",
      "m.03qbfb",
      "m.03s6l2",
      "m.03twd6",
      "m.0418wg",
      "m.043tz0c",
      "m.04dnhc_",
      "m.04ldj71",
      "m.04t46v",
      "m.04vr_f",
      "m.04z257",
      "m.04zm1f",
      "m.057__d",
      "m.061681",
      "m.06hq4s",
      "m.06lsnn",
      "m.06z8s_",
      "m.06zjsc_",
      "m.07_466",
      "m.07024",
      "m.078sj4",
      "m.07dtx3",
      "m.07nxvj",
      "m.07t7246",
      "m.07yd9z",
      "m.07yk1xz",
      "m.095yw_",
      "m.09gdh6k",
      "m.09rvvpm",
      "m.09xbpt",
      "m.0b_w98s",
      "m.0b73_1d",
      "m.0c_3nd",
      "m.0c030yv",
      "m.0cp1_1",
      "m.0crw8cx",
      "m.0ctnxn",
      "m.0dgnwwr",
      "m.0djb3zw",
      "m.0ds_wq",
      "m.0ds1glg",
      "m.0dvdmg",
      "m.0fkf28",
      "m.0gd92",
      "m.0gwm_wy",
      "m.0mzjx5c",
      "m.0n5tytm",
      "m.0ndx3rt",
      "m.0p9lw",
      "m.0pd6bpq",
      "m.0prrm",
      "m.0t51n95",
      "m.0v2vjxh",
      "m.0yzp8"
    ],
    "answer_entity_names": [
      "Extreme Realities",
      "Judge Not: In Defense of Dogma",
      "Good Will Hunting",
      "The Martian",
      "The Rainmaker",
      "Gerry",
      "Courage Under Fire",
      "The Majestic",
      "EuroTrip",
      "Mystic Pizza",
      "The Talented Mr. Ripley",
      "The Good Mother",
      "Jersey Girl",
      "Green Zone",
      "Spirit: Stallion of the Cimarron",
      "Titan A.E.",
      "The Bourne Supremacy",
      "Rounders",
      "Confessions of a Dangerous Mind",
      "The Bourne Identity",
      "Ocean's Twelve",
      "The Informant!",
      "Howard Zinn: You Can´t Be Neutral on a Moving Train",
      "The People Speak",
      "Finding Forrester",
      "The Departed",
      "The Brothers Grimm",
      "School Ties",
      "The Legend of Bagger Vance",
      "The Bourne Ultimatum",
      "Stuck on You",
      "Glory Daze",
      "Ocean's Eleven",
      "The Adjustment Bureau",
      "Magnificent Desolation: Walking On The Moon 3D",
      "Saving Private Ryan",
      "Syriana",
      "Push, Nevada",
      "The Good Shepherd",
      "The Good Old Boys",
      "The Third Wheel",
      "Invictus",
      "Margaret",
      "Hereafter",
      "Happy Feet Two",
      "Ocean's Thirteen",
      "Rising Son",
      "True Grit",
      "Geronimo: An American Legend",
      "Inside Job",
      "Che: Part Two",
      "Behind the Screens",
      "All the Pretty Horses",
      "Contagion",
      "Unauthorized: The Harvey Weinstein Project",
      "Youth Without Youth",
      "We Bought a Zoo",
      "Oh, What a Lovely Tea Party",
      "Interstellar",
      "Chasing Amy",
      "Elysium",
      "Rounders 2",
      "The Zero Theorem",
      "The Monuments Men",
      "Dogma",
      "Promised Land",
      "Jay and Silent Bob Strike Back",
      "Behind the Candelabra",
      "The Great Wall",
      "Field of Dreams"
    ],
    "hop": 2,
    "qid": "WebQTest-1295",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0169dl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0169dl ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "where did the gallipoli war take place",
    "question_entity": "m.01fc7p",
    "question_entity_name": "Gallipoli Campaign",
    "answer_entities": [
      "m.03czv"
    ],
    "answer_entity_names": [
      "Gallipoli"
    ],
    "hop": 1,
    "qid": "WebQTest-1321",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fc7p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fc7p ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "who is rick scott",
    "question_entity": "m.0btx2g",
    "question_entity_name": "Rick Scott",
    "answer_entities": [
      "m.012t_z",
      "m.025sppp",
      "m.0289fz",
      "m.04gc2",
      "m.0fj9f"
    ],
    "answer_entity_names": [
      "Businessperson",
      "Investor",
      "Executive officer",
      "Lawyer",
      "Politician"
    ],
    "hop": 1,
    "qid": "WebQTest-1920",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0btx2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0btx2g ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what was thomas jefferson role in the declaration of independence",
    "question_entity": "m.07cbs",
    "question_entity_name": "Thomas Jefferson",
    "answer_entities": [
      "m.016fc2",
      "m.01d30f",
      "m.02h6fbs",
      "m.02h6pd1",
      "m.03sbb",
      "m.04gc2",
      "m.0cbd2",
      "m.0g0vx",
      "m.0kyk",
      "m.0mn6"
    ],
    "answer_entity_names": [
      "Statesman",
      "Teacher",
      "Philosopher",
      "Archaeologist",
      "Inventor",
      "Lawyer",
      "Writer",
      "Farmer",
      "Author",
      "Architect"
    ],
    "hop": 1,
    "qid": "WebQTest-107",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07cbs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07cbs ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what other countries does south africa share borders with",
    "question_entity": "m.0hzlz",
    "question_entity_name": "South Africa",
    "answer_entities": [
      "m.0166v",
      "m.04hvw",
      "m.04wlh",
      "m.05bmq",
      "m.06v36",
      "m.088q4"
    ],
    "answer_entity_names": [
      "Botswana",
      "Lesotho",
      "Mozambique",
      "Namibia",
      "Swaziland",
      "Zimbabwe"
    ],
    "hop": 2,
    "qid": "WebQTest-1395",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.adjoin_s",
      "location.adjoining_relationship.adjoins"
    ]
  },
  {
    "question": "where is augusta masters 2012",
    "question_entity": "m.0hrf6ww",
    "question_entity_name": "2012 Masters Tournament",
    "answer_entities": [
      "m.04tk4bp"
    ],
    "answer_entity_names": [
      "Augusta National Golf Course"
    ],
    "hop": 1,
    "qid": "WebQTest-1254",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hrf6ww)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hrf6ww ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "where is harley davidson corporate headquarters",
    "question_entity": "m.03ny2",
    "question_entity_name": "Harley-Davidson Motor Company",
    "answer_entities": [
      "m.0dyl9"
    ],
    "answer_entity_names": [
      "Milwaukee"
    ],
    "hop": 2,
    "qid": "WebQTest-814",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ny2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ny2 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.headquarters",
      "location.mailing_address.citytown"
    ]
  },
  {
    "question": "what is the zip code for princeton nj",
    "question_entity": "m.0ljsz",
    "question_entity_name": "Princeton",
    "answer_entities": [
      "m.02070mv",
      "m.02070pc",
      "m.03n_q9c",
      "m.07nrtr1",
      "m.07nrtr8",
      "m.09sgmmm",
      "m.0zscz9w"
    ],
    "answer_entity_names": [
      "08542",
      "08540",
      "08543",
      "08544",
      "08541",
      "08542-4511",
      "08540-6449"
    ],
    "hop": 1,
    "qid": "WebQTest-1381",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ljsz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ljsz ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "where is president kennedy buried",
    "question_entity": "m.0d3k14",
    "question_entity_name": "John F. Kennedy",
    "answer_entities": [
      "m.0lbp_"
    ],
    "answer_entity_names": [
      "Arlington National Cemetery"
    ],
    "hop": 1,
    "qid": "WebQTest-1950",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.deceased_person.place_of_burial ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_burial"
    ]
  }
]