[
  {
    "question": "what league are the indianapolis colts in",
    "question_entity": "m.03wnh",
    "question_entity_name": "Indianapolis Colts",
    "answer_entities": [
      "m.059yj",
      "m.068g_2",
      "m.0hh4"
    ],
    "answer_entity_names": [
      "National Football League",
      "AFC South",
      "American Football Conference"
    ],
    "hop": 2,
    "qid": "WebQTest-418",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03wnh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03wnh ns:sports.sports_team.league ?y .\n?y ns:sports.sports_league_participation.league ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.league",
      "sports.sports_league_participation.league"
    ]
  },
  {
    "question": "what is the name of the capital of belgium",
    "question_entity": "m.0154j",
    "question_entity_name": "Belgium",
    "answer_entities": [
      "m.0177z",
      "m.02rnbv"
    ],
    "answer_entity_names": [
      "Brussels",
      "City of Brussels"
    ],
    "hop": 1,
    "qid": "WebQTest-737",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0154j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0154j ns:location.country.capital ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.capital"
    ]
  },
  {
    "question": "what was john tyler",
    "question_entity": "m.042dk",
    "question_entity_name": "John Tyler",
    "answer_entities": [
      "m.01xljv7"
    ],
    "answer_entity_names": [
      "US President"
    ],
    "hop": 1,
    "qid": "WebQTest-1265",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042dk ns:common.topic.notable_types ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "common.topic.notable_types"
    ]
  },
  {
    "question": "what currency should you take to morocco",
    "question_entity": "m.04wgh",
    "question_entity_name": "Morocco",
    "answer_entities": [
      "m.06qsj1"
    ],
    "answer_entity_names": [
      "Moroccan dirham"
    ],
    "hop": 1,
    "qid": "WebQTest-336",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wgh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wgh ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what is samuel langhorne clemens well known for",
    "question_entity": "m.014635",
    "question_entity_name": "Mark Twain",
    "answer_entities": [
      "m.01d30f",
      "m.02xhgwq",
      "m.0461fx_",
      "m.0cbd2",
      "m.0d8qb",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Teacher",
      "Novelist",
      "Humorist",
      "Writer",
      "Journalist",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-1543",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014635)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014635 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what did peter tchaikovsky do",
    "question_entity": "m.063tn",
    "question_entity_name": "Pyotr Ilyich Tchaikovsky",
    "answer_entities": [
      "m.01c72t",
      "m.02h6nhv",
      "m.09jwl"
    ],
    "answer_entity_names": [
      "Composer",
      "Librettist",
      "Musician"
    ],
    "hop": 1,
    "qid": "WebQTest-82",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.063tn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.063tn ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "in which state was the battle of antietam fought",
    "question_entity": "m.0lkxb",
    "question_entity_name": "Battle of Antietam",
    "answer_entities": [
      "m.04rrd"
    ],
    "answer_entity_names": [
      "Maryland"
    ],
    "hop": 1,
    "qid": "WebQTest-2024",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lkxb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lkxb ns:time.event.locations ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what movies has liam hemsworth played in",
    "question_entity": "m.04yd0fh",
    "question_entity_name": "Liam Hemsworth",
    "answer_entities": [
      "m.01222hf6",
      "m.0123hmcd",
      "m.0134v4hd",
      "m.047v2p4",
      "m.06_vszc",
      "m.07ykkx5",
      "m.0gffmn8",
      "m.0gkz15s",
      "m.0gxtt2w",
      "m.0gxtt3_",
      "m.0hz6697",
      "m.0k9390g",
      "m.0lcw1gn",
      "m.0n40qmp",
      "m.0ngvsvk",
      "m.0ngvtb_",
      "m.0v9rfj5",
      "m.0wk4knj"
    ],
    "answer_entity_names": [
      "By Way of Helena",
      "The Dressmaker",
      "Draft:Independence Day 2",
      "Knowing",
      "Triangle",
      "The Last Song",
      "The Expendables 2",
      "The Hunger Games",
      "Love and Honor",
      "Arabian Nights",
      "Timeless",
      "Paranoia",
      "Empire State",
      "The Hunger Games: Catching Fire",
      "The Hunger Games: Mockingjay, Part 1",
      "The Hunger Games: Mockingjay, Part 2",
      "Aurora Rising",
      "Cut Bank"
    ],
    "hop": 2,
    "qid": "WebQTest-1737",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yd0fh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yd0fh ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what currency does singapore use",
    "question_entity": "m.06t2t",
    "question_entity_name": "Singapore",
    "answer_entities": [
      "m.02f32g"
    ],
    "answer_entity_names": [
      "Singapore dollar"
    ],
    "hop": 1,
    "qid": "WebQTest-1842",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what did dr jack kevorkian do",
    "question_entity": "m.01ctkj",
    "question_entity_name": "Jack Kevorkian",
    "answer_entities": [
      "m.020f6w",
      "m.03bwz9y"
    ],
    "answer_entity_names": [
      "Right to die",
      "Assisted suicide"
    ],
    "hop": 1,
    "qid": "WebQTest-822",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ctkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ctkj ns:base.activism.activist.area_of_activism ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.activism.activist.area_of_activism"
    ]
  },
  {
    "question": "what is the zip code for azle texas",
    "question_entity": "m.013n59",
    "question_entity_name": "Azle",
    "answer_entities": [
      "m.020zj8h",
      "m.07nqdl8"
    ],
    "answer_entity_names": [
      "76020",
      "76098"
    ],
    "hop": 1,
    "qid": "WebQTest-893",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013n59)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013n59 ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "who would play luke skywalker",
    "question_entity": "m.0f1bg",
    "question_entity_name": "Luke Skywalker",
    "answer_entities": [
      "m.0154d7"
    ],
    "answer_entity_names": [
      "Mark Hamill"
    ],
    "hop": 2,
    "qid": "WebQTest-901",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1bg ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tv.tv_character.appeared_in_tv_program",
      "tv.regular_tv_appearance.actor"
    ]
  },
  {
    "question": "where do ireland play rugby union",
    "question_entity": "m.03t3zk",
    "question_entity_name": "Ireland national rugby union team",
    "answer_entities": [
      "m.05h4fd2"
    ],
    "answer_entity_names": [
      "Aviva Stadium"
    ],
    "hop": 1,
    "qid": "WebQTest-996",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03t3zk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03t3zk ns:sports.sports_team.arena_stadium ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.arena_stadium"
    ]
  },
  {
    "question": "where is walton county ga",
    "question_entity": "m.0nym5",
    "question_entity_name": "Walton County",
    "answer_entities": [
      "m.06kt1_8",
      "m.0d0x8"
    ],
    "answer_entity_names": [
      "Atlanta-Sandy Springs-Marietta, GA Metropolitan Statistical Area",
      "Georgia"
    ],
    "hop": 1,
    "qid": "WebQTest-1173",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nym5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nym5 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "who is lamar odom playing for this year",
    "question_entity": "m.02_nkp",
    "question_entity_name": "Lamar Odom",
    "answer_entities": [
      "m.05s9mb",
      "m.0jm3v",
      "m.0jmcv",
      "m.0jmjr",
      "m.0jmk7"
    ],
    "answer_entity_names": [
      "Saski Baskonia",
      "New York Knicks",
      "Dallas Mavericks",
      "Los Angeles Clippers",
      "Los Angeles Lakers"
    ],
    "hop": 2,
    "qid": "WebQTest-1074",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02_nkp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02_nkp ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what language does algerian people speak",
    "question_entity": "m.0h3y",
    "question_entity_name": "Algeria",
    "answer_entities": [
      "m.035y4y",
      "m.03dzq0",
      "m.05zyx75",
      "m.064_8sq",
      "m.0h7prcf",
      "m.0j6528c",
      "m.0jzc"
    ],
    "answer_entity_names": [
      "Guanche Language",
      "Northern Berber languages",
      "Proto-Berber language",
      "French",
      "Western Berber languages",
      "Numidian language",
      "Arabic Language"
    ],
    "hop": 1,
    "qid": "WebQTest-580",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h3y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h3y ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what form of government do we have in the philippines",
    "question_entity": "m.05v8c",
    "question_entity_name": "Philippines",
    "answer_entities": [
      "m.01d9r3",
      "m.01fpfn",
      "m.06cx9",
      "m.0c9rw5"
    ],
    "answer_entity_names": [
      "Presidential system",
      "Unitary state",
      "Republic",
      "Constitutional republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1424",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what political party does julia gillard belong to",
    "question_entity": "m.02kx9r",
    "question_entity_name": "Julia Gillard",
    "answer_entities": [
      "m.02w5p3q",
      "m.0q96"
    ],
    "answer_entity_names": [
      "Queensland Labor Party",
      "Australian Labor Party"
    ],
    "hop": 2,
    "qid": "WebQTest-650",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02kx9r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02kx9r ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.politician.party",
      "government.political_party_tenure.party"
    ]
  },
  {
    "question": "who formed the american federation of labor",
    "question_entity": "m.01z4fn",
    "question_entity_name": "American Federation of Labor",
    "answer_entities": [
      "m.01w91b"
    ],
    "answer_entity_names": [
      "Samuel Gompers"
    ],
    "hop": 1,
    "qid": "WebQTest-1368",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01z4fn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01z4fn ns:organization.organization.founders ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.founders"
    ]
  },
  {
    "question": "where did kennedy 's inaugural address take place",
    "question_entity": "m.0d3k14",
    "question_entity_name": "John F. Kennedy",
    "answer_entities": [
      "m.07vth",
      "m.0rh6k"
    ],
    "answer_entity_names": [
      "United States Capitol",
      "Washington, D.C."
    ],
    "hop": 1,
    "qid": "WebQTest-620",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.05br2y1 ns:time.event.locations ?x .\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "what are the mountains in northern italy called",
    "question_entity": "m.01cg88",
    "question_entity_name": "Apennine Mountains",
    "answer_entities": [
      "Apennine Mountains"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-2020",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cg88)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cg88 ns:type.object.name ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "type.object.name"
    ]
  },
  {
    "question": "who developed the tcp ip reference model",
    "question_entity": "m.07hzk",
    "question_entity_name": "Transmission Control Protocol",
    "answer_entities": [
      "m.01_z5v",
      "m.07z23"
    ],
    "answer_entity_names": [
      "Robert  E. Kahn",
      "Vint Cerf"
    ],
    "hop": 1,
    "qid": "WebQTest-142",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hzk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hzk ns:base.argumentmaps.original_idea.innovator ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.argumentmaps.original_idea.innovator"
    ]
  },
  {
    "question": "who played kirk",
    "question_entity": "m.0crtw",
    "question_entity_name": "James T. Kirk",
    "answer_entities": [
      "m.06jkh9",
      "m.084m3",
      "m.0c6g1l"
    ],
    "answer_entity_names": [
      "Jimmy Bennett",
      "William Shatner",
      "Chris Pine"
    ],
    "hop": 2,
    "qid": "WebQTest-1699",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0crtw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0crtw ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "where did kansas city royals come from",
    "question_entity": "m.049n7",
    "question_entity_name": "Kansas City Royals",
    "answer_entities": [
      "m.04f_d"
    ],
    "answer_entity_names": [
      "Kansas City"
    ],
    "hop": 1,
    "qid": "WebQTest-596",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049n7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049n7 ns:sports.sports_team.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.location"
    ]
  },
  {
    "question": "what kind of music did franz liszt compose",
    "question_entity": "m.0hqgp",
    "question_entity_name": "Life of Franz Liszt",
    "answer_entities": [
      "m.05lls",
      "m.06gk7",
      "m.06q6jz",
      "m.0ggq0m",
      "m.0l8gh"
    ],
    "answer_entity_names": [
      "Opera",
      "Romantic music",
      "Art song",
      "Classical music",
      "Chamber music"
    ],
    "hop": 1,
    "qid": "WebQTest-1098",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hqgp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hqgp ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "where did emperor hirohito live",
    "question_entity": "m.02sm8",
    "question_entity_name": "Hirohito",
    "answer_entities": [
      "m.03xm9l"
    ],
    "answer_entity_names": [
      "Aoyama, Minato, Tokyo"
    ],
    "hop": 1,
    "qid": "WebQTest-360",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02sm8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02sm8 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what to do downtown sacramento",
    "question_entity": "m.07bcn",
    "question_entity_name": "Sacramento",
    "answer_entities": [
      "m.03mdd2l",
      "m.03v4j7",
      "m.03v4nl",
      "m.065yn2d",
      "m.07skv9",
      "m.0962d",
      "m.0b7727",
      "m.0bgv0p",
      "m.0crhh7y",
      "m.0d7nnr",
      "m.0k4wq0k"
    ],
    "answer_entity_names": [
      "Raging Waters Sacramento",
      "California State Capitol Museum",
      "California State Railroad Museum",
      "California Automobile Museum",
      "California State Indian Museum",
      "Sutter's Fort",
      "Crocker Art Museum",
      "Sacramento Zoo",
      "Sacramento History Museum",
      "Folsom Lake",
      "B Street Theatre"
    ],
    "hop": 1,
    "qid": "WebQTest-1513",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07bcn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07bcn ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what states make up the midwest us",
    "question_entity": "m.0q76g",
    "question_entity_name": "Midwestern United States",
    "answer_entities": [
      "m.03kch9",
      "m.03pz_y",
      "m.03pzys",
      "m.03s0w",
      "m.03v0t",
      "m.03v1s",
      "m.0488g",
      "m.04rrx",
      "m.04ych",
      "m.04ykg",
      "m.05fhy",
      "m.05fky",
      "m.05kkh",
      "m.06mz5",
      "m.0824r",
      "m.0t8xg"
    ],
    "answer_entity_names": [
      "Avenue of the Saints",
      "West North Central States",
      "East North Central States",
      "Iowa",
      "Illinois",
      "Indiana",
      "Kansas",
      "Michigan",
      "Missouri",
      "Minnesota",
      "Nebraska",
      "North Dakota",
      "Ohio",
      "South Dakota",
      "Wisconsin",
      "Council Grove"
    ],
    "hop": 1,
    "qid": "WebQTest-428",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0q76g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0q76g ns:location.location.contains ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.contains"
    ]
  },
  {
    "question": "which country does greenland belong to",
    "question_entity": "m.035v3",
    "question_entity_name": "Greenland",
    "answer_entities": [
      "m.0k6nt"
    ],
    "answer_entity_names": [
      "Denmark"
    ],
    "hop": 1,
    "qid": "WebQTest-86",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035v3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035v3 ns:location.administrative_division.country ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.administrative_division.country"
    ]
  },
  {
    "question": "where did harry s truman go to school",
    "question_entity": "m.09bg4l",
    "question_entity_name": "Harry S. Truman",
    "answer_entities": [
      "m.016vf7",
      "m.064r775",
      "m.0bvjpw"
    ],
    "answer_entity_names": [
      "University of Missouri–Kansas City",
      "University of Missouri–Kansas City School of Law",
      "William Chrisman High School"
    ],
    "hop": 2,
    "qid": "WebQTest-1915",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09bg4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09bg4l ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "where did clay matthews go to school",
    "question_entity": "m.04zy7pw",
    "question_entity_name": "Clay Matthews III",
    "answer_entities": [
      "m.065y4w7",
      "m.06w97y"
    ],
    "answer_entity_names": [
      "University of Southern California",
      "Agoura High School"
    ],
    "hop": 2,
    "qid": "WebQTest-461",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04zy7pw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04zy7pw ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "where does houston dynamo play",
    "question_entity": "m.09cl0w",
    "question_entity_name": "Houston Dynamo",
    "answer_entities": [
      "m.03l2n"
    ],
    "answer_entity_names": [
      "Houston"
    ],
    "hop": 1,
    "qid": "WebQTest-1565",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09cl0w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09cl0w ns:sports.sports_team.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.location"
    ]
  },
  {
    "question": "what inspired michelangelo buonarroti",
    "question_entity": "m.058w5",
    "question_entity_name": "Michelangelo",
    "answer_entities": [
      "m.013w_3",
      "m.01cc3w",
      "m.04qj5",
      "m.072cpw",
      "m.0d8wb",
      "m.0j56d"
    ],
    "answer_entity_names": [
      "Giovanni Pico della Mirandola",
      "Domenico Ghirlandaio",
      "Lorenzo de' Medici",
      "Melozzo da Forlì",
      "Girolamo Savonarola",
      "Donatello"
    ],
    "hop": 1,
    "qid": "WebQTest-1419",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.058w5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.058w5 ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "where did cs lewis wrote",
    "question_entity": "m.01wd02c",
    "question_entity_name": "C. S. Lewis",
    "answer_entities": [
      "m.01l63"
    ],
    "answer_entity_names": [
      "Belfast"
    ],
    "hop": 2,
    "qid": "WebQTest-1715",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wd02c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wd02c ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "what continent does canada belong to",
    "question_entity": "m.0d060g",
    "question_entity_name": "Canada",
    "answer_entities": [
      "m.059g4"
    ],
    "answer_entity_names": [
      "North America"
    ],
    "hop": 1,
    "qid": "WebQTest-1297",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  },
  {
    "question": "what time in china hong kong",
    "question_entity": "m.03h64",
    "question_entity_name": "Hong Kong",
    "answer_entities": [
      "m.04qqww"
    ],
    "answer_entity_names": [
      "Hong Kong Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1582",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h64 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "where did the russian japanese war happen",
    "question_entity": "m.0c4gf",
    "question_entity_name": "Russo-Japanese War",
    "answer_entities": [
      "m.01krx6",
      "m.0cswl",
      "m.0df4f"
    ],
    "answer_entity_names": [
      "Korean Peninsula",
      "Manchuria",
      "Yellow Sea"
    ],
    "hop": 1,
    "qid": "WebQTest-1891",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c4gf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c4gf ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "what language turkey people speak",
    "question_entity": "m.01znc_",
    "question_entity_name": "Turkey",
    "answer_entities": [
      "m.02hwyss",
      "m.033xvz",
      "m.04p7x",
      "m.0b1g2",
      "m.0jzc"
    ],
    "answer_entity_names": [
      "Turkish Language",
      "Zaza language",
      "Ladino Language",
      "Kurdish languages",
      "Arabic Language"
    ],
    "hop": 1,
    "qid": "WebQTest-220",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01znc_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01znc_ ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what part of the country is new england",
    "question_entity": "m.029jpy",
    "question_entity_name": "New England",
    "answer_entities": [
      "m.027rjr"
    ],
    "answer_entity_names": [
      "Northeastern United States"
    ],
    "hop": 1,
    "qid": "WebQTest-602",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.029jpy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.029jpy ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what is there to do for fun in kansas city",
    "question_entity": "m.04f_d",
    "question_entity_name": "Kansas City",
    "answer_entities": [
      "m.02665lb",
      "m.026g4b1",
      "m.02rccg",
      "m.0321ly",
      "m.03n2sf",
      "m.03p0kv",
      "m.04wglg",
      "m.065tqj",
      "m.06rchd",
      "m.0724nn",
      "m.075m4m",
      "m.08c_14",
      "m.0cnyls8",
      "m.0gfgk80",
      "m.0jyw372"
    ],
    "answer_entity_names": [
      "Kansas City Zoo",
      "Kauffman Center for the Performing Arts",
      "18th and Vine-Downtown East",
      "Kemper Museum of Contemporary Art",
      "Liberty Memorial",
      "Harry S. Truman Presidential Library and Museum",
      "Crown Center",
      "Worlds of Fun",
      "Sprint Center",
      "Negro Leagues Baseball Museum",
      "Boulevard Brewing Company",
      "Oceans of Fun",
      "Hotel Phillips",
      "Deer Creek Golf Course",
      "Ewing and Muriel Kauffman Memorial Garden"
    ],
    "hop": 1,
    "qid": "WebQTest-266",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04f_d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04f_d ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "who fought in the battle of vicksburg",
    "question_entity": "m.01hf7f",
    "question_entity_name": "Siege of Vicksburg",
    "answer_entities": [
      "m.02_qg_",
      "m.020d5",
      "m.02fp48",
      "m.07t2k",
      "m.09c7w0"
    ],
    "answer_entity_names": [
      "John C. Pemberton",
      "Confederate States of America",
      "Union",
      "Ulysses S. Grant",
      "United States of America"
    ],
    "hop": 1,
    "qid": "WebQTest-1797",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hf7f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hf7f ns:base.culturalevent.event.entity_involved ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.culturalevent.event.entity_involved"
    ]
  }
]