[
  {
    "question": "what the language spoken in indonesia",
    "question_entity": "m.03ryn",
    "question_entity_name": "Indonesia",
    "answer_entities": [
      "m.01qzl2",
      "m.0201jz",
      "m.020257",
      "m.02bv9",
      "m.02h40lc",
      "m.02hwx1l",
      "m.075yc64",
      "m.097kp",
      "m.0f9fsf",
      "m.0y1mh"
    ],
    "answer_entity_names": [
      "Sunda Language",
      "Bali Language",
      "Madura Language",
      "Dutch Language",
      "English Language",
      "Javanese Language",
      "Batak Language",
      "Indonesian Language",
      "Tobelo Language",
      "Malay Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1392",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ryn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ryn ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what two continents is turkey on",
    "question_entity": "m.01znc_",
    "question_entity_name": "Turkey",
    "answer_entities": [
      "m.02qkt"
    ],
    "answer_entity_names": [
      "Eurasia"
    ],
    "hop": 1,
    "qid": "WebQTest-327",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01znc_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01znc_ ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  },
  {
    "question": "who is jacob latimore",
    "question_entity": "m.0521dwp",
    "question_entity_name": "Jacob Latimore",
    "answer_entities": [
      "m.02h6p92",
      "m.02hrh1q",
      "m.09l65"
    ],
    "answer_entity_names": [
      "Dancer",
      "Actor",
      "Singer"
    ],
    "hop": 1,
    "qid": "WebQTest-988",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0521dwp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0521dwp ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what county is west st paul in",
    "question_entity": "m.0vz77",
    "question_entity_name": "West St. Paul",
    "answer_entities": [
      "m.0nhr5"
    ],
    "answer_entity_names": [
      "Dakota County"
    ],
    "hop": 1,
    "qid": "WebQTest-344",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vz77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vz77 ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "where did nat turner 1831 rebellion occur",
    "question_entity": "m.0h5d0t",
    "question_entity_name": "Nat Turner's slave rebellion",
    "answer_entities": [
      "m.0mn21"
    ],
    "answer_entity_names": [
      "Southampton County"
    ],
    "hop": 1,
    "qid": "WebQTest-900",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h5d0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h5d0t ns:time.event.locations ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.locations"
    ]
  },
  {
    "question": "where does toronto get its water from",
    "question_entity": "m.0h7h6",
    "question_entity_name": "Toronto",
    "answer_entities": [
      "m.02vnl7x"
    ],
    "answer_entity_names": [
      "Ashbridges Bay Wastewater Treatment Plant"
    ],
    "hop": 1,
    "qid": "WebQTest-873",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h7h6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h7h6 ns:base.infrastructure.infrastructural_municipality.sewage_treatment_plant ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.infrastructure.infrastructural_municipality.sewage_treatment_plant"
    ]
  },
  {
    "question": "where george lopez was born",
    "question_entity": "m.02xfj0",
    "question_entity_name": "George Lopez",
    "answer_entities": [
      "m.01kfz0"
    ],
    "answer_entity_names": [
      "Mission Hills"
    ],
    "hop": 1,
    "qid": "WebQTest-47",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xfj0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xfj0 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what kind of government is egypt",
    "question_entity": "m.02k54",
    "question_entity_name": "Egypt",
    "answer_entities": [
      "m.01dw03",
      "m.02tz3y"
    ],
    "answer_entity_names": [
      "Semi-presidential system",
      "Provisional government"
    ],
    "hop": 1,
    "qid": "WebQTest-801",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what is there to do in peoria illinois",
    "question_entity": "m.0sf9_",
    "question_entity_name": "Peoria",
    "answer_entities": [
      "m.025vxh4",
      "m.02qlj1w",
      "m.04mzskn",
      "m.04vxv8f",
      "m.05mxh89",
      "m.05zlj1p",
      "m.067f5q",
      "m.08bsxj",
      "m.093pd6",
      "m.0cmd5ys"
    ],
    "answer_entity_names": [
      "Peoria Civic Center",
      "John C. Flanagan House Museum",
      "Heart of Illinois Fair",
      "WeaverRidge Golf Club",
      "Lakeview Museum of Arts and Sciences",
      "Par-A-Dice Hotel and Casino",
      "Dozer Park",
      "Wildlife Prairie State Park",
      "George L. Luthy Memorial Botanical Garden",
      "Peoria Zoo"
    ],
    "hop": 1,
    "qid": "WebQTest-365",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sf9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sf9_ ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "where is kansas city",
    "question_entity": "m.04f_d",
    "question_entity_name": "Kansas City",
    "answer_entities": [
      "m.0ndpz"
    ],
    "answer_entity_names": [
      "Platte County"
    ],
    "hop": 1,
    "qid": "WebQTest-953",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04f_d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04f_d ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what disease does robin roberts have",
    "question_entity": "m.06k3_t",
    "question_entity_name": "Robin Roberts",
    "answer_entities": [
      "m.019gky",
      "m.0j8hd"
    ],
    "answer_entity_names": [
      "Myelodysplastic syndrome",
      "Breast cancer"
    ],
    "hop": 1,
    "qid": "WebQTest-399",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06k3_t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06k3_t ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "medicine.notable_person_with_medical_condition.condition"
    ]
  },
  {
    "question": "what year did super mario bros 2 come out",
    "question_entity": "m.011v_m",
    "question_entity_name": "Super Mario Bros. 2",
    "answer_entities": [
      "1988-10"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-932",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.011v_m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.011v_m ns:cvg.computer_videogame.release_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "cvg.computer_videogame.release_date"
    ]
  },
  {
    "question": "what did the blackfoot indians speak",
    "question_entity": "m.016f5d",
    "question_entity_name": "Blackfoot Confederacy",
    "answer_entities": [
      "m.02h40lc",
      "m.02hx790"
    ],
    "answer_entity_names": [
      "English Language",
      "Blackfoot Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1843",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016f5d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016f5d ns:people.ethnicity.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.languages_spoken"
    ]
  },
  {
    "question": "what year did ray allen join the nba",
    "question_entity": "m.03lh3v",
    "question_entity_name": "Ray Allen",
    "answer_entities": [
      "1996"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-631",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03lh3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03lh3v ns:sports.pro_athlete.career_start ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.career_start"
    ]
  },
  {
    "question": "how many languages do they speak in switzerland",
    "question_entity": "m.06mzp",
    "question_entity_name": "Switzerland",
    "answer_entities": [
      "m.02bjrlw",
      "m.04306rv",
      "m.064_8sq",
      "m.06ctk"
    ],
    "answer_entity_names": [
      "Italian Language",
      "German Language",
      "French",
      "Romansh language"
    ],
    "hop": 1,
    "qid": "WebQTest-1526",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mzp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mzp ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "who is thor heyerdahl",
    "question_entity": "m.09fcm",
    "question_entity_name": "Thor Heyerdahl",
    "answer_entities": [
      "m.01d_h8",
      "m.029lh1",
      "m.02jknp",
      "m.02xlj97",
      "m.06q2q",
      "m.0dgd_"
    ],
    "answer_entity_names": [
      "Film Producer",
      "Adventurer",
      "Film director",
      "Ethnographer",
      "Scientist",
      "Cinematographer"
    ],
    "hop": 1,
    "qid": "WebQTest-704",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09fcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09fcm ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where all did picasso live",
    "question_entity": "m.060_7",
    "question_entity_name": "Pablo Picasso",
    "answer_entities": [
      "m.01978d",
      "m.056_y",
      "m.0f8l9c"
    ],
    "answer_entity_names": [
      "Málaga",
      "Madrid",
      "France"
    ],
    "hop": 2,
    "qid": "WebQTest-1441",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060_7 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "what was queen elizabeth ii childhood nickname",
    "question_entity": "m.0d1_f",
    "question_entity_name": "Elizabeth II",
    "answer_entities": [
      "Elizabeth II",
      "Lilibet"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-616",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d1_f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d1_f ns:base.schemastaging.context_name.nickname ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.schemastaging.context_name.nickname"
    ]
  },
  {
    "question": "what disease did abraham lincoln had",
    "question_entity": "m.0gzh",
    "question_entity_name": "Abraham Lincoln",
    "answer_entities": [
      "m.02s645",
      "m.06vr2",
      "m.0cc6n"
    ],
    "answer_entity_names": [
      "Strabismus",
      "Smallpox",
      "Marfan syndrome"
    ],
    "hop": 1,
    "qid": "WebQTest-1713",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "medicine.notable_person_with_medical_condition.condition"
    ]
  },
  {
    "question": "what band was george clinton in",
    "question_entity": "m.0ql36",
    "question_entity_name": "George Clinton",
    "answer_entities": [
      "m.01180cs1",
      "m.01rjw6v",
      "m.01tzqkk",
      "m.03xp1t4",
      "m.0qlhx",
      "m.0qmny"
    ],
    "answer_entity_names": [
      "Parliament",
      "Dolby's Cube",
      "The Parliaments",
      "George Clinton & Bootsy Collins",
      "Parliament-Funkadelic",
      "Funkadellic"
    ],
    "hop": 2,
    "qid": "WebQTest-526",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ql36)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ql36 ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.group_member.membership",
      "music.group_membership.group"
    ]
  },
  {
    "question": "what type of music did john lennon sing",
    "question_entity": "m.01vsl3_",
    "question_entity_name": "John Lennon",
    "answer_entities": [
      "m.02k_kn",
      "m.02yv6b",
      "m.03ckfl9",
      "m.05bt6j",
      "m.05w3f",
      "m.064t9",
      "m.06by7",
      "m.08jyyk",
      "m.0cx7f"
    ],
    "answer_entity_names": [
      "Soft rock",
      "Blues rock",
      "Experimental music",
      "Pop rock",
      "Psychedelic rock",
      "Pop music",
      "Rock music",
      "Experimental rock",
      "Art rock"
    ],
    "hop": 1,
    "qid": "WebQTest-84",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what is the government system of saudi arabia",
    "question_entity": "m.01z215",
    "question_entity_name": "Saudi Arabia",
    "answer_entities": [
      "m.01fpfn",
      "m.07v2k4",
      "m.0hqc2"
    ],
    "answer_entity_names": [
      "Unitary state",
      "Islamic state",
      "Absolute monarchy"
    ],
    "hop": 1,
    "qid": "WebQTest-1861",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01z215)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01z215 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what did scott joplin play",
    "question_entity": "m.07b69",
    "question_entity_name": "Scott Joplin",
    "answer_entities": [
      "m.05r5c",
      "m.06ch55"
    ],
    "answer_entity_names": [
      "Piano",
      "Jazz piano"
    ],
    "hop": 1,
    "qid": "WebQTest-690",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07b69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07b69 ns:music.group_member.instruments_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.group_member.instruments_played"
    ]
  },
  {
    "question": "what timezone is sweden",
    "question_entity": "m.0d0vqn",
    "question_entity_name": "Sweden",
    "answer_entities": [
      "m.02llzg"
    ],
    "answer_entity_names": [
      "Central European Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-33",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0vqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0vqn ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "where is ibrahim afellay from",
    "question_entity": "m.08w78j",
    "question_entity_name": "Ibrahim Afellay",
    "answer_entities": [
      "m.0d9s5"
    ],
    "answer_entity_names": [
      "Utrecht"
    ],
    "hop": 1,
    "qid": "WebQTest-1426",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08w78j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08w78j ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where was mary todd lincoln from",
    "question_entity": "m.01ypl0",
    "question_entity_name": "Mary Todd Lincoln",
    "answer_entities": [
      "m.0d9y6"
    ],
    "answer_entity_names": [
      "Lexington"
    ],
    "hop": 1,
    "qid": "WebQTest-879",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ypl0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ypl0 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where did alex chilton die",
    "question_entity": "m.024bwn",
    "question_entity_name": "Alex Chilton",
    "answer_entities": [
      "m.0f2tj"
    ],
    "answer_entity_names": [
      "New Orleans"
    ],
    "hop": 1,
    "qid": "WebQTest-542",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024bwn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024bwn ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what type of music did claude debussy play",
    "question_entity": "m.01vvy",
    "question_entity_name": "Claude Debussy",
    "answer_entities": [
      "m.014m9r",
      "m.01wqlc",
      "m.021dvj",
      "m.06q6jz",
      "m.0d6n1",
      "m.0ggq0m",
      "m.0h4v9d"
    ],
    "answer_entity_names": [
      "Incidental music",
      "20th-century classical music",
      "Ballet",
      "Art song",
      "Ballet",
      "Classical music",
      "French opera"
    ],
    "hop": 1,
    "qid": "WebQTest-389",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vvy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vvy ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "when the atlanta braves won the world series",
    "question_entity": "m.0x2p",
    "question_entity_name": "Atlanta Braves",
    "answer_entities": [
      "m.04j712"
    ],
    "answer_entity_names": [
      "1995 World Series"
    ],
    "hop": 1,
    "qid": "WebQTest-686",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x2p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x2p ns:sports.sports_team.championships ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.championships"
    ]
  },
  {
    "question": "where does robert irvine come from",
    "question_entity": "m.0272y2y",
    "question_entity_name": "Robert Irvine",
    "answer_entities": [
      "m.0jgvy"
    ],
    "answer_entity_names": [
      "Salisbury"
    ],
    "hop": 1,
    "qid": "WebQTest-530",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0272y2y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0272y2y ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what were amelia earhart 's achievements",
    "question_entity": "m.0lngf",
    "question_entity_name": "Amelia Earhart",
    "answer_entities": [
      "m.0cbd2",
      "m.0hltv"
    ],
    "answer_entity_names": [
      "Writer",
      "Pilot"
    ],
    "hop": 1,
    "qid": "WebQTest-301",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lngf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lngf ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what type of government does argentina have today",
    "question_entity": "m.0jgd",
    "question_entity_name": "Argentina",
    "answer_entities": [
      "m.01d9r3",
      "m.0c9rw5",
      "m.0drnm",
      "m.0j729"
    ],
    "answer_entity_names": [
      "Presidential system",
      "Constitutional republic",
      "Representative democracy",
      "Federal republic"
    ],
    "hop": 1,
    "qid": "WebQTest-2015",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgd ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "who were alexander graham bell 's siblings",
    "question_entity": "m.0k70",
    "question_entity_name": "Alexander Graham Bell",
    "answer_entities": [
      "m.0k257qt",
      "m.0w17rt6"
    ],
    "answer_entity_names": [
      "Melville James Bell",
      "Edward Charles Bell"
    ],
    "hop": 2,
    "qid": "WebQTest-606",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k70 ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.sibling_s",
      "people.sibling_relationship.sibling"
    ]
  },
  {
    "question": "what currency shall i take to croatia",
    "question_entity": "m.01pj7",
    "question_entity_name": "Croatia",
    "answer_entities": [
      "m.02z8jt"
    ],
    "answer_entity_names": [
      "Croatian kuna"
    ],
    "hop": 1,
    "qid": "WebQTest-1442",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pj7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pj7 ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what drug killed marilyn monroe",
    "question_entity": "m.04wqr",
    "question_entity_name": "Marilyn Monroe",
    "answer_entities": [
      "m.0bwj2gf"
    ],
    "answer_entity_names": [
      "Barbiturate overdose"
    ],
    "hop": 1,
    "qid": "WebQTest-1356",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wqr ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what are dallas cowboys colors",
    "question_entity": "m.02896",
    "question_entity_name": "Dallas Cowboys",
    "answer_entities": [
      "m.01g5v",
      "m.02rnmb",
      "m.03vtbc",
      "m.06kqt3",
      "m.083jv"
    ],
    "answer_entity_names": [
      "Blue",
      "Navy Blue",
      "Silver",
      "Royal blue",
      "White"
    ],
    "hop": 1,
    "qid": "WebQTest-1708",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02896)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02896 ns:sports.sports_team.colors ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team.colors"
    ]
  },
  {
    "question": "who played harry potter dumbledore actor",
    "question_entity": "m.0cb2r",
    "question_entity_name": "Professor Albus Dumbledore",
    "answer_entities": [
      "m.010xjr",
      "m.015rkw",
      "m.076xsqc",
      "m.0g1gv_"
    ],
    "answer_entity_names": [
      "Richard Harris",
      "Michael Gambon",
      "Toby Regbo",
      "Dane Farwell"
    ],
    "hop": 2,
    "qid": "WebQTest-1002",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cb2r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cb2r ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "question": "where was terry waite born",
    "question_entity": "m.013p_j",
    "question_entity_name": "Terry Waite",
    "answer_entities": [
      "m.01425k"
    ],
    "answer_entity_names": [
      "Bollington"
    ],
    "hop": 1,
    "qid": "WebQTest-1677",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013p_j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013p_j ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what did joan crawford died of",
    "question_entity": "m.0cgbf",
    "question_entity_name": "Joan Crawford",
    "answer_entities": [
      "m.01_qc_",
      "m.0gk4g"
    ],
    "answer_entity_names": [
      "Pancreatic cancer",
      "heart attack"
    ],
    "hop": 1,
    "qid": "WebQTest-1912",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgbf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgbf ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what is the political system in germany",
    "question_entity": "m.0345h",
    "question_entity_name": "Germany",
    "answer_entities": [
      "m.0c9rw5",
      "m.0drnm",
      "m.0glnsx",
      "m.0j729"
    ],
    "answer_entity_names": [
      "Constitutional republic",
      "Representative democracy",
      "Parliamentary republic",
      "Federal republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1483",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "who are the coaches for the oakland raiders",
    "question_entity": "m.05l71",
    "question_entity_name": "Oakland Raiders",
    "answer_entities": [
      "m.03h4k5d"
    ],
    "answer_entity_names": [
      "Tony Sparano"
    ],
    "hop": 1,
    "qid": "WebQTest-1534",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05l71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05l71 ns:american_football.football_team.current_head_coach ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "american_football.football_team.current_head_coach"
    ]
  },
  {
    "question": "where did kim jong il die",
    "question_entity": "m.0143y5",
    "question_entity_name": "Kim Jong-il",
    "answer_entities": [
      "m.0cw5k"
    ],
    "answer_entity_names": [
      "Pyongyang"
    ],
    "hop": 1,
    "qid": "WebQTest-1599",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0143y5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0143y5 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what school did ben roethlisberger go to",
    "question_entity": "m.033t8w",
    "question_entity_name": "Ben Roethlisberger",
    "answer_entities": [
      "m.01r3y2"
    ],
    "answer_entity_names": [
      "Miami University"
    ],
    "hop": 2,
    "qid": "WebQTest-193",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033t8w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033t8w ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "where did andy murray started playing tennis",
    "question_entity": "m.03wc52",
    "question_entity_name": "Andy Murray",
    "answer_entities": [
      "2005"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-31",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03wc52)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03wc52 ns:tennis.tennis_player.year_turned_pro ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "tennis.tennis_player.year_turned_pro"
    ]
  }
]