[
  {
    "qid": "WebQTest-1561",
    "question": "who created arthur?",
    "topic_entity": "m.0px0r",
    "topic_entity_name": "Arthur",
    "answers": [
      "m.02g2wh",
      "m.058nj4",
      "m.06_dbm"
    ],
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0px0r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0px0r ns:tv.tv_program.program_creator ?x .\n}\n",
    "compositionality_type": "simple",
    "inferential_chain": [
      "tv.tv_program.program_creator"
    ]
  },
  {
    "qid": "WebQTest-1654",
    "question": "what are bigos?",
    "topic_entity": "m.06815z",
    "topic_entity_name": "Bigos",
    "answers": [
      "m.0jnxw"
    ],
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06815z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06815z ns:food.dish.type_of_dish1 ?x .\n}\n",
    "compositionality_type": "simple",
    "inferential_chain": [
      "food.dish.type_of_dish1"
    ]
  },
  {
    "qid": "WebQTest-1699",
    "question": "who played kirk?",
    "topic_entity": "m.0crtw",
    "topic_entity_name": "James T. Kirk",
    "answers": [
      "m.06jkh9",
      "m.084m3",
      "m.0c6g1l"
    ],
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0crtw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0crtw ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "compositionality_type": "simple",
    "inferential_chain": [
      "film.film_character.portrayed_in_films",
      "film.performance.actor"
    ]
  },
  {
    "qid": "WebQTest-1803",
    "question": "what does gm make?",
    "topic_entity": "m.035nm",
    "topic_entity_name": "General Motors",
    "answers": [
      "m.015smg",
      "m.03qtfw8"
    ],
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035nm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035nm ns:business.business_operation.industry ?x .\n}\n",
    "compositionality_type": "simple",
    "inferential_chain": [
      "business.business_operation.industry"
    ]
  },
  {
    "qid": "WebQTest-1920",
    "question": "who is rick scott?",
    "topic_entity": "m.0btx2g",
    "topic_entity_name": "Rick Scott",
    "answers": [
      "m.012t_z",
      "m.025sppp",
      "m.0289fz",
      "m.04gc2",
      "m.0fj9f"
    ],
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0btx2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0btx2g ns:people.person.profession ?x .\n}\n",
    "compositionality_type": "simple",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "qid": "WebQTest-417",
    "question": "who plays kenneth?",
    "topic_entity": "m.0272jt5",
    "topic_entity_name": "Kenneth Parcell",
    "answers": [
      "m.0h27vc"
    ],
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0272jt5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0272jt5 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "compositionality_type": "simple",
    "inferential_chain": [
      "tv.tv_character.appeared_in_tv_program",
      "tv.regular_tv_appearance.actor"
    ]
  }
]