[
  {
    "question": "what are all the names of the harry potter books",
    "question_entity": "m.03647x",
    "question_entity_name": "Harry Potter",
    "answer_entities": [
      "m.014jst",
      "m.015pln",
      "m.01lr1g",
      "m.01m5g_",
      "m.03bkkv",
      "m.06_rf9",
      "m.0c_vk"
    ],
    "answer_entity_names": [
      "Harry Potter and the Order of the Phoenix",
      "Harry Potter and the Chamber of Secrets",
      "Harry Potter and the Prisoner of Azkaban",
      "Harry Potter and the Goblet of Fire",
      "Harry Potter and the Deathly Hallows",
      "Harry Potter and the Half-Blood Prince",
      "Harry Potter and the Philosopher's Stone"
    ],
    "hop": 1,
    "qid": "WebQTest-1242",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03647x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03647x ns:book.book_character.appears_in_book ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.book_character.appears_in_book"
    ]
  },
  {
    "question": "what type of art leonardo da vinci do",
    "question_entity": "m.04lg6",
    "question_entity_name": "Leonardo da Vinci",
    "answer_entities": [
      "m.02csf",
      "m.05qdh",
      "m.06msq"
    ],
    "answer_entity_names": [
      "Drawing",
      "Painting",
      "Sculpture"
    ],
    "hop": 1,
    "qid": "WebQTest-1810",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:visual_art.visual_artist.art_forms ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.art_forms"
    ]
  },
  {
    "question": "what did fred durst do",
    "question_entity": "m.01q7cb_",
    "question_entity_name": "Fred Durst",
    "answer_entities": [
      "m.012t_z",
      "m.02hrh1q",
      "m.02jknp",
      "m.039v1",
      "m.09jwl",
      "m.09l65",
      "m.0hpcdn2",
      "m.0nbcg"
    ],
    "answer_entity_names": [
      "Businessperson",
      "Actor",
      "Film director",
      "Guitarist",
      "Musician",
      "Singer",
      "Rapper",
      "Songwriter"
    ],
    "hop": 1,
    "qid": "WebQTest-237",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q7cb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q7cb_ ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what year did adam morrison get drafted",
    "question_entity": "m.08_g4q",
    "question_entity_name": "Adam Morrison",
    "answer_entities": [
      "m.09th87"
    ],
    "answer_entity_names": [
      "2006 NBA draft"
    ],
    "hop": 2,
    "qid": "WebQTest-1933",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08_g4q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08_g4q ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.drafted_athlete.drafted",
      "sports.sports_league_draft_pick.draft"
    ]
  },
  {
    "question": "who is in the american league in baseball",
    "question_entity": "m.0h8b0",
    "question_entity_name": "American League",
    "answer_entities": [
      "m.01d5z",
      "m.01d6g",
      "m.01slc",
      "m.01yhm",
      "m.02d02",
      "m.03m1n",
      "m.049n7",
      "m.04wmvz",
      "m.0512p",
      "m.05lkwhs",
      "m.05ll0s1",
      "m.05m_8",
      "m.05nlyxv",
      "m.062s316",
      "m.06wpc",
      "m.07l4z",
      "m.07l8f",
      "m.07l8x",
      "m.0cqt41",
      "m.0fq2vj2"
    ],
    "answer_entity_names": [
      "Boston Red Sox",
      "Baltimore Orioles",
      "Chicago White Sox",
      "Cleveland Indians",
      "Detroit Tigers",
      "Houston Astros",
      "Kansas City Royals",
      "Los Angeles Angels of Anaheim",
      "Minnesota Twins",
      "Washington Senators",
      "Washington Senators",
      "Oakland Athletics",
      "Philadelphia Athletics",
      "Tampa Bay Devil Rays",
      "Seattle Mariners",
      "Toronto Blue Jays",
      "Tampa Bay Rays",
      "Texas Rangers",
      "New York Yankees",
      "Seattle Pilots"
    ],
    "hop": 1,
    "qid": "WebQTest-1434",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h8b0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h8b0 ns:baseball.baseball_league.teams ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "baseball.baseball_league.teams"
    ]
  },
  {
    "question": "what guitar did joe walsh play",
    "question_entity": "m.01sb5r",
    "question_entity_name": "Joe Walsh",
    "answer_entities": [
      "m.02m873"
    ],
    "answer_entity_names": [
      "Fender Stratocaster"
    ],
    "hop": 1,
    "qid": "WebQTest-548",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sb5r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sb5r ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.guitarist.guitars_played"
    ]
  },
  {
    "question": "what is eminem 's real full name",
    "question_entity": "m.01vsgrn",
    "question_entity_name": "Eminem",
    "answer_entities": [
      "Marshall Bruce Mathers III"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1153",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsgrn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsgrn ns:base.schemastaging.context_name.official_name ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.schemastaging.context_name.official_name"
    ]
  },
  {
    "question": "who was vice president when jfk was president",
    "question_entity": "m.0d3k14",
    "question_entity_name": "John F. Kennedy",
    "answer_entities": [
      "m.0f7fy"
    ],
    "answer_entity_names": [
      "Lyndon B. Johnson"
    ],
    "hop": 1,
    "qid": "WebQTest-98",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:government.us_president.vice_president ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "government.us_president.vice_president"
    ]
  },
  {
    "question": "what kind of music did jimi hendrix play",
    "question_entity": "m.01vsy3q",
    "question_entity_name": "Jimi Hendrix",
    "answer_entities": [
      "m.0155w",
      "m.02l96k",
      "m.02yv6b",
      "m.03lty",
      "m.05w3f",
      "m.06by7",
      "m.06j6l",
      "m.08jyyk",
      "m.09nwwf",
      "m.0cgxt",
      "m.0dl5d",
      "m.0xhtw"
    ],
    "answer_entity_names": [
      "Blues",
      "Acid rock",
      "Blues rock",
      "Heavy metal",
      "Psychedelic rock",
      "Rock music",
      "Rhythm and blues",
      "Experimental rock",
      "Funk rock",
      "Psychedelia",
      "Progressive rock",
      "Hard rock"
    ],
    "hop": 1,
    "qid": "WebQTest-604",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsy3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsy3q ns:music.artist.genre ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.artist.genre"
    ]
  },
  {
    "question": "what team did jackie robinson",
    "question_entity": "m.0443c",
    "question_entity_name": "Jackie Robinson",
    "answer_entities": [
      "m.02_cjl",
      "m.03_wkh",
      "m.0413z4v",
      "m.05fc8c9",
      "m.0fbtm7"
    ],
    "answer_entity_names": [
      "Kansas City Monarchs",
      "Montreal Royals",
      "Los Angeles Bulldogs",
      "Brooklyn Dodgers",
      "UCLA Bruins football"
    ],
    "hop": 2,
    "qid": "WebQTest-972",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443c ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what kind of government does cuba have today",
    "question_entity": "m.0d04z6",
    "question_entity_name": "Cuba",
    "answer_entities": [
      "m.01dw03",
      "m.01fpfn",
      "m.025tbxf",
      "m.06cx9"
    ],
    "answer_entity_names": [
      "Semi-presidential system",
      "Unitary state",
      "Socialist state",
      "Republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1186",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d04z6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d04z6 ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where does the parana river flow",
    "question_entity": "m.02xsr6",
    "question_entity_name": "Paraná River",
    "answer_entities": [
      "m.06n3y"
    ],
    "answer_entity_names": [
      "South America"
    ],
    "hop": 1,
    "qid": "WebQTest-1730",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xsr6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xsr6 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where bin laden got killed",
    "question_entity": "m.05mg9",
    "question_entity_name": "Osama bin Laden",
    "answer_entities": [
      "m.011hs1"
    ],
    "answer_entity_names": [
      "Abbottabad"
    ],
    "hop": 1,
    "qid": "WebQTest-872",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mg9 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where did alexander graham bell die",
    "question_entity": "m.0k70",
    "question_entity_name": "Alexander Graham Bell",
    "answer_entities": [
      "m.08npx8"
    ],
    "answer_entity_names": [
      "Beinn Bhreagh, Nova Scotia"
    ],
    "hop": 1,
    "qid": "WebQTest-910",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k70 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what are the major languages spoken in greece",
    "question_entity": "m.035qy",
    "question_entity_name": "Greece",
    "answer_entities": [
      "m.0349s"
    ],
    "answer_entity_names": [
      "Greek Language"
    ],
    "hop": 1,
    "qid": "WebQTest-371",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what is the stanley cup named after",
    "question_entity": "m.0hn79",
    "question_entity_name": "Stanley Cup",
    "answer_entities": [
      "m.01q69p"
    ],
    "answer_entity_names": [
      "Frederick Stanley, 16th Earl of Derby"
    ],
    "hop": 1,
    "qid": "WebQTest-1871",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hn79)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hn79 ns:symbols.namesake.named_after ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "symbols.namesake.named_after"
    ]
  },
  {
    "question": "what did joe biden study in college",
    "question_entity": "m.012gx2",
    "question_entity_name": "Joe Biden",
    "answer_entities": [
      "m.03g3w",
      "m.062z7"
    ],
    "answer_entity_names": [
      "History",
      "Political Science"
    ],
    "hop": 2,
    "qid": "WebQTest-1988",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012gx2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012gx2 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.major_field_of_study"
    ]
  },
  {
    "question": "who fought the battle of gettysburg",
    "question_entity": "m.01jnm",
    "question_entity_name": "Battle of Gettysburg",
    "answer_entities": [
      "m.012pml",
      "m.020d5",
      "m.02fp48",
      "m.06f5j"
    ],
    "answer_entity_names": [
      "George Meade",
      "Confederate States of America",
      "Union",
      "Robert E. Lee"
    ],
    "hop": 1,
    "qid": "WebQTest-405",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jnm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jnm ns:base.culturalevent.event.entity_involved ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.culturalevent.event.entity_involved"
    ]
  },
  {
    "question": "what language do people speak in the netherlands",
    "question_entity": "m.059j2",
    "question_entity_name": "Netherlands",
    "answer_entities": [
      "m.02bv9",
      "m.02w0r",
      "m.02y3v"
    ],
    "answer_entity_names": [
      "Dutch Language",
      "Frisian languages",
      "West Flemish"
    ],
    "hop": 1,
    "qid": "WebQTest-370",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059j2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059j2 ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "where do they speak german",
    "question_entity": "m.04306rv",
    "question_entity_name": "German Language",
    "answer_entities": [
      "m.0154j",
      "m.01mjq",
      "m.01ppq",
      "m.0345h",
      "m.03f2w",
      "m.03pn9",
      "m.04g61",
      "m.04j53",
      "m.06mzp",
      "m.07ytt",
      "m.082fr",
      "m.0d060g",
      "m.0h7x",
      "m.0hzlz",
      "m.0k6nt"
    ],
    "answer_entity_names": [
      "Belgium",
      "Czech Republic",
      "Cyprus",
      "Germany",
      "East Germany",
      "Second Polish Republic",
      "Luxembourg",
      "Liechtenstein",
      "Switzerland",
      "Vatican City",
      "West Germany",
      "Canada",
      "Austria",
      "South Africa",
      "Denmark"
    ],
    "hop": 1,
    "qid": "WebQTest-1117",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04306rv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04306rv ns:language.human_language.countries_spoken_in ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "language.human_language.countries_spoken_in"
    ]
  },
  {
    "question": "where did robin williams get married",
    "question_entity": "m.0dzf_",
    "question_entity_name": "Robin Williams",
    "answer_entities": [
      "m.0r26s"
    ],
    "answer_entity_names": [
      "St. Helena"
    ],
    "hop": 2,
    "qid": "WebQTest-1938",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dzf_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dzf_ ns:people.person.spouse_s ?y .\n?y ns:people.marriage.location_of_ceremony ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.spouse_s",
      "people.marriage.location_of_ceremony"
    ]
  },
  {
    "question": "what should i do today in san francisco",
    "question_entity": "m.0d6lp",
    "question_entity_name": "San Francisco",
    "answer_entities": [
      "m.012_1t",
      "m.012vvtp_",
      "m.01z4cc",
      "m.022q0n",
      "m.023x4y",
      "m.0245vl",
      "m.025psq",
      "m.027yy0b",
      "m.029bdk",
      "m.02p_8jw",
      "m.02pqty5",
      "m.02rwwk9",
      "m.02z4m5c",
      "m.034gjn",
      "m.035p3",
      "m.03p_pq",
      "m.04lh5gw",
      "m.04ptrc",
      "m.04vhpfx",
      "m.050wqp",
      "m.057mlm",
      "m.058h2l",
      "m.0595pv",
      "m.05nxnt",
      "m.05vvwl",
      "m.05w70m",
      "m.061tjx",
      "m.09ybm9",
      "m.0f726z",
      "m.0fhvgc",
      "m.0g2_pk",
      "m.0g687",
      "m.0h594",
      "m.0hmt3bb",
      "m.0j2gj8v"
    ],
    "answer_entity_names": [
      "San Francisco Museum of Modern Art",
      "Travefy",
      "Angel Island",
      "Coit Tower",
      "Lombard Street",
      "Asian Art Museum of San Francisco",
      "Golden Gate Park",
      "Yerba Buena Center for the Arts",
      "Chinatown",
      "Haas-Lilienthal House",
      "San Francisco Railway Museum",
      "Contemporary Jewish Museum",
      "Consulate General of Mexico, San Francisco",
      "Exploratorium",
      "Golden Gate Bridge",
      "San Francisco City Hall",
      "Camera Obscura",
      "San Francisco cable car system",
      "San Francisco Fire Department Museum",
      "Union Square",
      "Fisherman's Wharf",
      "Ghirardelli Square",
      "Cartoon Art Museum",
      "Baker Beach",
      "San Francisco Ferry Building",
      "Twin Peaks",
      "Crissy Field",
      "Musée Mécanique",
      "Museum of the African Diaspora",
      "Japanese Tea Garden",
      "St. Regis Museum Tower",
      "Presidio of San Francisco",
      "Alcatraz Island",
      "Ripley's Believe It or Not! Museum",
      "Palace of the Legion of Honor"
    ],
    "hop": 1,
    "qid": "WebQTest-1572",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6lp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6lp ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "where is south portland",
    "question_entity": "m.0tpk4",
    "question_entity_name": "South Portland",
    "answer_entities": [
      "m.0nm9h"
    ],
    "answer_entity_names": [
      "Cumberland County"
    ],
    "hop": 1,
    "qid": "WebQTest-1726",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0tpk4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0tpk4 ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what all did ben franklin invent",
    "question_entity": "m.019fz",
    "question_entity_name": "Benjamin Franklin",
    "answer_entities": [
      "m.0135nr",
      "m.013cqs",
      "m.01zh8g",
      "m.029mmz"
    ],
    "answer_entity_names": [
      "Lightning rod",
      "Bifocals",
      "Glass harmonica",
      "Franklin stove"
    ],
    "hop": 1,
    "qid": "WebQTest-1337",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:law.inventor.inventions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "law.inventor.inventions"
    ]
  },
  {
    "question": "what films has daniel craig been in",
    "question_entity": "m.04shbh",
    "question_entity_name": "Daniel Craig",
    "answer_entities": [
      "m.011yr9",
      "m.01q41m",
      "m.01y9r2",
      "m.026hh0m",
      "m.026v977",
      "m.02j48l",
      "m.02rb84n",
      "m.02rqx5y",
      "m.02vxq9m",
      "m.039q43",
      "m.03m5vzd",
      "m.03r0g9",
      "m.03y4nzy",
      "m.0413tm",
      "m.0464d7",
      "m.048qfd",
      "m.04j07xw",
      "m.04j0v7m",
      "m.04jm4c9",
      "m.04w7rn",
      "m.05ch98",
      "m.05nyv3",
      "m.05p7w6k",
      "m.072x7s",
      "m.07b_j6",
      "m.07chxjc",
      "m.07s6472",
      "m.0847m1",
      "m.08gsvw",
      "m.09v84yn",
      "m.0c0pwb",
      "m.0cc5mcj",
      "m.0cj0gy4",
      "m.0cn_srj",
      "m.0cxw2d",
      "m.0d6_s",
      "m.0dgq_kn",
      "m.0g0wx7",
      "m.0g4p4s1",
      "m.0gx91ff",
      "m.0nfp54s",
      "m.0p3rfy6",
      "m.0w16xc1",
      "m.0w1786g"
    ],
    "answer_entity_names": [
      "Elizabeth",
      "A Kid in King Arthur's Court",
      "Road to Perdition",
      "The Invasion",
      "Sharpe's Eagle",
      "Sylvia",
      "The Adventures of Tintin: The Secret of the Unicorn",
      "Some Voices",
      "Skyfall",
      "I Dreamed of Africa",
      "Defiance",
      "Casino Royale",
      "Flashbacks of a Fool",
      "Layer Cake",
      "Enduring Love",
      "The Mother",
      "Kiss and Tell",
      "Sword of Honour",
      "Love and Rage",
      "The Golden Compass",
      "The Jacket",
      "Saint-Ex",
      "The Power of One",
      "Munich",
      "Fateless",
      "Archangel",
      "Hotel Splendide",
      "Infamous",
      "Quantum of Solace",
      "Copenhagen",
      "Renaissance",
      "Cowboys & Aliens",
      "The Adventures of Young Indiana Jones: Daredevils of the Desert",
      "Dream House",
      "Love Is the Devil: Study for a Portrait of Francis Bacon",
      "Lara Croft: Tomb Raider",
      "The Girl with the Dragon Tattoo",
      "The Trench",
      "Obsession",
      "James Bond Supports International Women's Day",
      "The Girl Who Played with Fire",
      "Spectre",
      "Bond 25",
      "The Organ Grinder's Monkey"
    ],
    "hop": 2,
    "qid": "WebQTest-1986",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04shbh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04shbh ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what to do and see in vienna austria",
    "question_entity": "m.0fhp9",
    "question_entity_name": "Vienna",
    "answer_entities": [
      "g.121ymzrf",
      "m.015_kq",
      "m.01c921",
      "m.01fdmj",
      "m.021c8v",
      "m.025zg_7",
      "m.027fx_h",
      "m.02q__dl",
      "m.02w4zw",
      "m.037yl3",
      "m.03yy70",
      "m.04lv9z",
      "m.04zct1",
      "m.0547jg",
      "m.05ksgz",
      "m.071ygm",
      "m.079jqn",
      "m.07xjrz",
      "m.08gckp",
      "m.08j7nmv",
      "m.08k4xy",
      "m.08v5y9",
      "m.098gjd",
      "m.09fvwy",
      "m.0b0lgr",
      "m.0bygq4",
      "m.0c1v9t",
      "m.0czbmkt",
      "m.0dnhg8"
    ],
    "answer_entity_names": [
      "Rock im Park",
      "Schönbrunn Palace",
      "Minoritenkirche",
      "St. Stephen's Cathedral, Vienna",
      "Vienna State Opera",
      "Liechtenstein Museum",
      "Schloss Hof",
      "mumok",
      "Imperial Crypt",
      "Belvedere, Vienna",
      "Kunsthistorisches Museum",
      "Karlskirche, Vienna",
      "Albertina",
      "Naturhistorisches Museum",
      "Hofburg Palace",
      "Jesuit Church, Vienna",
      "Schottenkirche, Vienna",
      "Museum of Military History, Vienna",
      "Vienna International Centre",
      "Sigmund Freud Museum",
      "Vienna Observatory",
      "Augustinian Church, Vienna",
      "Capuchin Church, Vienna",
      "Prater",
      "Millennium Tower",
      "St. Peter's Church",
      "Leopold Museum",
      "Haus der Musik",
      "Rathaus, Vienna"
    ],
    "hop": 1,
    "qid": "WebQTest-361",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fhp9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fhp9 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what galileo galilei was famous for",
    "question_entity": "m.034ks",
    "question_entity_name": "Galileo Galilei",
    "answer_entities": [
      "m.01kf8z",
      "m.06p5g",
      "m.0hggs"
    ],
    "answer_entity_names": [
      "Heliocentrism",
      "Solar System",
      "Kinematics"
    ],
    "hop": 1,
    "qid": "WebQTest-1143",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034ks)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034ks ns:user.lindenb.default_domain.scientist.known_for ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "user.lindenb.default_domain.scientist.known_for"
    ]
  },
  {
    "question": "where did jovan belcher kill himself",
    "question_entity": "m.055d_1d",
    "question_entity_name": "Jovan Belcher",
    "answer_entities": [
      "m.04f_d"
    ],
    "answer_entity_names": [
      "Kansas City"
    ],
    "hop": 1,
    "qid": "WebQTest-459",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055d_1d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055d_1d ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "where was the temple of karnak built",
    "question_entity": "m.014wy4",
    "question_entity_name": "Karnak",
    "answer_entities": [
      "m.02fhym",
      "m.02k54"
    ],
    "answer_entity_names": [
      "Luxor Governorate",
      "Egypt"
    ],
    "hop": 1,
    "qid": "WebQTest-331",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014wy4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014wy4 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what is the zip code for nogales az",
    "question_entity": "m.0qqw9",
    "question_entity_name": "Nogales",
    "answer_entities": [
      "m.01z5r29",
      "m.07nq6b_",
      "m.07nq6d9"
    ],
    "answer_entity_names": [
      "85621",
      "85662",
      "85628"
    ],
    "hop": 1,
    "qid": "WebQTest-567",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qqw9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qqw9 ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "when did the burma cyclone happen",
    "question_entity": "m.041l08b",
    "question_entity_name": "Cyclone Nargis",
    "answer_entities": [
      "2008-04-27"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1272",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041l08b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041l08b ns:meteorology.tropical_cyclone.formed ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "meteorology.tropical_cyclone.formed"
    ]
  },
  {
    "question": "what did gerald r ford die from",
    "question_entity": "m.0c_md_",
    "question_entity_name": "Gerald Ford",
    "answer_entities": [
      "m.02k6hp"
    ],
    "answer_entity_names": [
      "Cardiovascular disease"
    ],
    "hop": 1,
    "qid": "WebQTest-326",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c_md_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c_md_ ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "who does chris hemsworth have a baby with",
    "question_entity": "m.04jnqj",
    "question_entity_name": "Chris Hemsworth",
    "answer_entities": [
      "m.0fccsp"
    ],
    "answer_entity_names": [
      "Elsa Pataky"
    ],
    "hop": 2,
    "qid": "WebQTest-1587",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.04jnqj ns:people.person.children ?y .\n\t?y ns:people.person.parents ?x .\n  FILTER (?x != ns:m.04jnqj) .\n}",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.spouse_s",
      "people.marriage.spouse"
    ]
  },
  {
    "question": "what guitar did kurt cobain",
    "question_entity": "m.0484q",
    "question_entity_name": "Kurt Cobain",
    "answer_entities": [
      "m.047q4j"
    ],
    "answer_entity_names": [
      "Fender Jag-Stang"
    ],
    "hop": 1,
    "qid": "WebQTest-1168",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0484q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0484q ns:music.guitarist.guitars_played ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "music.guitarist.guitars_played"
    ]
  },
  {
    "question": "who do islamic people follow",
    "question_entity": "m.0flw86",
    "question_entity_name": "Islam",
    "answer_entities": [
      "m.055v4c",
      "m.0d05l6",
      "m.0jfd"
    ],
    "answer_entity_names": [
      "Ramdev Pir",
      "God",
      "Allah"
    ],
    "hop": 1,
    "qid": "WebQTest-1940",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.deities ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "religion.religion.deities"
    ]
  },
  {
    "question": "what timezone is utah in",
    "question_entity": "m.07srw",
    "question_entity_name": "Utah",
    "answer_entities": [
      "m.02hczc"
    ],
    "answer_entity_names": [
      "Mountain Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-37",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07srw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07srw ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  }
]