[
  {
    "question": "when did chipper jones get drafted",
    "question_entity": "m.0crdkb",
    "question_entity_name": "Chipper Jones",
    "answer_entities": [
      "m.04cwtph"
    ],
    "answer_entity_names": [
      "1990 Major League Baseball Draft"
    ],
    "hop": 2,
    "qid": "WebQTest-455",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0crdkb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0crdkb ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.drafted_athlete.drafted",
      "sports.sports_league_draft_pick.draft"
    ]
  },
  {
    "question": "what language do serbs speak",
    "question_entity": "m.077qn",
    "question_entity_name": "Serbia",
    "answer_entities": [
      "m.0k0sb"
    ],
    "answer_entity_names": [
      "Serbian language"
    ],
    "hop": 1,
    "qid": "WebQTest-1967",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.077qn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.077qn ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "what country did gregor mendel live in",
    "question_entity": "m.039c5",
    "question_entity_name": "Gregor Mendel",
    "answer_entities": [
      "m.02p5_2s",
      "m.0fs_s"
    ],
    "answer_entity_names": [
      "Austrian Silesia",
      "Brno"
    ],
    "hop": 2,
    "qid": "WebQTest-1835",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.039c5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.039c5 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.places_lived",
      "people.place_lived.location"
    ]
  },
  {
    "question": "what 's my timezone in oklahoma",
    "question_entity": "m.05mph",
    "question_entity_name": "Oklahoma",
    "answer_entities": [
      "m.02fqwt"
    ],
    "answer_entity_names": [
      "Central Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1839",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mph ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "where did rudolf virchow conduct his research",
    "question_entity": "m.011kz4",
    "question_entity_name": "Rudolf Virchow",
    "answer_entities": [
      "m.01stzp",
      "m.03563j"
    ],
    "answer_entity_names": [
      "Humboldt University of Berlin",
      "University of Würzburg"
    ],
    "hop": 2,
    "qid": "WebQTest-160",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.011kz4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.011kz4 ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.employment_history",
      "business.employment_tenure.company"
    ]
  },
  {
    "question": "what did bobby darin die of",
    "question_entity": "m.0pj9t",
    "question_entity_name": "Bobby Darin",
    "answer_entities": [
      "m.02wgfrh"
    ],
    "answer_entity_names": [
      "Surgical complications"
    ],
    "hop": 1,
    "qid": "WebQTest-1564",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pj9t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pj9t ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what are the official languages of argentina",
    "question_entity": "m.0jgd",
    "question_entity_name": "Argentina",
    "answer_entities": [
      "m.06nm1"
    ],
    "answer_entity_names": [
      "Spanish Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1768",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgd ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  },
  {
    "question": "when do world war ii end",
    "question_entity": "m.081pw",
    "question_entity_name": "World War II",
    "answer_entities": [
      "1945-09-02"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-289",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081pw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081pw ns:time.event.end_date ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "time.event.end_date"
    ]
  },
  {
    "question": "what kind of government does poland have",
    "question_entity": "m.05qhw",
    "question_entity_name": "Poland",
    "answer_entities": [
      "m.026wp",
      "m.0glnsx"
    ],
    "answer_entity_names": [
      "Democracy",
      "Parliamentary republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1470",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qhw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qhw ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what school did robert f kennedy go to",
    "question_entity": "m.06hx2",
    "question_entity_name": "Robert F. Kennedy",
    "answer_entities": [
      "m.01mpwj",
      "m.01vc5m",
      "m.02h45k",
      "m.03ksy",
      "m.05qgd9",
      "m.0g8rj"
    ],
    "answer_entity_names": [
      "Harvard College",
      "Bates College",
      "Milton Academy",
      "Harvard University",
      "University of Virginia School of Law",
      "University of Virginia"
    ],
    "hop": 2,
    "qid": "WebQTest-1355",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06hx2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06hx2 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what time zone am i in california",
    "question_entity": "m.01n7q",
    "question_entity_name": "California",
    "answer_entities": [
      "m.02lcqs"
    ],
    "answer_entity_names": [
      "Pacific Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-156",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n7q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n7q ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what type of art does claude monet do",
    "question_entity": "m.01xnj",
    "question_entity_name": "Claude Monet",
    "answer_entities": [
      "m.015r61",
      "m.03xj1"
    ],
    "answer_entity_names": [
      "Modern art",
      "Impressionism"
    ],
    "hop": 1,
    "qid": "WebQTest-1164",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xnj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xnj ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "what currency does the czech republic use now",
    "question_entity": "m.01mjq",
    "question_entity_name": "Czech Republic",
    "answer_entities": [
      "m.04rpc3"
    ],
    "answer_entity_names": [
      "Czech koruna"
    ],
    "hop": 1,
    "qid": "WebQTest-662",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mjq ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what province is montreal canada located",
    "question_entity": "m.052p7",
    "question_entity_name": "Montreal",
    "answer_entities": [
      "m.0694j"
    ],
    "answer_entity_names": [
      "Québec"
    ],
    "hop": 1,
    "qid": "WebQTest-1376",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.052p7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.052p7 ns:base.biblioness.bibs_location.state ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.biblioness.bibs_location.state"
    ]
  },
  {
    "question": "what are all the movies taylor swift has been in",
    "question_entity": "m.0dl567",
    "question_entity_name": "Taylor Swift",
    "answer_entities": [
      "m.02x3lt7",
      "m.06_wqk4",
      "m.087wc7n",
      "m.0djb8hx",
      "m.0dx5q8"
    ],
    "answer_entity_names": [
      "Hannah Montana: The Movie",
      "Valentine's Day",
      "The Lorax",
      "Jonas Brothers: The Concert Experience",
      "The Giver"
    ],
    "hop": 2,
    "qid": "WebQTest-538",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl567)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl567 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "who was the artist of mickey mouse",
    "question_entity": "m.057ph",
    "question_entity_name": "Mickey Mouse",
    "answer_entities": [
      "m.081nh",
      "m.0f2ml"
    ],
    "answer_entity_names": [
      "Walt Disney",
      "Ub Iwerks"
    ],
    "hop": 1,
    "qid": "WebQTest-1238",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.057ph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.057ph ns:fictional_universe.fictional_character.character_created_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "fictional_universe.fictional_character.character_created_by"
    ]
  },
  {
    "question": "where does princess leia live",
    "question_entity": "m.0ddqw",
    "question_entity_name": "Leia Organa",
    "answer_entities": [
      "m.065lhy"
    ],
    "answer_entity_names": [
      "Alderaan"
    ],
    "hop": 1,
    "qid": "WebQTest-643",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ddqw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ddqw ns:fictional_universe.fictional_character.places_lived ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "fictional_universe.fictional_character.places_lived"
    ]
  },
  {
    "question": "what did jack london do for a living",
    "question_entity": "m.0bt23",
    "question_entity_name": "Jack London",
    "answer_entities": [
      "m.016wtf",
      "m.02xhgwq",
      "m.0d8qb",
      "m.0dxtg",
      "m.0f1hr",
      "m.0kyk"
    ],
    "answer_entity_names": [
      "Sailor",
      "Novelist",
      "Journalist",
      "Screenwriter",
      "Essayist",
      "Author"
    ],
    "hop": 1,
    "qid": "WebQTest-2018",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bt23)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bt23 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what position did stanley matthews play",
    "question_entity": "m.013s6x",
    "question_entity_name": "Sir Stanley Matthews",
    "answer_entities": [
      "m.02nzb8",
      "m.02sdk9v",
      "m.03qh1vd"
    ],
    "answer_entity_names": [
      "Midfielder",
      "Forward",
      "Outside forward"
    ],
    "hop": 1,
    "qid": "WebQTest-753",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013s6x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013s6x ns:soccer.football_player.position_s ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "soccer.football_player.position_s"
    ]
  },
  {
    "question": "who founded new york university",
    "question_entity": "m.0bwfn",
    "question_entity_name": "New York University",
    "answer_entities": [
      "m.01p369",
      "m.05m665"
    ],
    "answer_entity_names": [
      "Albert Gallatin",
      "Mordecai Manuel Noah"
    ],
    "hop": 1,
    "qid": "WebQTest-1560",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bwfn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bwfn ns:organization.organization.founders ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "organization.organization.founders"
    ]
  },
  {
    "question": "where to stay in chicago tourist",
    "question_entity": "m.01_d4",
    "question_entity_name": "Chicago",
    "answer_entities": [
      "m.0ldv2s1"
    ],
    "answer_entity_names": [
      "Hotel Sax Chicago"
    ],
    "hop": 1,
    "qid": "WebQTest-2013",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:travel.travel_destination.accommodation ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.accommodation"
    ]
  },
  {
    "question": "what political system did spain have",
    "question_entity": "m.06mkj",
    "question_entity_name": "Spain",
    "answer_entities": [
      "m.018wl5",
      "m.01fpfn",
      "m.01q20",
      "m.04szc"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Unitary state",
      "Constitutional monarchy",
      "Monarchy"
    ],
    "hop": 1,
    "qid": "WebQTest-945",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mkj ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what was franklin pierce famous for",
    "question_entity": "m.02z51",
    "question_entity_name": "Franklin Pierce",
    "answer_entities": [
      "m.01xljv7"
    ],
    "answer_entity_names": [
      "US President"
    ],
    "hop": 1,
    "qid": "WebQTest-1416",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02z51)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02z51 ns:common.topic.notable_types ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "common.topic.notable_types"
    ]
  },
  {
    "question": "where is walton indiana",
    "question_entity": "m.0skd2",
    "question_entity_name": "Walton",
    "answer_entities": [
      "m.03chrxx",
      "m.03v1s",
      "m.09c7w0",
      "m.0ntm1"
    ],
    "answer_entity_names": [
      "Tipton Township",
      "Indiana",
      "United States of America",
      "Cass County"
    ],
    "hop": 1,
    "qid": "WebQTest-1008",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0skd2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0skd2 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what is the government system of malaysia",
    "question_entity": "m.09pmkv",
    "question_entity_name": "Malaysia",
    "answer_entities": [
      "m.018wl5",
      "m.01m4w_",
      "m.01q20",
      "m.026wp"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Elective monarchy",
      "Constitutional monarchy",
      "Democracy"
    ],
    "hop": 1,
    "qid": "WebQTest-516",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09pmkv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09pmkv ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what type of religion does argentina have",
    "question_entity": "m.0jgd",
    "question_entity_name": "Argentina",
    "answer_entities": [
      "m.03_gx",
      "m.05sfs",
      "m.0c8wxp"
    ],
    "answer_entity_names": [
      "Judaism",
      "Protestantism",
      "Catholicism"
    ],
    "hop": 2,
    "qid": "WebQTest-831",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.statistical_region.religions",
      "location.religion_percentage.religion"
    ]
  },
  {
    "question": "where does kurdish people live",
    "question_entity": "m.04c28",
    "question_entity_name": "Kurds",
    "answer_entities": [
      "m.0j0k"
    ],
    "answer_entity_names": [
      "Asia"
    ],
    "hop": 1,
    "qid": "WebQTest-1847",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04c28)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04c28 ns:people.ethnicity.geographic_distribution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.geographic_distribution"
    ]
  },
  {
    "question": "what type of artist is henri matisse",
    "question_entity": "m.0gct_",
    "question_entity_name": "Henri Matisse",
    "answer_entities": [
      "m.01bsxb",
      "m.02csf",
      "m.05qdh",
      "m.06msq",
      "m.0bp7w"
    ],
    "answer_entity_names": [
      "Collage",
      "Drawing",
      "Painting",
      "Sculpture",
      "Printmaking"
    ],
    "hop": 1,
    "qid": "WebQTest-374",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gct_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gct_ ns:visual_art.visual_artist.art_forms ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.art_forms"
    ]
  },
  {
    "question": "where did robin cook die",
    "question_entity": "m.019jy5",
    "question_entity_name": "Robin Cook",
    "answer_entities": [
      "m.012d9h"
    ],
    "answer_entity_names": [
      "Inverness"
    ],
    "hop": 1,
    "qid": "WebQTest-572",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019jy5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019jy5 ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "what does george wilson do for a living",
    "question_entity": "m.0gmk9p",
    "question_entity_name": "George Wilson",
    "answer_entities": [
      "m.02h665k"
    ],
    "answer_entity_names": [
      "American football player"
    ],
    "hop": 1,
    "qid": "WebQTest-1298",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gmk9p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gmk9p ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "where is mount fuji located",
    "question_entity": "m.0cks0",
    "question_entity_name": "Mount Fuji",
    "answer_entities": [
      "m.02hf4r",
      "m.03_3d",
      "m.0g3bw",
      "m.0gqgy",
      "m.0j0k"
    ],
    "answer_entity_names": [
      "Fuji-Hakone-Izu National Park",
      "Japan",
      "Honshu",
      "Chūbu region",
      "Asia"
    ],
    "hop": 1,
    "qid": "WebQTest-1111",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cks0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cks0 ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "what county is frederick md in",
    "question_entity": "m.0dhml",
    "question_entity_name": "Frederick",
    "answer_entities": [
      "m.0cc07"
    ],
    "answer_entity_names": [
      "Frederick County"
    ],
    "hop": 1,
    "qid": "WebQTest-35",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dhml)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dhml ns:location.hud_county_place.county ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.hud_county_place.county"
    ]
  },
  {
    "question": "what films has scarlett johansson been in",
    "question_entity": "m.02114t",
    "question_entity_name": "Scarlett Johansson",
    "answer_entities": [
      "m.0110nff9",
      "m.0125zrjx",
      "m.01jzyf",
      "m.01n30p",
      "m.0209xj",
      "m.02qpt1w",
      "m.02rq3jq",
      "m.02vdw6",
      "m.033g39",
      "m.033s0w",
      "m.03bzjpm",
      "m.03rtz1",
      "m.03t6l4",
      "m.03vfr_",
      "m.0435vm",
      "m.04fvch",
      "m.04gcw8",
      "m.04j1zl8",
      "m.05fmsx",
      "m.05qbckf",
      "m.062zm5h",
      "m.0693hm",
      "m.06gjk9",
      "m.07l5v6",
      "m.07z6xs",
      "m.084302",
      "m.09jcj6",
      "m.0c0rz3",
      "m.0ds1glg",
      "m.0dy575",
      "m.0fgpvf",
      "m.0fldjy",
      "m.0g1vcm",
      "m.0g4nxzt",
      "m.0gxbjgn",
      "m.0gyy53",
      "m.0hz07jj",
      "m.0jzt8tx",
      "m.0kd0k5k",
      "m.0lq6fb5",
      "m.0n15g8q",
      "m.0w1rtg8",
      "m.0w36vqd"
    ],
    "answer_entity_names": [
      "The Jungle Book",
      "Captain America: Civil War",
      "The Man Who Wasn't There",
      "Ghost World",
      "Lost in Translation",
      "Vicky Cristina Barcelona",
      "My Brother the Pig",
      "An American Rhapsody",
      "Home Alone 3",
      "The Horse Whisperer",
      "He's Just Not That Into You",
      "North",
      "Eight Legged Freaks",
      "The SpongeBob SquarePants Movie",
      "The Island",
      "The Perfect Score",
      "A Love Song for Bobby Long",
      "Fall",
      "In Good Company",
      "Iron Man 2",
      "The Avengers",
      "A Good Woman",
      "Match Point",
      "Just Cause",
      "The Black Dahlia",
      "The Prestige",
      "Scoop",
      "The Nanny Diaries",
      "We Bought a Zoo",
      "If Lucy Fell",
      "Girl with a Pearl Earring",
      "The Spirit",
      "Manny & Lo",
      "Buck",
      "Under the Skin",
      "The Other Boleyn Girl",
      "Hitchcock",
      "Captain America: The Winter Soldier",
      "Don Jon",
      "Her",
      "The Avengers: Age of Ultron",
      "Chef",
      "Lucy"
    ],
    "hop": 2,
    "qid": "WebQTest-1087",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02114t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02114t ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what degrees did obama get in college",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.013zdg",
      "m.014mlp"
    ],
    "answer_entity_names": [
      "Juris Doctor",
      "Bachelor of Arts"
    ],
    "hop": 2,
    "qid": "WebQTest-605",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.degree ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.degree"
    ]
  },
  {
    "question": "where was elvis costello born",
    "question_entity": "m.02vr7",
    "question_entity_name": "Elvis Costello",
    "answer_entities": [
      "m.0nbrp"
    ],
    "answer_entity_names": [
      "Paddington"
    ],
    "hop": 1,
    "qid": "WebQTest-215",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vr7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vr7 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what do they speak in norway",
    "question_entity": "m.05b4w",
    "question_entity_name": "Norway",
    "answer_entities": [
      "m.02glq_",
      "m.04d36l",
      "m.05f_3",
      "m.06f7kz",
      "m.09xy1k"
    ],
    "answer_entity_names": [
      "Saami, South Language",
      "Saami, North Language",
      "Norwegian Language",
      "Saami, Lule Language",
      "Finnish, Kven Language"
    ],
    "hop": 1,
    "qid": "WebQTest-1840",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b4w ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what influenced william shakespeare to start writing",
    "question_entity": "m.081k8",
    "question_entity_name": "William Shakespeare",
    "answer_entities": [
      "m.01612m",
      "m.01r7z",
      "m.02lqj",
      "m.03b_m",
      "m.03cdqxx",
      "m.060yy",
      "m.063_9",
      "m.07hl9",
      "m.07km7",
      "m.07yhg",
      "m.09fdm",
      "m.0c2cl",
      "m.0c5h0",
      "m.0j_8y"
    ],
    "answer_entity_names": [
      "Lucian",
      "Christopher Marlowe",
      "Edmund Spenser",
      "Geoffrey Chaucer",
      "John Pory",
      "Plautus",
      "Plutarch",
      "Thomas More",
      "Terence",
      "Virgil",
      "Ovid",
      "Michel de Montaigne",
      "Thomas Kyd",
      "Seneca the Younger"
    ],
    "hop": 1,
    "qid": "WebQTest-1684",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "who inspired obama",
    "question_entity": "m.02mjmr",
    "question_entity_name": "Barack Obama",
    "answer_entities": [
      "m.018q7p",
      "m.01d1nj",
      "m.04ct6p"
    ],
    "answer_entity_names": [
      "Saul Alinsky",
      "Reinhold Niebuhr",
      "Nipsey Russell"
    ],
    "hop": 1,
    "qid": "WebQTest-131",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:influence.influence_node.influenced_by ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "influence.influence_node.influenced_by"
    ]
  },
  {
    "question": "what is the zip code for concord",
    "question_entity": "m.0qymv",
    "question_entity_name": "Concord",
    "answer_entities": [
      "m.01zcvrz",
      "m.01zcvv5",
      "m.01zcw0h",
      "m.01zcwkm",
      "m.07np_n_",
      "m.07np_pf",
      "m.07np_pn",
      "m.07np_pw"
    ],
    "answer_entity_names": [
      "94520",
      "94521",
      "94519",
      "94518",
      "94529",
      "94527",
      "94524",
      "94522"
    ],
    "hop": 1,
    "qid": "WebQTest-1239",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qymv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qymv ns:location.citytown.postal_codes ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.citytown.postal_codes"
    ]
  },
  {
    "question": "which country in europe has the largest land area",
    "question_entity": "m.02j9z",
    "question_entity_name": "Europe",
    "answer_entities": [
      "m.06bnz"
    ],
    "answer_entity_names": [
      "Russia"
    ],
    "hop": 1,
    "qid": "WebQTest-1956",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n                ns:m.02j9z ns:base.locations.continents.countries_within ?x .\n                ?x ns:location.location.area ?y .\n}\nORDER BY DESC(xsd:float(?y))\nLIMIT 1",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "what type of political system is brazil",
    "question_entity": "m.015fr",
    "question_entity_name": "Brazil",
    "answer_entities": [
      "m.01d9r3",
      "m.0c9rw5",
      "m.0j729"
    ],
    "answer_entity_names": [
      "Presidential system",
      "Constitutional republic",
      "Federal republic"
    ],
    "hop": 1,
    "qid": "WebQTest-1875",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015fr ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "where is burundi country",
    "question_entity": "m.0169t",
    "question_entity_name": "Burundi",
    "answer_entities": [
      "m.0dg3n1"
    ],
    "answer_entity_names": [
      "Africa"
    ],
    "hop": 1,
    "qid": "WebQTest-1746",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0169t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0169t ns:base.locations.countries.continent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.locations.countries.continent"
    ]
  }
]