[
  {
    "question": "what is the country code for mexico",
    "question_entity": "m.0b90_r",
    "question_entity_name": "Mexico",
    "answer_entities": [
      "mx"
    ],
    "answer_entity_names": [],
    "hop": 1,
    "qid": "WebQTest-1946",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b90_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b90_r ns:base.aareas.schema.administrative_area.short_name ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.aareas.schema.administrative_area.short_name"
    ]
  },
  {
    "question": "what do they call money in japan",
    "question_entity": "m.03_3d",
    "question_entity_name": "Japan",
    "answer_entities": [
      "m.088n7"
    ],
    "answer_entity_names": [
      "Japanese yen"
    ],
    "hop": 1,
    "qid": "WebQTest-338",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_3d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_3d ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what to do this weekend in manchester with kids",
    "question_entity": "m.052bw",
    "question_entity_name": "Manchester",
    "answer_entities": [
      "m.02lv55",
      "m.02w89p",
      "m.030lpl",
      "m.0383g6",
      "m.0383jm",
      "m.039s65",
      "m.039s6j",
      "m.03cwfv_",
      "m.03d5f9f",
      "m.041xlb",
      "m.0bm8swc",
      "m.0gg7rlr",
      "m.0n4890m"
    ],
    "answer_entity_names": [
      "Imperial War Museum North",
      "Urbis",
      "Old Trafford",
      "Whitworth Art Gallery",
      "Manchester Art Gallery",
      "Manchester Museum",
      "Manchester Jewish Museum",
      "Great Manchester Run",
      "Chinatown, Manchester",
      "Manchester Cathedral",
      "The Moon Under Water, Manchester",
      "Wheel of Manchester",
      "Albert Hall, Manchester"
    ],
    "hop": 1,
    "qid": "WebQTest-775",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.052bw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.052bw ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "travel.travel_destination.tourist_attractions"
    ]
  },
  {
    "question": "what is the name of the currency used in peru",
    "question_entity": "m.016wzw",
    "question_entity_name": "Peru",
    "answer_entities": [
      "m.0b423v"
    ],
    "answer_entity_names": [
      "Peruvian nuevo sol"
    ],
    "hop": 1,
    "qid": "WebQTest-1351",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016wzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016wzw ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what style of art did henri matisse do",
    "question_entity": "m.0gct_",
    "question_entity_name": "Henri Matisse",
    "answer_entities": [
      "m.015r61",
      "m.03xj1",
      "m.049xrv",
      "m.04lx1",
      "m.04y41"
    ],
    "answer_entity_names": [
      "Modern art",
      "Impressionism",
      "Neo-impressionism",
      "Fauvism",
      "Modernism"
    ],
    "hop": 1,
    "qid": "WebQTest-710",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gct_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gct_ ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "visual_art.visual_artist.associated_periods_or_movements"
    ]
  },
  {
    "question": "where did madonna grew up",
    "question_entity": "m.01vs_v8",
    "question_entity_name": "Madonna",
    "answer_entities": [
      "m.0v1xg"
    ],
    "answer_entity_names": [
      "Bay City"
    ],
    "hop": 1,
    "qid": "WebQTest-1454",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vs_v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vs_v8 ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "what is william taft famous for",
    "question_entity": "m.083pr",
    "question_entity_name": "William Howard Taft",
    "answer_entities": [
      "m.04gc2",
      "m.0c5lg",
      "m.0dl08"
    ],
    "answer_entity_names": [
      "Lawyer",
      "Judge",
      "Jurist"
    ],
    "hop": 1,
    "qid": "WebQTest-570",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083pr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083pr ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who is robin roberts father",
    "question_entity": "m.06k3_t",
    "question_entity_name": "Robin Roberts",
    "answer_entities": [
      "m.0czc1yg"
    ],
    "answer_entity_names": [
      "Lawrence E. Roberts"
    ],
    "hop": 1,
    "qid": "WebQTest-698",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06k3_t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06k3_t ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "where was huey newton killed",
    "question_entity": "m.018y0w",
    "question_entity_name": "Huey P. Newton",
    "answer_entities": [
      "m.0dc95"
    ],
    "answer_entity_names": [
      "Oakland"
    ],
    "hop": 1,
    "qid": "WebQTest-1790",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.018y0w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.018y0w ns:people.deceased_person.place_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.place_of_death"
    ]
  },
  {
    "question": "who is captain james cook facts",
    "question_entity": "m.03_j8",
    "question_entity_name": "James Cook",
    "answer_entities": [
      "m.016wtf",
      "m.040vc4s"
    ],
    "answer_entity_names": [
      "Sailor",
      "Explorer"
    ],
    "hop": 1,
    "qid": "WebQTest-1937",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_j8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_j8 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what did george clemenceau do",
    "question_entity": "m.0hff8",
    "question_entity_name": "Georges Clémenceau",
    "answer_entities": [
      "m.016fc2",
      "m.02h668d",
      "m.05t4q",
      "m.0cbd2",
      "m.0d8qb"
    ],
    "answer_entity_names": [
      "Statesman",
      "Publisher",
      "Physician",
      "Writer",
      "Journalist"
    ],
    "hop": 1,
    "qid": "WebQTest-43",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hff8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hff8 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who was ptolemy and what did he do",
    "question_entity": "m.05_0t",
    "question_entity_name": "Ptolemy",
    "answer_entities": [
      "m.025rxky",
      "m.02h6fbs",
      "m.04s2z",
      "m.0h9c",
      "m.0jygg"
    ],
    "answer_entity_names": [
      "Astrologer",
      "Philosopher",
      "Mathematician",
      "Astronomer",
      "Geographer"
    ],
    "hop": 1,
    "qid": "WebQTest-1728",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05_0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05_0t ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "who did tom landry play for",
    "question_entity": "m.019_p3",
    "question_entity_name": "Tom Landry",
    "answer_entities": [
      "m.0118b5s5",
      "m.05gg4",
      "m.07342k"
    ],
    "answer_entity_names": [
      "Texas Longhorns football",
      "New York Giants",
      "New York Yankees"
    ],
    "hop": 2,
    "qid": "WebQTest-1109",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019_p3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019_p3 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.pro_athlete.teams",
      "sports.sports_team_roster.team"
    ]
  },
  {
    "question": "what kind of money do i bring to mexico",
    "question_entity": "m.0b90_r",
    "question_entity_name": "Mexico",
    "answer_entities": [
      "m.012ts8"
    ],
    "answer_entity_names": [
      "Mexican peso"
    ],
    "hop": 1,
    "qid": "WebQTest-1024",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b90_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b90_r ns:location.country.currency_used ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.currency_used"
    ]
  },
  {
    "question": "what sports are popular in germany",
    "question_entity": "m.0345h",
    "question_entity_name": "Germany",
    "answer_entities": [
      "m.01l3wr",
      "m.025t26l",
      "m.025wfyk",
      "m.0260p73",
      "m.026f3ys",
      "m.026pb10",
      "m.026pr2_",
      "m.026t7lw",
      "m.02pnhdq",
      "m.02r4j0b",
      "m.02z6g34",
      "m.030rdb",
      "m.03c38d5",
      "m.03d1r7t",
      "m.03m3xhy",
      "m.03sx6f",
      "m.0414tdm",
      "m.043rstb",
      "m.047nfps",
      "m.04cxm_7",
      "m.04gk22b",
      "m.04jd6b6",
      "m.04jgf73",
      "m.04mx1yr",
      "m.04q8nzj",
      "m.053gfcl",
      "m.05c03j9",
      "m.05prqw",
      "m.06y3b4",
      "m.07ldyjt",
      "m.0bs6dhl",
      "m.0by0kb9",
      "m.0cksc_",
      "m.0cvc05",
      "m.0dt889",
      "m.0h167w",
      "m.0h407v",
      "m.0h408w",
      "m.0h40db",
      "m.0h40f0",
      "m.0h40k4",
      "m.0h40lj"
    ],
    "answer_entity_names": [
      "Germany national football team",
      "Germany national cricket team",
      "Germany national handball team",
      "Germany women's national field hockey team",
      "Germany women's national volleyball team",
      "Germany national beach handball team",
      "Germany women's national beach handball team",
      "Germany women's national handball team",
      "Germany Davis Cup team",
      "Germany Fed Cup team",
      "Germany women's national rugby union team",
      "Germany women's national football team",
      "Germany men's national volleyball team",
      "Germany national korfball team",
      "Germany national rugby league team",
      "German National Ice Hockey Team",
      "Germany national baseball team",
      "Germany national badminton team",
      "Germany national American football team",
      "Germany men's national inline hockey team",
      "Germany national beach soccer team",
      "Germany men's national water polo team",
      "Germany women's national basketball team",
      "Germany national speedway team",
      "Germany men's national pitch and putt team",
      "Germany women's national under-18 ice hockey team",
      "Germany national rugby union team",
      "Germany women's national ice hockey team",
      "Germany national basketball team",
      "Germany U20 women's volleyball team",
      "FC Bayern Munich",
      "BG Göttingen",
      "Alba Berlin",
      "Germany national rugby union team",
      "Brose Baskets",
      "Germany men's national field hockey team",
      "Telekom Baskets Bonn",
      "Skyliners Frankfurt",
      "Köln 99ers",
      "Bayer Giants Leverkusen",
      "EWE Baskets Oldenburg",
      "QTSV Quackenbrück"
    ],
    "hop": 1,
    "qid": "WebQTest-1838",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:sports.sports_team_location.teams ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "sports.sports_team_location.teams"
    ]
  },
  {
    "question": "what is cindy sherman known for",
    "question_entity": "m.074g02",
    "question_entity_name": "Cindy Sherman",
    "answer_entities": [
      "m.02jknp",
      "m.03hz6vv",
      "m.0lgw7",
      "m.0n1h"
    ],
    "answer_entity_names": [
      "Film director",
      "Visual Artist",
      "Photographer",
      "Artist"
    ],
    "hop": 1,
    "qid": "WebQTest-261",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.074g02)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.074g02 ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.profession"
    ]
  },
  {
    "question": "what has ashley greene been in",
    "question_entity": "m.03w9v1d",
    "question_entity_name": "Ashley Greene",
    "answer_entities": [
      "m.011l6lm6",
      "m.012d_3c_",
      "m.013f7hgr",
      "m.03bzfwy",
      "m.03d0sxq",
      "m.03nm_fh",
      "m.047g36w",
      "m.04jlsj4",
      "m.05kdrxt",
      "m.05kdryb",
      "m.05pdh86",
      "m.064mdnk",
      "m.075wx7_",
      "m.075wx89",
      "m.09v4v1k",
      "m.0bs3vgr",
      "m.0cmddrx",
      "m.0djz0rc",
      "m.0gbwht4",
      "m.0j4573m",
      "m.0v998k8",
      "m.0vmy745",
      "m.0vmy7yj"
    ],
    "answer_entity_names": [
      "Burying the Ex",
      "Urge",
      "Staten Island Summer",
      "King of California",
      "Radio Free Albemuth",
      "Twilight",
      "Otis",
      "Shrink",
      "Skateland",
      "A Warrior's Heart",
      "The Twilight Saga: New Moon",
      "Summer's Blood",
      "Eclipse",
      "The Twilight Saga: Breaking Dawn - Part 1",
      "The Apparition",
      "Butter",
      "LOL",
      "The Twilight Saga: Breaking Dawn - Part 2",
      "The Boom Boom Room",
      "Americana",
      "Wish I Was Here",
      "CBGB",
      "Random"
    ],
    "hop": 2,
    "qid": "WebQTest-501",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03w9v1d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03w9v1d ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "what language do navajo people speak",
    "question_entity": "m.08k5jg",
    "question_entity_name": "Navajo people",
    "answer_entities": [
      "m.017yph",
      "m.02h40lc",
      "m.06nm1"
    ],
    "answer_entity_names": [
      "Navajo Language",
      "English Language",
      "Spanish Language"
    ],
    "hop": 1,
    "qid": "WebQTest-196",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08k5jg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08k5jg ns:people.ethnicity.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.ethnicity.languages_spoken"
    ]
  },
  {
    "question": "where does greek language come from",
    "question_entity": "m.0349s",
    "question_entity_name": "Greek Language",
    "answer_entities": [
      "m.05tk2xx"
    ],
    "answer_entity_names": [
      "Attic Group"
    ],
    "hop": 1,
    "qid": "WebQTest-1061",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0349s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0349s ns:base.rosetta.languoid.parent ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "base.rosetta.languoid.parent"
    ]
  },
  {
    "question": "what did john irving wrote",
    "question_entity": "m.042v2",
    "question_entity_name": "John Irving",
    "answer_entities": [
      "m.01l9hr",
      "m.025926",
      "m.025zx",
      "m.026rp1_",
      "m.02z1045",
      "m.03g_q1",
      "m.03p66w",
      "m.05cnz2",
      "m.06ffrnd",
      "m.06l1qtk",
      "m.06pfdf",
      "m.06w3z7",
      "m.07kclvh",
      "m.07p50s",
      "m.0c3rf",
      "m.0g9d_7",
      "m.0jwyh6c"
    ],
    "answer_entity_names": [
      "The Hotel New Hampshire",
      "A Prayer for Owen Meany",
      "The Cider House Rules",
      "A Sound Like Someone Trying Not to Make a Sound",
      "A Son of the Circus",
      "The 158-Pound Marriage",
      "Water Method Man",
      "A Widow for One Year",
      "3 by Irving",
      "The imaginary girlfriend",
      "The Fourth Hand",
      "Until I Find You",
      "Last Night in Twisted River",
      "Setting Free the Bears",
      "The World According to Garp",
      "Trying to Save Piggy Sneed",
      "In One Person"
    ],
    "hop": 1,
    "qid": "WebQTest-449",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042v2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042v2 ns:book.author.works_written ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "book.author.works_written"
    ]
  },
  {
    "question": "what time zone is toronto gmt",
    "question_entity": "m.0h7h6",
    "question_entity_name": "Toronto",
    "answer_entities": [
      "m.02hcv8"
    ],
    "answer_entity_names": [
      "Eastern Time Zone"
    ],
    "hop": 1,
    "qid": "WebQTest-1387",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h7h6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h7h6 ns:location.location.time_zones ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.time_zones"
    ]
  },
  {
    "question": "what did george orwell died of",
    "question_entity": "m.034bs",
    "question_entity_name": "George Orwell",
    "answer_entities": [
      "m.07jwr"
    ],
    "answer_entity_names": [
      "Tuberculosis"
    ],
    "hop": 1,
    "qid": "WebQTest-52",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034bs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034bs ns:people.deceased_person.cause_of_death ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.deceased_person.cause_of_death"
    ]
  },
  {
    "question": "what awards gary paulsen won",
    "question_entity": "m.04fpcx",
    "question_entity_name": "Gary Paulsen",
    "answer_entities": [
      "m.01cd7p",
      "m.027x4ws",
      "m.0463dxd",
      "m.04p1pmd",
      "m.04p1pmh",
      "m.09kkqzd",
      "m.0djddy"
    ],
    "answer_entity_names": [
      "John Newbery Medal",
      "Dorothy Canfield Fisher Children's Book Award",
      "Margaret Edwards Award",
      "Spur Award for Best Juvenile Fiction",
      "Spur Award for Best Juvenile Nonfiction",
      "Anne V. Zarrow Award for Young Readers' Literature",
      "Regina Medal"
    ],
    "hop": 2,
    "qid": "WebQTest-908",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04fpcx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04fpcx ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "award.award_winner.awards_won",
      "award.award_honor.award"
    ]
  },
  {
    "question": "what kind of government is sweden",
    "question_entity": "m.0d0vqn",
    "question_entity_name": "Sweden",
    "answer_entities": [
      "m.018wl5",
      "m.01fpfn",
      "m.01ly4h",
      "m.01q20",
      "m.0drnm"
    ],
    "answer_entity_names": [
      "Parliamentary system",
      "Unitary state",
      "Hereditary monarchy",
      "Constitutional monarchy",
      "Representative democracy"
    ],
    "hop": 1,
    "qid": "WebQTest-314",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0vqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0vqn ns:location.country.form_of_government ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.form_of_government"
    ]
  },
  {
    "question": "what movies did tupac star in",
    "question_entity": "m.07pzc",
    "question_entity_name": "Tupac Shakur",
    "answer_entities": [
      "m.02pkz7",
      "m.06974q",
      "m.08dk0b",
      "m.08dk10",
      "m.08w51z",
      "m.0c6vx0",
      "m.0cc2r_",
      "m.0f4nt1"
    ],
    "answer_entity_names": [
      "Murder Was the Case",
      "Poetic Justice",
      "Gridlock'd",
      "Above the Rim",
      "Juice",
      "Nothing but Trouble",
      "Gang Related",
      "Bullet"
    ],
    "hop": 2,
    "qid": "WebQTest-415",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "film.actor.film",
      "film.performance.film"
    ]
  },
  {
    "question": "where did sanjay gupta go to school",
    "question_entity": "m.02yyk6",
    "question_entity_name": "Sanjay Gupta",
    "answer_entities": [
      "m.027j22s",
      "m.07szy",
      "m.08mhmx"
    ],
    "answer_entity_names": [
      "Novi High School",
      "University of Michigan",
      "University of Michigan Health System"
    ],
    "hop": 2,
    "qid": "WebQTest-1516",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02yyk6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02yyk6 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what did hayes do",
    "question_entity": "m.06g42",
    "question_entity_name": "Rutherford B. Hayes",
    "answer_entities": [
      "m.01xljv7"
    ],
    "answer_entity_names": [
      "US President"
    ],
    "hop": 2,
    "qid": "WebQTest-1328",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06g42)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06g42 ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.object ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "common.topic.notable_for",
      "common.notable_for.object"
    ]
  },
  {
    "question": "who was king henry viii son",
    "question_entity": "m.03p77",
    "question_entity_name": "Henry VIII of England",
    "answer_entities": [
      "m.02s82",
      "m.02sx6f",
      "m.0hn9rc9"
    ],
    "answer_entity_names": [
      "Edward VI of England",
      "Henry FitzRoy, 1st Duke of Richmond and Somerset",
      "Henry, Duke of Cornwall"
    ],
    "hop": 1,
    "qid": "WebQTest-1702",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p77 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.children"
    ]
  },
  {
    "question": "where does fabio capello come from",
    "question_entity": "m.030_wt",
    "question_entity_name": "Fabio Capello",
    "answer_entities": [
      "m.0fgn_n"
    ],
    "answer_entity_names": [
      "San Canzian d'Isonzo"
    ],
    "hop": 1,
    "qid": "WebQTest-2016",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.030_wt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.030_wt ns:people.person.place_of_birth ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.place_of_birth"
    ]
  },
  {
    "question": "where is the mts iceplex in winnipeg",
    "question_entity": "m.0g5r_z_",
    "question_entity_name": "MTS Iceplex",
    "answer_entities": [
      "m.08mhny",
      "m.0pmq2"
    ],
    "answer_entity_names": [
      "Rural Municipality of Headingley",
      "Winnipeg"
    ],
    "hop": 1,
    "qid": "WebQTest-1589",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g5r_z_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g5r_z_ ns:location.location.containedby ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.location.containedby"
    ]
  },
  {
    "question": "where does lil wayne go to school",
    "question_entity": "m.016kjs",
    "question_entity_name": "Lil Wayne",
    "answer_entities": [
      "m.02gnrt",
      "m.02gr81",
      "m.075_jk3",
      "m.076qq2_",
      "m.0h2_zh0"
    ],
    "answer_entity_names": [
      "University of Phoenix",
      "University of Houston",
      "Lafayette Elementary School",
      "Mcmain Magnet Secondary School",
      "Eleanor McMain Secondary School"
    ],
    "hop": 2,
    "qid": "WebQTest-1815",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016kjs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016kjs ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.education",
      "education.education.institution"
    ]
  },
  {
    "question": "what languages are there in japan",
    "question_entity": "m.03_3d",
    "question_entity_name": "Japan",
    "answer_entities": [
      "m.02h40lc",
      "m.02hwhyv",
      "m.02jcw",
      "m.03_9r",
      "m.0jdg7"
    ],
    "answer_entity_names": [
      "English Language",
      "Korean Language",
      "Esperanto Language",
      "Japanese Language",
      "Ainu Language"
    ],
    "hop": 1,
    "qid": "WebQTest-638",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_3d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_3d ns:location.country.languages_spoken ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.languages_spoken"
    ]
  },
  {
    "question": "what country does justin bieber come from",
    "question_entity": "m.06w2sn5",
    "question_entity_name": "Justin Bieber",
    "answer_entities": [
      "m.0d060g"
    ],
    "answer_entity_names": [
      "Canada"
    ],
    "hop": 1,
    "qid": "WebQTest-827",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w2sn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w2sn5 ns:people.person.nationality ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.nationality"
    ]
  },
  {
    "question": "who was the father of king george vi",
    "question_entity": "m.0cm83",
    "question_entity_name": "George VI",
    "answer_entities": [
      "m.0cmpn"
    ],
    "answer_entity_names": [
      "George V"
    ],
    "hop": 1,
    "qid": "WebQTest-497",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cm83)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cm83 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "people.person.parents"
    ]
  },
  {
    "question": "what are all the songs justin bieber wrote",
    "question_entity": "m.06w2sn5",
    "question_entity_name": "Justin Bieber",
    "answer_entities": [
      "m.0116pj4q",
      "m.012k_48s",
      "m.09v3gb4",
      "m.0bbvzq2",
      "m.0bbz4p9",
      "m.0bmc2ql",
      "m.0c3vvnk",
      "m.0fqlv5l",
      "m.0g5b0p2",
      "m.0g5q9ky",
      "m.0j4453t",
      "m.0j64n8c",
      "m.0jwqwyx",
      "m.0jwx2_w",
      "m.0jxk_hq",
      "m.0jxk_kq",
      "m.0jxkzb9",
      "m.0k0l2vf",
      "m.0ljtwfj",
      "m.0qfpkqq",
      "m.0rytzvz",
      "m.0y6b7k5",
      "m.0ynrkyl",
      "m.0yt1lb9",
      "m.0yt3yyw",
      "m.0yt3zg2",
      "m.0z6sgcx",
      "m.0zbv_v0",
      "m.0zdkrym",
      "m.0zg6nnd",
      "m.0zgb5ny",
      "m.0zmzvrc"
    ],
    "answer_entity_names": [
      "Lolly",
      "Home to Mama",
      "Baby",
      "Never Let You Go",
      "Eenie Meenie",
      "Somebody to Love",
      "Never Say Never",
      "Bigger",
      "Pray",
      "First Dance",
      "Live My Life",
      "Boyfriend",
      "Turn to You (Mother's Day Dedication)",
      "Die in Your Arms",
      "Thought Of You",
      "Beauty And A Beat",
      "All Around The World",
      "As Long as You Love Me",
      "Beautiful",
      "Right Here",
      "#thatPower",
      "Heartbreaker",
      "All That Matters",
      "Hold Tight",
      "Wait for a Minute",
      "Recovery",
      "Bad Day",
      "All Bad",
      "PYD",
      "Change Me",
      "Roller Coaster",
      "Confident"
    ],
    "hop": 1,
    "qid": "WebQTest-1592",
    "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\t{ \n\t  # Lyrics\n\t  ns:m.06w2sn5 ns:music.lyricist.lyrics_written ?x .\n\t}\n\tUNION\n\t{\n\t  # Compositions\n\t  ns:m.06w2sn5 ns:music.composer.compositions ?x .\n\t}\n}",
    "dataset": "webqsp",
    "inferential_chain": null
  },
  {
    "question": "what are the three official languages of belgium",
    "question_entity": "m.0154j",
    "question_entity_name": "Belgium",
    "answer_entities": [
      "m.02bv9",
      "m.04306rv",
      "m.064_8sq"
    ],
    "answer_entity_names": [
      "Dutch Language",
      "German Language",
      "French"
    ],
    "hop": 1,
    "qid": "WebQTest-169",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0154j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0154j ns:location.country.official_language ?x .\n}\n",
    "dataset": "webqsp",
    "inferential_chain": [
      "location.country.official_language"
    ]
  }
]