[
  {
    "question": "who created arthur?",
    "question_entity": "Arthur",
    "answer_entities": [
      "m.02g2wh",
      "m.058nj4",
      "m.06_dbm"
    ],
    "hop": 1,
    "qid": "WebQTest-1561",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0px0r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0px0r ns:tv.tv_program.program_creator ?x .\n}\n",
    "dataset": "webqsp"
  },
  {
    "question": "what are bigos?",
    "question_entity": "Bigos",
    "answer_entities": [
      "m.0jnxw"
    ],
    "hop": 1,
    "qid": "WebQTest-1654",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06815z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06815z ns:food.dish.type_of_dish1 ?x .\n}\n",
    "dataset": "webqsp"
  },
  {
    "question": "who played kirk?",
    "question_entity": "James T. Kirk",
    "answer_entities": [
      "m.06jkh9",
      "m.084m3",
      "m.0c6g1l"
    ],
    "hop": 2,
    "qid": "WebQTest-1699",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0crtw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0crtw ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
    "dataset": "webqsp"
  },
  {
    "question": "what does gm make?",
    "question_entity": "General Motors",
    "answer_entities": [
      "m.015smg",
      "m.03qtfw8"
    ],
    "hop": 1,
    "qid": "WebQTest-1803",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035nm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035nm ns:business.business_operation.industry ?x .\n}\n",
    "dataset": "webqsp"
  },
  {
    "question": "who is rick scott?",
    "question_entity": "Rick Scott",
    "answer_entities": [
      "m.012t_z",
      "m.025sppp",
      "m.0289fz",
      "m.04gc2",
      "m.0fj9f"
    ],
    "hop": 1,
    "qid": "WebQTest-1920",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0btx2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0btx2g ns:people.person.profession ?x .\n}\n",
    "dataset": "webqsp"
  },
  {
    "question": "who plays kenneth?",
    "question_entity": "Kenneth Parcell",
    "answer_entities": [
      "m.0h27vc"
    ],
    "hop": 2,
    "qid": "WebQTest-417",
    "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0272jt5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0272jt5 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
    "dataset": "webqsp"
  }
]